#include <ultra64.h>
#include "constants.h"
#include "game/camdraw.h"
#include "game/tex.h"
#include "game/menu.h"
#include "game/stubs/game_102230.h"
#include "game/bg.h"
#include "game/lang.h"
#include "game/pak.h"
#include "game/splat.h"
#include "game/utils.h"
#include "bss.h"
#include "lib/main.h"
#include "lib/memp.h"
#include "lib/model.h"
#include "lib/mema.h"
#include "lib/rng.h"
#include "lib/mtx.h"
#include "lib/libc/ll.h"
#include "data.h"
#include "types.h"
#include "string.h"

/**
 * camdraw_* functions refer to the editing system as a whole.
 * editor_* functions refer to an editor instance (one per player, max 4).
 * phead_* functions refer to an editor slot. There are 22 of these.
 */

#define AUTOCALSTATUS_OFF    0
#define AUTOCALSTATUS_RESET  1
#define AUTOCALSTATUS_2      2
#define AUTOCALSTATUS_3      3
#define AUTOCALSTATUS_4      4
#define AUTOCALSTATUS_5      5
#define AUTOCALSTATUS_FINISH 6

#define EDITOR100_0 0
#define EDITOR100_1 1
#define EDITOR100_2 2
#define EDITOR100_3 3
#define EDITOR100_4 4
#define EDITOR100_5 5

#define HEADID_EDITOR   -1
#define HEADID_SPECIAL2 -2
#define HEADID_UNDO     -3
#define HEADID_SPECIAL4 -4
#define HEADID_SPECIAL5 -5

#define READMODE_INIT        0
#define READMODE_STARTHEADER 1
#define READMODE_DONEHEADER  2
#define READMODE_NULL        3
#define READMODE_EXIT1       4
#define READMODE_EXIT2       5
#define READMODE_EXIT3       6

#define MAX_EDITORS 4

#define NUM_UNK47C 30

#define IMGWIDTH_EDIT  128
#define IMGWIDTH_THUMB 64
#define IMGWIDTH_SAVE  32

#define IMGHEIGHT_EDIT  128
#define IMGHEIGHT_THUMB 64
#define IMGHEIGHT_SAVE  32

#define IMGNUMPIXELS_EDIT  (IMGWIDTH_EDIT * IMGHEIGHT_EDIT)
#define IMGNUMPIXELS_THUMB (IMGWIDTH_THUMB * IMGHEIGHT_THUMB)
#define IMGNUMPIXELS_SAVE  (IMGWIDTH_SAVE * IMGHEIGHT_SAVE)

struct camerafile {
	u8 unk00[128];
	u16 unk80;
	u16 unk82;
	u16 unk84;
	u8 unk86;
	u8 unk87;
	u8 unk88;
	u8 unk89;
	u8 unk8a;
	u8 unk8b;
	u8 unk8c;
	u8 unk8d;
	u16 unk8e_00 : 1;
	u16 unk8e_01 : 1;
	u16 unk8e_02 : 8;
	s16 unk90[7];
	u8 unk9e[IMGNUMPIXELS_SAVE];
};

struct headeditordata {
	/*0x000*/ u32 editorindex;
	/*0x004*/ u32 unk004;
	/*0x008*/ u32 unk008;
	/*0x00c*/ s32 unk00c;
	/*0x010*/ s32 unk010;
	/*0x014*/ u32 unk014[22];
	/*0x06c*/ s32 unk06c[8][8];
	/*0x16c*/ u32 editorslot;
	/*0x170*/ u32 undoslot;
	/*0x174*/ u32 special4slot;
	/*0x178*/ u32 special5slot;
	/*0x17c*/ f32 unk17c[8][8];
	/*0x27c*/ f32 unk27c[8][8];
	/*0x37c*/ s32 numallocations;
	/*0x380*/ u8 *allocations[30];
	/*0x3f8*/ u32 allocationsizes[30];
	/*0x470*/ u8 *unk470; // 128x128
	/*0x474*/ f32 *unk474; // 128x128
	/*0x478*/ f32 *unk478; // 128x128
	/*0x47c*/ u32 *unk47c; // 30 elements
	/*0x480*/ u8 *unk480; // 64x64
	/*0x484*/ struct textureconfig *unk484;
	/*0x488*/ struct textureconfig *unk488;
	/*0x48c*/ u32 unk48c;
};

struct perfecthead {
	/*0x000*/ u32 unk000;
	/*0x004*/ struct textureconfig fullsizetex;
	/*0x010*/ struct textureconfig thumbnailtex;
	/*0x01c*/ u8 *unk01c; // 64x64
	/*0x020*/ u8 *unk020; // 32x32
	/*0x024*/ u8 *unk024;
	/*0x028*/ u32 unk028;
	/*0x02c*/ u32 unk02c;
	/*0x030*/ f32 unk030;
	/*0x034*/ u16 unk034;
	/*0x036*/ u8 quality;
	/*0x038*/ u32 unk038;
	/*0x03c*/ u32 unk03c;
	/*0x040*/ u8 unk040[200];
	/*0x108*/ u8 unk108[500];
	/*0x2fc*/ u8 unk2fc[160];
	/*0x39c*/ s32 colournum;
	/*0x3a0*/ s32 stylenum;
	/*0x3a4*/ s32 unk3a4;
	/*0x3a8*/ s32 unk3a8;
	/*0x3ac*/ s32 unk3ac;
	/*0x3b0*/ s32 unk3b0;
	/*0x3b4*/ s32 unk3b4;
	/*0x3b8*/ s32 unk3b8;
	/*0x3bc*/ s32 unk3bc;
	/*0x3c0*/ s32 unk3c0;
	/*0x3c4*/ s32 unk3c4;
	/*0x3c8*/ s32 unk3c8;
	/*0x3cc*/ s32 unk3cc;
	/*0x3d0*/ f32 unk3d0[7];
	/*0x3ec*/ s32 unk3ec;
	/*0x3f0*/ s32 unk3f0;
	/*0x3f4*/ u16 active : 1;
	/*0x3f4*/ u16 autodeartefact : 1;
	/*0x3f4*/ u16 unk3f4_02 : 1;
	/*0x3f4*/ u16 unk3f4_03 : 1;
	/*0x3f4*/ u16 unk3f4_04 : 1;
	/*0x3f8*/ struct fileguid fileguid;
};

struct headeditor {
	/*0x000*/ u32 unk000;
	/*0x004*/ f32 unk004;
	/*0x008*/ f32 unk008;
	/*0x00c*/ f32 unk00c;
	/*0x010*/ f32 unk010;
	/*0x014*/ f32 unk014;
	/*0x018*/ f32 unk018;
	/*0x01c*/ f32 unk01c;
	/*0x020*/ f32 unk020;
	/*0x024*/ f32 unk024;
	/*0x028*/ f32 unk028;
	/*0x02c*/ f32 unk02c;
	/*0x030*/ f32 unk030;
	/*0x034*/ f32 unk034;
	/*0x038*/ f32 unk038;
	/*0x03c*/ f32 unk03c;
	/*0x040*/ f32 unk040;
	/*0x044*/ f32 unk044;
	/*0x048*/ f32 unk048;
	/*0x04c*/ f32 unk04c;
	/*0x050*/ f32 unk050;
	/*0x054*/ s32 unk054;
	/*0x058*/ u32 unk058;
	/*0x05c*/ s32 timenow;
	/*0x060*/ s32 unk060;
	/*0x064*/ s32 timeinc;
	/*0x068*/ u32 unk068;
	/*0x06c*/ u32 unk06c;
	/*0x070*/ u32 unk070;
	/*0x074*/ s32 unk074;
	/*0x078*/ u32 unk078;
	/*0x07c*/ s32 unk07c;
	/*0x080*/ s32 unk080;
	/*0x084*/ u32 unk084;
	/*0x088*/ s32 unk088;
	/*0x08c*/ u32 unk08c;
	/*0x090*/ s32 unk090;
	/*0x094*/ u32 numvalidimages;
	/*0x098*/ u8 imageslots[30];
	/*0x0b6*/ u8 validimages[30];
	/*0x0d4*/ u8 unk0d4_00 : 1;
	/*0x0d4*/ u8 unk0d4_01 : 1;
	/*0x0d4*/ u8 unk0d4_02 : 1;
	/*0x0d4*/ u8 needsgbpak : 1;
	/*0x0d4*/ u8 unk0d4_04 : 1;
	/*0x0d8*/ void *unk0d8;
	/*0x0dc*/ u32 *unk0dc;
	/*0x0e0*/ u32 unk0e0;
	/*0x0e4*/ u32 unk0e4;
	/*0x0e8*/ u32 unk0e8;
	/*0x0ec*/ u32 unk0ec;
	/*0x0f0*/ u32 unk0f0;
	/*0x0f4*/ u32 readmode;
	/*0x0f8*/ u32 autocalstatus;
	/*0x0fc*/ u32 unk0fc;
	/*0x100*/ u32 unk100;
};

struct headeditordata *g_HeadEditorData;

char *g_CamReadStates[] = {
	"Init",
	"Start Header Read",
	"Header Read Done",
	"Null",
	"Exit 1",
	"Exit 2",
	"Exit 3",
};

const u32 var7f1b60a0[64][2] = {
	{ 0, 0 },
	{ 0, 1 },
	{ 1, 0 },
	{ 2, 0 },
	{ 1, 1 },
	{ 0, 2 },
	{ 0, 3 },
	{ 1, 2 },
	{ 2, 1 },
	{ 3, 0 },
	{ 4, 0 },
	{ 3, 1 },
	{ 2, 2 },
	{ 1, 3 },
	{ 0, 4 },
	{ 0, 5 },
	{ 1, 4 },
	{ 2, 3 },
	{ 3, 2 },
	{ 4, 1 },
	{ 5, 0 },
	{ 6, 0 },
	{ 5, 1 },
	{ 4, 2 },
	{ 3, 3 },
	{ 2, 4 },
	{ 1, 5 },
	{ 0, 6 },
	{ 0, 7 },
	{ 1, 6 },
	{ 2, 5 },
	{ 3, 4 },
	{ 4, 3 },
	{ 5, 2 },
	{ 6, 1 },
	{ 7, 0 },
	{ 7, 1 },
	{ 6, 2 },
	{ 5, 3 },
	{ 4, 4 },
	{ 3, 5 },
	{ 2, 6 },
	{ 1, 7 },
	{ 2, 7 },
	{ 3, 6 },
	{ 4, 5 },
	{ 5, 4 },
	{ 6, 3 },
	{ 7, 2 },
	{ 7, 3 },
	{ 6, 4 },
	{ 5, 5 },
	{ 4, 6 },
	{ 3, 7 },
	{ 4, 7 },
	{ 5, 6 },
	{ 6, 5 },
	{ 7, 4 },
	{ 7, 5 },
	{ 6, 6 },
	{ 5, 7 },
	{ 6, 7 },
	{ 7, 6 },
	{ 7, 7 },
};

const u32 var7f1b62a0[8][8] = {
