#include <ultra64.h>
#include "constants.h"
#include "game/camera.h"
#include "game/game_006900.h"
#include "game/title.h"
#include "game/tex.h"
#include "game/player.h"
#include "game/savebuffer.h"
#include "game/menugfx.h"
#include "game/menu.h"
#include "game/credits.h"
#include "game/game_1531a0.h"
#include "game/file.h"
#include "game/gfxmemory.h"
#include "game/lv.h"
#include "game/music.h"
#include "game/lang.h"
#include "bss.h"
#include "lib/joy.h"
#include "lib/main.h"
#include "lib/memp.h"
#include "lib/mtx.h"
#include "lib/rng.h"
#include "lib/vi.h"
#include "data.h"
#include "types.h"

/**
 * Credits
 *
 * This file handles both the credits sequence and the alternative title screen.
 *
 * For the alternative title screen, title code calls creditsRequestAltTitle
 * before switching the stage to STAGE_CREDITS. For the proper credits, the
 * stage is switched to STAGE_CREDITS without calling creditsRequestAltTitle.
 *
 * Credits are then initialised using creditsReset, then called on each tick
 * using creditsDraw. creditsTick is called from creditsDraw.
 *
 * For the main part of the credits, the scene is composed of:
 * - Two visible background layers
 * - Up to 500 particles that move around on screen
 * - Text shadows/repetitions
 * - Text foreground
 *
 * Once the credits are finished, the second scene begins. The second scene is
 * composed of:
 * - Two visible background layers
 * - Up to 500 particles that move around on screen
 * - The words "PERFECT DARK" scrolling slowly from right to left
 *
 * The second scene loops continuously.
 *
 * For the alternative title, the sequence is started at the second scene.
 *
 * The credits themselves are grouped into slides. Only one slide is shown on
 * screen at a time. Each slide can contain up to four credits, and each credit
 * can contain one or two phrases of text. Credits which contain two phrases can
 * have their phrases displayed side by side or one above the other depending on
 * the credit's configuration.
 */

/**
 * The retain values are transition settings for credits. Most credits only
 * appear on a single slide, so RETAIN_NONE is used for those which makes them
 * transition in and out at the start and end of that slide.
 *
 * For credits that span multiple slides, the credit is repeated on each slide.
 * On the first slide it should use RETAIN OUT, on inner slides use RETAIN_BOTH
 * and on the final slide use RETAIN_IN.
 */

#define RETAIN_NONE 0
#define RETAIN_OUT  1
#define RETAIN_IN   2
#define RETAIN_BOTH 3

#define HDIR_RIGHT 0
#define HDIR_MID   1
#define HDIR_LEFT  2

#define VDIR_BOTTOM 0
#define VDIR_MID    1
#define VDIR_TOP    2

#define MOVETYPE_LINEAR 0
#define MOVETYPE_WAVE   1
#define MOVETYPE_SPIRAL 2
#define MOVETYPE_FLING  3
#define MOVETYPE_TWIST  4
#define MOVETYPE_FALL   99

#define STRETCHTYPE_HORIZONTAL        0
#define STRETCHTYPE_VERTICAL          1
#define STRETCHTYPE_HORIZONTAL_SQUASH 2
#define STRETCHTYPE_VERTICAL_SQUASH   3

#define NUM_CORE_TEAM 16

struct particle {
	f32 x;
	f32 y;
	f32 z;
	f32 rotation;
	u8 movetype;
	u8 confignum;
	u8 unk12;
	u8 size;
	u8 colourindex;
};

struct creditsbglayer {
	s32 type;
	f32 rotspeed;
	f32 panspeed;
	s32 confignum;
};

struct creditsdata {
	/*0x0000*/ u32 unk0000;
	/*0x0004*/ u32 unk0004;
	/*0x0008*/ u32 unk0008;
	/*0x000c*/ struct particle particles[500];
	/*0x2eec*/ u8 unk2eec;
	/*0x2ef0*/ struct menu840 unk2ef0;
	/*0x34a8*/ u8 unk34a8[0xcac];

	/**
	 * Credit indexes 1 through 16 are randomised. coreteammap stores the chosen
	 * order. The index is the apparent credit index and the value is the real
	 * credit index that it maps to.
	 */
	/*0x4154*/ u32 coreteammap[NUM_CORE_TEAM + 1];

	/**
	 * creditnum is the credit index of the first credit being displayed on the
	 * current slide. It's usually a title.
	 *
	 * However, if creditnum is between 1 and 16 then this value gets mapped
	 * through the coreteammap, so its value won't actually correspond with the
	 * credit being displayed.
	 */
	/*0x4198*/ s32 creditnum;

	/*0x419c*/ u8 numthisslide;
	/*0x41a0*/ f32 slideage; // age in seconds
	/*0x41a4*/ f32 slidelifetime; // in seconds
	/*0x41a8*/ u8 unk41a8[8];
	/*0x41b0*/ s8 unk41b0[2];
	/*0x41b4*/ struct creditsbglayer bglayers[4];
	/*0x41f4*/ u8 slidesenabled;
	/*0x41f5*/ s8 particlecolourindex1;
	/*0x41f6*/ s8 particlecolourindex2;
	/*0x41f8*/ f32 particlecolourweight;
	/*0x41fc*/ u8 particlemovetype;
	/*0x41fd*/ u8 particleconfignum1;
	/*0x41fe*/ u8 particleconfignum2;
	/*0x41ff*/ u8 particlemaxsize;
	/*0x4200*/ u8 particleminsize;
	/*0x4204*/ u32 blacktimer60;
	/*0x4208*/ u8 unk4208;
	/*0x420c*/ u32 unk420c;
	/*0x4210*/ u32 unk4210;
	/*0x4214*/ u32 unk4214;
	/*0x4218*/ u32 unk4218;
	/*0x421c*/ u32 unk421c;
	/*0x4220*/ u32 unk4220;
	/*0x4224*/ u32 unk4224;
	/*0x4228*/ u32 unk4228;
	/*0x422c*/ u32 unk422c;
	/*0x4230*/ u32 unk4230;
	/*0x4234*/ u32 unk4234;
	/*0x4238*/ u32 unk4238;
	/*0x423c*/ u32 unk423c;
};

f32 g_CreditsParticleRotationFrac;
u32 g_CreditsCurFrame;
u32 g_CreditsPrevFrame;
u32 g_CreditsCurFrame2;
struct creditsdata *g_CreditsData;

bool g_CreditsScrollStarted = false;
bool g_CreditsAltTitleRequested = false;
bool g_CreditsUsingAltTitle = false;

void creditsMap4BgVertices(Vtx *vertices, f32 arg1, f32 arg2, f32 arg3, f32 arg4, f32 arg5, f32 arg6)
{
	f32 a = arg2 * sinf(arg1) + arg3 * cosf(arg1);
	f32 b = arg2 * cosf(arg1) - arg3 * sinf(arg1);

	vertices[0].s = (sinf(arg4) + cosf(arg4)) * arg5 + a;
	vertices[0].t = (cosf(arg4) - sinf(arg4)) * arg6 + b;

	vertices[1].s = (sinf(arg4 + 1.5707963705063f) + cosf(arg4 + 1.5707963705063f)) * arg5 + a;
	vertices[1].t = (cosf(arg4 + 1.5707963705063f) - sinf(arg4 + 1.5707963705063f)) * arg6 + b;

	vertices[2].s = (sinf(arg4 + 3.1415927410126f) + cosf(arg4 + 3.1415927410126f)) * arg5 + a;
	vertices[2].t = (cosf(arg4 + 3.1415927410126f) - sinf(arg4 + 3.1415927410126f)) * arg6 + b;

	vertices[3].s = (sinf(arg4 + 4.7123889923096f) + cosf(arg4 + 4.7123889923096f)) * arg5 + a;
	vertices[3].t = (cosf(arg4 + 4.7123889923096f) - sinf(arg4 + 4.7123889923096f)) * arg6 + b;
}

void creditsMap9BgVertices(Vtx *vertices, f32 arg1, f32 arg2, f32 arg3, f32 arg4, f32 arg5, f32 arg6)
{
	f32 a = arg2 * sinf(arg1) + arg3 * cosf(arg1);
	f32 b = arg2 * cosf(arg1) - arg3 * sinf(arg1);

	vertices[0].s = (sinf(arg4) + cosf(arg4)) * arg5 + a;
	vertices[0].t = (cosf(arg4) - sinf(arg4)) * arg6 + b;

	vertices[2].s = (sinf(arg4 + 1.5707963705063f) + cosf(arg4 + 1.5707963705063f)) * arg5 + a;
	vertices[2].t = (cosf(arg4 + 1.5707963705063f) - sinf(arg4 + 1.5707963705063f)) * arg6 + b;

	vertices[8].s = (sinf(arg4 + 3.1415927410126f) + cosf(arg4 + 3.1415927410126f)) * arg5 + a;
	vertices[8].t = (cosf(arg4 + 3.1415927410126f) - sinf(arg4 + 3.1415927410126f)) * arg6 + b;

	vertices[6].s = (sinf(arg4 + 4.7123889923096f) + cosf(arg4 + 4.7123889923096f)) * arg5 + a;
	vertices[6].t = (cosf(arg4 + 4.7123889923096f) - sinf(arg4 + 4.7123889923096f)) * arg6 + b;

	vertices[1].s = (vertices[0].s + vertices[2].s) / 2;
	vertices[1].t = (vertices[0].t + vertices[2].t) / 2;

	vertices[3].s = (vertices[0].s + vertices[6].s) / 2;
	vertices[3].t = (vertices[0].t + vertices[6].t) / 2;

	vertices[5].s = (vertices[8].s + vertices[2].s) / 2;
	vertices[5].t = (vertices[8].t + vertices[2].t) / 2;

	vertices[7].s = (vertices[6].s + vertices[8].s) / 2;
	vertices[7].t = (vertices[6].t + vertices[8].t) / 2;

	vertices[4].s = (vertices[3].s + vertices[5].s) / 2;
	vertices[4].t = (vertices[3].t + vertices[5].t) / 2;
}

/**
 * Initialises the vertices coordinates. The generated x and y coordinates are:
 *
 * 0:  -1800  -1800
 * 1:  0      -1800
 * 2:  1800   -1800
 * 3:  -1800  0
 * 4:  0      0
 * 5:  1800   0
 * 6:  -1800  1800
 * 7:  0      1800
 * 8:  1800   1800
 */
void creditsInitBgVertices(Vtx *vertices, s32 z)
{
	s32 i;

	for (i = 0; i < 9; i++) {
		vertices[i].x = (i % 3) * 1800 - 1800;
		vertices[i].y = (i / 3) * 1800 - 1800;
		vertices[i].z = z;
	}
}

struct bgconfig {
	/*0x00*/ f32 unk00;
	/*0x04*/ u8 s[9];
	/*0x10*/ u32 colours[3][3];
};

struct bgconfig g_CreditsBgConfigs[] = {
	{ 0.20, { 0, 1, 0, 1, 2, 1, 0, 1, 0 }, { { 0x000064, 0x000064, 0x000000 }, { 0x003d84, 0x003d84, 0x000000 }, { 0x36003d, 0x36003d, 0x000000 } } },
	{ 1.00, { 0, 1, 0, 1, 2, 1, 0, 1, 0 }, { { 0x000037, 0x0079a2, 0x36003d }, { 0x0079a2, 0x36003d, 0x000037 }, { 0x36003d, 0x000037, 0x0079a2 } } },
	{ 0.20, { 0, 1, 0, 1, 2, 1, 0, 1, 0 }, { { 0x36003d, 0x51003f, 0x000037 }, { 0x51003f, 0x000037, 0x36003d }, { 0x0000a6, 0x36003d, 0x51003f } } },
	{ 0.20, { 0, 1, 0, 1, 2, 1, 0, 1, 0 }, { { 0x003d84, 0x003d84, 0x000064 }, { 0x000064, 0x003d84, 0x003d84 }, { 0x36003d, 0x003d84, 0x36003d } } },
	{ 0.20, { 0, 1, 0, 1, 2, 1, 0, 1, 0 }, { { 0x004345, 0x004345, 0x51003f }, { 0x000037, 0x000037, 0x004345 }, { 0x0079a2, 0x004345, 0x0079a2 } } },
	{ 0.20, { 0, 1, 0, 1, 2, 1, 0, 1, 0 }, { { 0x0000a6, 0x0000a6, 0x000000 }, { 0x0000a6, 0x0000a6, 0x000000 }, { 0x0000a6, 0x0000a6, 0x000000 } } },
