#include <ultra64.h>
#include "constants.h"
#include "game/game_006900.h"
#include "game/gfxmemory.h"
#include "game/savebuffer.h"
#include "game/game_1531a0.h"
#include "game/file.h"
#include "game/lang.h"
#include "bss.h"
#include "lib/vi.h"
#include "lib/dma.h"
#include "lib/main.h"
#include "lib/memp.h"
#include "data.h"
#include "types.h"

#define SPACE_WIDTH 5

#define BLENDTYPE_DIAGONAL   0x01
#define BLENDTYPE_VERTICAL   0x02
#define BLENDTYPE_WAVE       0x04
#define BLENDTYPE_MENU       0x08
#define BLENDTYPE_HORIZONTAL 0x10

static Gfx *text0f156a24(Gfx *gdl, s32 x, s32 y, struct fontchar *char1, s32 arg4, s32 arg5, s32 arg6, s32 arg7);

struct blendsettings {
	/*0x00*/ u8 types;
	/*0x04*/ u32 colour04;
	/*0x08*/ u32 colour08;
	/*0x0c*/ s32 diagrefx;
	/*0x10*/ s32 diagrefy;
	/*0x14*/ f32 diagtimer;
	/*0x18*/ u8 diagmode;
	/*0x1c*/ s32 backupdiagrefx;
	/*0x20*/ s32 backupdiagrefy;
	/*0x24*/ f32 backupdiagtimer;
	/*0x28*/ u8 backupdiagmode;
	/*0x29*/ u8 backupdiagtypes;
	/*0x2a*/ u8 backuptypes;
	/*0x2c*/ s32 vertrefy1;
	/*0x30*/ s32 vertrefy2;
	/*0x34*/ s32 vert34;
	/*0x38*/ s32 horizrefx1;
	/*0x3c*/ s32 horizrefx2;
	/*0x40*/ s32 horiz40;
	/*0x44*/ u32 colour44;
	/*0x48*/ u32 colour48;
	/*0x4c*/ s32 wave4c;
	/*0x50*/ s32 wave50;
	/*0x54*/ s32 wave54;
	/*0x58*/ u32 wavecolour1;
	/*0x5c*/ u32 wavecolour2;
	/*0x60*/ u32 menuweight;
};

struct blendsettings g_Blend;
Gfx *var800a4634;
u32 var800a463c;

s32 var8007fac4 = 0;
bool g_TextRotated90 = false;
s32 g_WrapIndentCount = 0;
s32 var8007fad0 = 1;

s32 var8007fad4 = -1;
u32 var8007fad8 = 0x00000000;
s32 var8007fadc = 0;
s32 var8007fae0 = 0;
u32 var8007fae4 = 0x00000000;
u32 var8007fae8 = 0x00000000;

struct font *g_FontNumeric = NULL;
struct fontchar *g_CharsNumeric = NULL;
struct font *g_FontHandelGothicXs = NULL;
struct fontchar *g_CharsHandelGothicXs = NULL;
struct font *g_FontHandelGothicSm = NULL;
struct fontchar *g_CharsHandelGothicSm = NULL;
struct font *g_FontHandelGothicMd = NULL;
struct fontchar *g_CharsHandelGothicMd = NULL;
struct font *g_FontHandelGothicLg = NULL;
struct fontchar *g_CharsHandelGothicLg = NULL;

u16 var8007fb3c[] = {
	0xff00, 0xff00, 0xff00, 0xff00, 0xff00, 0xff00, 0xff00, 0xff00,
	0xff00, 0xff24, 0xff48, 0xff6c, 0xff90, 0xffb4, 0xffd8, 0xffff,
};

u16 var8007fb5c[] = {
