#include <ultra64.h>
#include "constants.h"
#include "game/game_006900.h"
#include "game/gfxmemory.h"
#include "game/savebuffer.h"
#include "game/text.h"
#include "game/file.h"
#include "game/lang.h"
#include "bss.h"
#include "lib/vi.h"
#include "lib/dma.h"
#include "lib/main.h"
#include "lib/memp.h"
#include "data.h"
#include "types.h"

#define SPACE_WIDTH 5

#define BLENDTYPE_DIAGONAL   0x01
#define BLENDTYPE_VERTICAL   0x02
#define BLENDTYPE_WAVE       0x04
#define BLENDTYPE_MENU       0x08
#define BLENDTYPE_HORIZONTAL 0x10

struct blendsettings {
	/*0x00*/ u8 types;
	/*0x04*/ u32 colour04;
	/*0x08*/ u32 colour08;
	/*0x0c*/ s32 diagrefx;
	/*0x10*/ s32 diagrefy;
	/*0x14*/ f32 diagtimer;
	/*0x18*/ u8 diagmode;
	/*0x1c*/ s32 backupdiagrefx;
	/*0x20*/ s32 backupdiagrefy;
	/*0x24*/ f32 backupdiagtimer;
	/*0x28*/ u8 backupdiagmode;
	/*0x29*/ u8 backupdiagtypes;
	/*0x2a*/ u8 backuptypes;
	/*0x2c*/ s32 vertrefy1;
	/*0x30*/ s32 vertrefy2;
	/*0x34*/ s32 vert34;
	/*0x38*/ s32 horizrefx1;
	/*0x3c*/ s32 horizrefx2;
	/*0x40*/ s32 horiz40;
	/*0x44*/ u32 colour44;
	/*0x48*/ u32 colour48;
	/*0x4c*/ s32 wave4c;
	/*0x50*/ s32 wave50;
	/*0x54*/ s32 wave54;
	/*0x58*/ u32 wavecolour1;
	/*0x5c*/ u32 wavecolour2;
	/*0x60*/ u32 menuweight;
};

#if VERSION == VERSION_JPN_FINAL
s32 g_JpnKerning[13 * 13];
#endif

struct blendsettings g_Blend;
Gfx *g_TextHoloRayGdl;
Gfx *g_TextHoloRayGdlEnd;
#if VERSION == VERSION_JPN_FINAL
struct fontchar g_TmpJpnChar;
#endif
u32 var800a463c;

#if VERSION == VERSION_JPN_FINAL
s32 var800800f0jf = 0;
s32 g_UiScaleX = 1;
bool var80080104jf = false;
s32 g_TextCharOverlap = 0;
bool g_TextRotated90 = false;
s32 g_WrapIndentCount = 0;
s32 g_TextScaleX = 1;
s32 var80080108jf = 1;
#else
s32 g_UiScaleX = 1;
s32 g_TextCharOverlap = 0;
bool g_TextRotated90 = false;
s32 g_WrapIndentCount = 0;
s32 g_TextScaleX = 1;
#endif

s32 g_TextParaOverlap = -1; // higher value reduces margin between paragraphs
bool g_TextUseAverageSampling = false;
s32 var8007fadc = 0;
s32 var8007fae0 = 0;
u32 var8007fae4 = 0;
u32 var8007fae8 = 0;
u32 var8007faec = 0;
u32 var8007faf0 = 0;

struct font *g_FontTahoma2 = NULL;
struct fontchar *g_FontTahoma1 = NULL;
struct font *g_FontNumeric = NULL;
