#include <ultra64.h>
#include "n_libaudio.h"
#include "constants.h"
#include "game/file.h"
#include "game/lv.h"
#include "game/music.h"
#include "bss.h"
#include "naudio/n_sndp.h"
#include "lib/rzip.h"
#include "lib/args.h"
#include "lib/audiomgr.h"
#include "lib/crash.h"
#include "lib/dma.h"
#include "lib/snd.h"
#include "lib/memp.h"
#include "lib/rng.h"
#include "lib/str.h"
#include "lib/osc.h"
#include "lib/lib_317f0.h"
#include "lib/mp3.h"
#include "lib/lib_39c80.h"
#include "lib/speaker.h"
#include "data.h"
#include "types.h"

#define MAX_SEQ_SIZE_4MB 1024 * 14
#define MAX_SEQ_SIZE_8MB 1024 * 18

#define NUM_CACHE_SLOTS 45
#define NUM_VOLUMES 9

struct sndcache {
	/*0x0000*/ u16 *indexes; // indexed by sfxnum, value is cache index (0-44) or 0xffff
	/*0x0004*/ u8 refcounts[NUM_CACHE_SLOTS];
	/*0x0032*/ u16 ages[NUM_CACHE_SLOTS];
	/*0x008c*/ ALEnvelope envelopes[NUM_CACHE_SLOTS];
	/*0x035c*/ ALKeyMap keymaps[NUM_CACHE_SLOTS];
	/*0x046c*/ ALWaveTable wavetables[NUM_CACHE_SLOTS];
	/*0x07f0*/ ALADPCMBook books[NUM_CACHE_SLOTS];
	/*0x3658*/ ALADPCMloop loops[NUM_CACHE_SLOTS];
	/*0x3e14*/ ALSound sounds[NUM_CACHE_SLOTS];
};

struct curmp3 {
	union soundnumhack sfxref;
	u32 playing;
	u32 unk08;
	s32 responsetimer240;
	s32 prevwhisper;
	s32 prevacknowledge;
	s32 prevgreeting;
	u32 romaddr;
	u32 romsize;
	s32 responsetype;
};

s32 g_NumSounds;
u32 *g_ALSoundRomOffsets;
s32 g_SndMaxFxBusses;
u32 var80094eac;
struct curmp3 g_SndCurMp3;
struct seqinstance g_SeqInstances[3];
ALHeap g_SndHeap;
u32 var80095200;
ALBank *var80095204;
struct seqtable *g_SeqTable;
u32 g_SeqBufferSize;
ALIGNED16 struct sndcache g_SndCache;

const char g_SndGuardString[] = "RUSSES SOUND GUARD STRING";
const char var70053b3c[] = "Snd: SoundHeaderCacheInit\n";

bool g_SndDisabled = false;
u32 var8005dda4 = 0x00000000;

s32 g_SndNosediveVolume = 0;
s32 g_SndNosediveAge240 = -1;
s32 g_SndNosediveDuration240 = 0;

s32 g_SndUfoVolume = 0;
s32 g_SndUfoAge240 = -1;
s32 g_SndUfoDuration240 = 0;

struct sndstate *g_SndNosediveHandle = NULL;
struct sndstate *g_SndUfoHandle = NULL;

