#ifndef _IN_GAME_CREDITS_H
#define _IN_GAME_CREDITS_H
#include <ultra64.h>
#include "types.h"

u32 func0f137430(void);
u32 func0f1377d0(void);
u32 func0f137874(void);
Gfx *creditsRenderBackgroundLayer(Gfx *gdl, u8 type, u8 arg2, f32 arg3, u32 arg4, s32 arg5);
void func0f137ea8(s32 arg0, s32 arg1, s32 arg2);
Gfx *creditsRenderBackground(Gfx *gdl);
f32 func0f1382e0(f32 range);
void creditsRandomiseBackground(u32 arg0);
Gfx *func0f1384b4(Gfx *gdl, u32 arg1);
u32 func0f13870c(void);
void func0f13899c(void);
u32 func0f138e6c(void);
Gfx *creditsRenderSprites(Gfx *gdl);
u32 func0f1399d0(void);
u32 func0f139d9c(void);
u32 func0f139fe0(void);
u32 func0f13a0e4(void);
u32 func0f13a164(void);
Gfx *func0f13a3ec(Gfx *gdl);
u32 func0f13ae04(void);
void creditsTick(void);
Gfx *creditsRender(Gfx *gdl);
void creditsInit(void);
void func0f13b660(void);

struct credits41b4 {
	s32 type;
	f32 rotatespeed;
	f32 unk08;
	u32 unk0c;
};

struct creditsdata {
	/*0x0000*/ u32 unk0000;
	/*0x0004*/ u32 unk0004;
	/*0x0008*/ u32 unk0008;
	/*0x000c*/ u32 unk000c;
	/*0x0010*/ u32 unk0010;
	/*0x0014*/ u32 unk0014;
	/*0x0018*/ u32 unk0018;
	/*0x001c*/ u32 unk001c;
	/*0x0020*/ u32 unk0020;
	/*0x0024*/ u32 unk0024;
	/*0x0028*/ u32 unk0028;
	/*0x002c*/ u32 unk002c;
	/*0x0030*/ u32 unk0030;
	/*0x0034*/ u32 unk0034;
	/*0x0038*/ u32 unk0038;
	/*0x003c*/ u32 unk003c;
	/*0x0040*/ u32 unk0040;
	/*0x0044*/ u32 unk0044;
	/*0x0048*/ u32 unk0048;
	/*0x004c*/ u32 unk004c;
	/*0x0050*/ u32 unk0050;
	/*0x0054*/ u32 unk0054;
	/*0x0058*/ u32 unk0058;
	/*0x005c*/ u32 unk005c;
	/*0x0060*/ u32 unk0060;
	/*0x0064*/ u32 unk0064;
	/*0x0068*/ u32 unk0068;
	/*0x006c*/ u32 unk006c;
	/*0x0070*/ u32 unk0070;
	/*0x0074*/ u32 unk0074;
	/*0x0078*/ u32 unk0078;
	/*0x007c*/ u32 unk007c;
	/*0x0080*/ u32 unk0080;
	/*0x0084*/ u32 unk0084;
	/*0x0088*/ u32 unk0088;
	/*0x008c*/ u32 unk008c;
	/*0x0090*/ u32 unk0090;
	/*0x0094*/ u32 unk0094;
	/*0x0098*/ u32 unk0098;
	/*0x009c*/ u32 unk009c;
	/*0x00a0*/ u32 unk00a0;
	/*0x00a4*/ u32 unk00a4;
	/*0x00a8*/ u32 unk00a8;
	/*0x00ac*/ u32 unk00ac;
	/*0x00b0*/ u32 unk00b0;
	/*0x00b4*/ u32 unk00b4;
	/*0x00b8*/ u32 unk00b8;
	/*0x00bc*/ u32 unk00bc;
	/*0x00c0*/ u32 unk00c0;
	/*0x00c4*/ u32 unk00c4;
	/*0x00c8*/ u32 unk00c8;
	/*0x00cc*/ u32 unk00cc;
	/*0x00d0*/ u32 unk00d0;
	/*0x00d4*/ u32 unk00d4;
	/*0x00d8*/ u32 unk00d8;
	/*0x00dc*/ u32 unk00dc;
	/*0x00e0*/ u32 unk00e0;
	/*0x00e4*/ u32 unk00e4;
	/*0x00e8*/ u32 unk00e8;
	/*0x00ec*/ u32 unk00ec;
	/*0x00f0*/ u32 unk00f0;
	/*0x00f4*/ u32 unk00f4;
	/*0x00f8*/ u32 unk00f8;
	/*0x00fc*/ u32 unk00fc;
	/*0x0100*/ u32 unk0100;
	/*0x0104*/ u32 unk0104;
	/*0x0108*/ u32 unk0108;
	/*0x010c*/ u32 unk010c;
	/*0x0110*/ u32 unk0110;
	/*0x0114*/ u32 unk0114;
	/*0x0118*/ u32 unk0118;
	/*0x011c*/ u32 unk011c;
	/*0x0120*/ u32 unk0120;
	/*0x0124*/ u32 unk0124;
	/*0x0128*/ u32 unk0128;
	/*0x012c*/ u32 unk012c;
	/*0x0130*/ u32 unk0130;
	/*0x0134*/ u32 unk0134;
	/*0x0138*/ u32 unk0138;
	/*0x013c*/ u32 unk013c;
	/*0x0140*/ u32 unk0140;
	/*0x0144*/ u32 unk0144;
	/*0x0148*/ u32 unk0148;
	/*0x014c*/ u32 unk014c;
	/*0x0150*/ u32 unk0150;
	/*0x0154*/ u32 unk0154;
	/*0x0158*/ u32 unk0158;
	/*0x015c*/ u32 unk015c;
	/*0x0160*/ u32 unk0160;
	/*0x0164*/ u32 unk0164;
	/*0x0168*/ u32 unk0168;
	/*0x016c*/ u32 unk016c;
	/*0x0170*/ u32 unk0170;
	/*0x0174*/ u32 unk0174;
	/*0x0178*/ u32 unk0178;
	/*0x017c*/ u32 unk017c;
	/*0x0180*/ u32 unk0180;
	/*0x0184*/ u32 unk0184;
	/*0x0188*/ u32 unk0188;
	/*0x018c*/ u32 unk018c;
	/*0x0190*/ u32 unk0190;
	/*0x0194*/ u32 unk0194;
	/*0x0198*/ u32 unk0198;
	/*0x019c*/ u32 unk019c;
	/*0x01a0*/ u32 unk01a0;
	/*0x01a4*/ u32 unk01a4;
	/*0x01a8*/ u32 unk01a8;
	/*0x01ac*/ u32 unk01ac;
	/*0x01b0*/ u32 unk01b0;
	/*0x01b4*/ u32 unk01b4;
	/*0x01b8*/ u32 unk01b8;
	/*0x01bc*/ u32 unk01bc;
	/*0x01c0*/ u32 unk01c0;
	/*0x01c4*/ u32 unk01c4;
	/*0x01c8*/ u32 unk01c8;
	/*0x01cc*/ u32 unk01cc;
	/*0x01d0*/ u32 unk01d0;
	/*0x01d4*/ u32 unk01d4;
	/*0x01d8*/ u32 unk01d8;
	/*0x01dc*/ u32 unk01dc;
	/*0x01e0*/ u32 unk01e0;
	/*0x01e4*/ u32 unk01e4;
	/*0x01e8*/ u32 unk01e8;
	/*0x01ec*/ u32 unk01ec;
	/*0x01f0*/ u32 unk01f0;
	/*0x01f4*/ u32 unk01f4;
	/*0x01f8*/ u32 unk01f8;
	/*0x01fc*/ u32 unk01fc;
	/*0x0200*/ u32 unk0200;
	/*0x0204*/ u32 unk0204;
	/*0x0208*/ u32 unk0208;
	/*0x020c*/ u32 unk020c;
	/*0x0210*/ u32 unk0210;
	/*0x0214*/ u32 unk0214;
	/*0x0218*/ u32 unk0218;
	/*0x021c*/ u32 unk021c;
	/*0x0220*/ u32 unk0220;
	/*0x0224*/ u32 unk0224;
	/*0x0228*/ u32 unk0228;
	/*0x022c*/ u32 unk022c;
	/*0x0230*/ u32 unk0230;
	/*0x0234*/ u32 unk0234;
	/*0x0238*/ u32 unk0238;
	/*0x023c*/ u32 unk023c;
	/*0x0240*/ u32 unk0240;
	/*0x0244*/ u32 unk0244;
	/*0x0248*/ u32 unk0248;
	/*0x024c*/ u32 unk024c;
	/*0x0250*/ u32 unk0250;
	/*0x0254*/ u32 unk0254;
	/*0x0258*/ u32 unk0258;
	/*0x025c*/ u32 unk025c;
	/*0x0260*/ u32 unk0260;
	/*0x0264*/ u32 unk0264;
	/*0x0268*/ u32 unk0268;
	/*0x026c*/ u32 unk026c;
	/*0x0270*/ u32 unk0270;
	/*0x0274*/ u32 unk0274;
	/*0x0278*/ u32 unk0278;
	/*0x027c*/ u32 unk027c;
	/*0x0280*/ u32 unk0280;
	/*0x0284*/ u32 unk0284;
	/*0x0288*/ u32 unk0288;
	/*0x028c*/ u32 unk028c;
	/*0x0290*/ u32 unk0290;
	/*0x0294*/ u32 unk0294;
	/*0x0298*/ u32 unk0298;
	/*0x029c*/ u32 unk029c;
	/*0x02a0*/ u32 unk02a0;
	/*0x02a4*/ u32 unk02a4;
	/*0x02a8*/ u32 unk02a8;
	/*0x02ac*/ u32 unk02ac;
	/*0x02b0*/ u32 unk02b0;
	/*0x02b4*/ u32 unk02b4;
	/*0x02b8*/ u32 unk02b8;
	/*0x02bc*/ u32 unk02bc;
	/*0x02c0*/ u32 unk02c0;
	/*0x02c4*/ u32 unk02c4;
	/*0x02c8*/ u32 unk02c8;
	/*0x02cc*/ u32 unk02cc;
	/*0x02d0*/ u32 unk02d0;
	/*0x02d4*/ u32 unk02d4;
	/*0x02d8*/ u32 unk02d8;
	/*0x02dc*/ u32 unk02dc;
	/*0x02e0*/ u32 unk02e0;
	/*0x02e4*/ u32 unk02e4;
	/*0x02e8*/ u32 unk02e8;
	/*0x02ec*/ u32 unk02ec;
	/*0x02f0*/ u32 unk02f0;
	/*0x02f4*/ u32 unk02f4;
	/*0x02f8*/ u32 unk02f8;
	/*0x02fc*/ u32 unk02fc;
	/*0x0300*/ u32 unk0300;
	/*0x0304*/ u32 unk0304;
	/*0x0308*/ u32 unk0308;
	/*0x030c*/ u32 unk030c;
	/*0x0310*/ u32 unk0310;
	/*0x0314*/ u32 unk0314;
	/*0x0318*/ u32 unk0318;
	/*0x031c*/ u32 unk031c;
	/*0x0320*/ u32 unk0320;
	/*0x0324*/ u32 unk0324;
	/*0x0328*/ u32 unk0328;
	/*0x032c*/ u32 unk032c;
	/*0x0330*/ u32 unk0330;
	/*0x0334*/ u32 unk0334;
	/*0x0338*/ u32 unk0338;
	/*0x033c*/ u32 unk033c;
	/*0x0340*/ u32 unk0340;
	/*0x0344*/ u32 unk0344;
	/*0x0348*/ u32 unk0348;
	/*0x034c*/ u32 unk034c;
	/*0x0350*/ u32 unk0350;
	/*0x0354*/ u32 unk0354;
	/*0x0358*/ u32 unk0358;
	/*0x035c*/ u32 unk035c;
	/*0x0360*/ u32 unk0360;
	/*0x0364*/ u32 unk0364;
	/*0x0368*/ u32 unk0368;
	/*0x036c*/ u32 unk036c;
	/*0x0370*/ u32 unk0370;
	/*0x0374*/ u32 unk0374;
	/*0x0378*/ u32 unk0378;
	/*0x037c*/ u32 unk037c;
	/*0x0380*/ u32 unk0380;
	/*0x0384*/ u32 unk0384;
	/*0x0388*/ u32 unk0388;
	/*0x038c*/ u32 unk038c;
	/*0x0390*/ u32 unk0390;
	/*0x0394*/ u32 unk0394;
	/*0x0398*/ u32 unk0398;
	/*0x039c*/ u32 unk039c;
	/*0x03a0*/ u32 unk03a0;
	/*0x03a4*/ u32 unk03a4;
	/*0x03a8*/ u32 unk03a8;
	/*0x03ac*/ u32 unk03ac;
	/*0x03b0*/ u32 unk03b0;
	/*0x03b4*/ u32 unk03b4;
	/*0x03b8*/ u32 unk03b8;
	/*0x03bc*/ u32 unk03bc;
	/*0x03c0*/ u32 unk03c0;
	/*0x03c4*/ u32 unk03c4;
	/*0x03c8*/ u32 unk03c8;
	/*0x03cc*/ u32 unk03cc;
	/*0x03d0*/ u32 unk03d0;
	/*0x03d4*/ u32 unk03d4;
	/*0x03d8*/ u32 unk03d8;
	/*0x03dc*/ u32 unk03dc;
	/*0x03e0*/ u32 unk03e0;
	/*0x03e4*/ u32 unk03e4;
	/*0x03e8*/ u32 unk03e8;
	/*0x03ec*/ u32 unk03ec;
	/*0x03f0*/ u32 unk03f0;
	/*0x03f4*/ u32 unk03f4;
	/*0x03f8*/ u32 unk03f8;
	/*0x03fc*/ u32 unk03fc;
	/*0x0400*/ u32 unk0400;
	/*0x0404*/ u32 unk0404;
	/*0x0408*/ u32 unk0408;
	/*0x040c*/ u32 unk040c;
	/*0x0410*/ u32 unk0410;
	/*0x0414*/ u32 unk0414;
	/*0x0418*/ u32 unk0418;
	/*0x041c*/ u32 unk041c;
	/*0x0420*/ u32 unk0420;
	/*0x0424*/ u32 unk0424;
	/*0x0428*/ u32 unk0428;
	/*0x042c*/ u32 unk042c;
	/*0x0430*/ u32 unk0430;
	/*0x0434*/ u32 unk0434;
	/*0x0438*/ u32 unk0438;
	/*0x043c*/ u32 unk043c;
	/*0x0440*/ u32 unk0440;
	/*0x0444*/ u32 unk0444;
	/*0x0448*/ u32 unk0448;
	/*0x044c*/ u32 unk044c;
	/*0x0450*/ u32 unk0450;
	/*0x0454*/ u32 unk0454;
	/*0x0458*/ u32 unk0458;
	/*0x045c*/ u32 unk045c;
	/*0x0460*/ u32 unk0460;
	/*0x0464*/ u32 unk0464;
	/*0x0468*/ u32 unk0468;
	/*0x046c*/ u32 unk046c;
	/*0x0470*/ u32 unk0470;
	/*0x0474*/ u32 unk0474;
	/*0x0478*/ u32 unk0478;
	/*0x047c*/ u32 unk047c;
	/*0x0480*/ u32 unk0480;
	/*0x0484*/ u32 unk0484;
	/*0x0488*/ u32 unk0488;
	/*0x048c*/ u32 unk048c;
	/*0x0490*/ u32 unk0490;
	/*0x0494*/ u32 unk0494;
	/*0x0498*/ u32 unk0498;
	/*0x049c*/ u32 unk049c;
	/*0x04a0*/ u32 unk04a0;
	/*0x04a4*/ u32 unk04a4;
	/*0x04a8*/ u32 unk04a8;
	/*0x04ac*/ u32 unk04ac;
	/*0x04b0*/ u32 unk04b0;
	/*0x04b4*/ u32 unk04b4;
	/*0x04b8*/ u32 unk04b8;
	/*0x04bc*/ u32 unk04bc;
	/*0x04c0*/ u32 unk04c0;
	/*0x04c4*/ u32 unk04c4;
	/*0x04c8*/ u32 unk04c8;
	/*0x04cc*/ u32 unk04cc;
	/*0x04d0*/ u32 unk04d0;
	/*0x04d4*/ u32 unk04d4;
	/*0x04d8*/ u32 unk04d8;
	/*0x04dc*/ u32 unk04dc;
	/*0x04e0*/ u32 unk04e0;
	/*0x04e4*/ u32 unk04e4;
	/*0x04e8*/ u32 unk04e8;
	/*0x04ec*/ u32 unk04ec;
	/*0x04f0*/ u32 unk04f0;
	/*0x04f4*/ u32 unk04f4;
	/*0x04f8*/ u32 unk04f8;
	/*0x04fc*/ u32 unk04fc;
	/*0x0500*/ u32 unk0500;
	/*0x0504*/ u32 unk0504;
	/*0x0508*/ u32 unk0508;
	/*0x050c*/ u32 unk050c;
	/*0x0510*/ u32 unk0510;
	/*0x0514*/ u32 unk0514;
	/*0x0518*/ u32 unk0518;
	/*0x051c*/ u32 unk051c;
	/*0x0520*/ u32 unk0520;
	/*0x0524*/ u32 unk0524;
	/*0x0528*/ u32 unk0528;
	/*0x052c*/ u32 unk052c;
	/*0x0530*/ u32 unk0530;
	/*0x0534*/ u32 unk0534;
	/*0x0538*/ u32 unk0538;
	/*0x053c*/ u32 unk053c;
	/*0x0540*/ u32 unk0540;
	/*0x0544*/ u32 unk0544;
	/*0x0548*/ u32 unk0548;
	/*0x054c*/ u32 unk054c;
	/*0x0550*/ u32 unk0550;
	/*0x0554*/ u32 unk0554;
	/*0x0558*/ u32 unk0558;
	/*0x055c*/ u32 unk055c;
	/*0x0560*/ u32 unk0560;
	/*0x0564*/ u32 unk0564;
	/*0x0568*/ u32 unk0568;
	/*0x056c*/ u32 unk056c;
	/*0x0570*/ u32 unk0570;
	/*0x0574*/ u32 unk0574;
	/*0x0578*/ u32 unk0578;
	/*0x057c*/ u32 unk057c;
	/*0x0580*/ u32 unk0580;
	/*0x0584*/ u32 unk0584;
	/*0x0588*/ u32 unk0588;
	/*0x058c*/ u32 unk058c;
	/*0x0590*/ u32 unk0590;
	/*0x0594*/ u32 unk0594;
	/*0x0598*/ u32 unk0598;
	/*0x059c*/ u32 unk059c;
	/*0x05a0*/ u32 unk05a0;
	/*0x05a4*/ u32 unk05a4;
	/*0x05a8*/ u32 unk05a8;
	/*0x05ac*/ u32 unk05ac;
	/*0x05b0*/ u32 unk05b0;
	/*0x05b4*/ u32 unk05b4;
	/*0x05b8*/ u32 unk05b8;
	/*0x05bc*/ u32 unk05bc;
	/*0x05c0*/ u32 unk05c0;
	/*0x05c4*/ u32 unk05c4;
	/*0x05c8*/ u32 unk05c8;
	/*0x05cc*/ u32 unk05cc;
	/*0x05d0*/ u32 unk05d0;
	/*0x05d4*/ u32 unk05d4;
	/*0x05d8*/ u32 unk05d8;
	/*0x05dc*/ u32 unk05dc;
	/*0x05e0*/ u32 unk05e0;
	/*0x05e4*/ u32 unk05e4;
	/*0x05e8*/ u32 unk05e8;
	/*0x05ec*/ u32 unk05ec;
	/*0x05f0*/ u32 unk05f0;
	/*0x05f4*/ u32 unk05f4;
	/*0x05f8*/ u32 unk05f8;
	/*0x05fc*/ u32 unk05fc;
	/*0x0600*/ u32 unk0600;
	/*0x0604*/ u32 unk0604;
	/*0x0608*/ u32 unk0608;
	/*0x060c*/ u32 unk060c;
	/*0x0610*/ u32 unk0610;
	/*0x0614*/ u32 unk0614;
	/*0x0618*/ u32 unk0618;
	/*0x061c*/ u32 unk061c;
	/*0x0620*/ u32 unk0620;
	/*0x0624*/ u32 unk0624;
	/*0x0628*/ u32 unk0628;
	/*0x062c*/ u32 unk062c;
	/*0x0630*/ u32 unk0630;
	/*0x0634*/ u32 unk0634;
	/*0x0638*/ u32 unk0638;
	/*0x063c*/ u32 unk063c;
	/*0x0640*/ u32 unk0640;
	/*0x0644*/ u32 unk0644;
	/*0x0648*/ u32 unk0648;
	/*0x064c*/ u32 unk064c;
	/*0x0650*/ u32 unk0650;
	/*0x0654*/ u32 unk0654;
	/*0x0658*/ u32 unk0658;
	/*0x065c*/ u32 unk065c;
	/*0x0660*/ u32 unk0660;
	/*0x0664*/ u32 unk0664;
	/*0x0668*/ u32 unk0668;
	/*0x066c*/ u32 unk066c;
	/*0x0670*/ u32 unk0670;
	/*0x0674*/ u32 unk0674;
	/*0x0678*/ u32 unk0678;
	/*0x067c*/ u32 unk067c;
	/*0x0680*/ u32 unk0680;
	/*0x0684*/ u32 unk0684;
	/*0x0688*/ u32 unk0688;
	/*0x068c*/ u32 unk068c;
	/*0x0690*/ u32 unk0690;
	/*0x0694*/ u32 unk0694;
	/*0x0698*/ u32 unk0698;
	/*0x069c*/ u32 unk069c;
	/*0x06a0*/ u32 unk06a0;
	/*0x06a4*/ u32 unk06a4;
	/*0x06a8*/ u32 unk06a8;
	/*0x06ac*/ u32 unk06ac;
	/*0x06b0*/ u32 unk06b0;
	/*0x06b4*/ u32 unk06b4;
	/*0x06b8*/ u32 unk06b8;
	/*0x06bc*/ u32 unk06bc;
	/*0x06c0*/ u32 unk06c0;
	/*0x06c4*/ u32 unk06c4;
	/*0x06c8*/ u32 unk06c8;
	/*0x06cc*/ u32 unk06cc;
	/*0x06d0*/ u32 unk06d0;
	/*0x06d4*/ u32 unk06d4;
	/*0x06d8*/ u32 unk06d8;
	/*0x06dc*/ u32 unk06dc;
	/*0x06e0*/ u32 unk06e0;
	/*0x06e4*/ u32 unk06e4;
	/*0x06e8*/ u32 unk06e8;
	/*0x06ec*/ u32 unk06ec;
	/*0x06f0*/ u32 unk06f0;
	/*0x06f4*/ u32 unk06f4;
	/*0x06f8*/ u32 unk06f8;
	/*0x06fc*/ u32 unk06fc;
	/*0x0700*/ u32 unk0700;
	/*0x0704*/ u32 unk0704;
	/*0x0708*/ u32 unk0708;
	/*0x070c*/ u32 unk070c;
	/*0x0710*/ u32 unk0710;
	/*0x0714*/ u32 unk0714;
	/*0x0718*/ u32 unk0718;
	/*0x071c*/ u32 unk071c;
	/*0x0720*/ u32 unk0720;
	/*0x0724*/ u32 unk0724;
	/*0x0728*/ u32 unk0728;
	/*0x072c*/ u32 unk072c;
	/*0x0730*/ u32 unk0730;
	/*0x0734*/ u32 unk0734;
	/*0x0738*/ u32 unk0738;
	/*0x073c*/ u32 unk073c;
	/*0x0740*/ u32 unk0740;
	/*0x0744*/ u32 unk0744;
	/*0x0748*/ u32 unk0748;
	/*0x074c*/ u32 unk074c;
	/*0x0750*/ u32 unk0750;
	/*0x0754*/ u32 unk0754;
	/*0x0758*/ u32 unk0758;
	/*0x075c*/ u32 unk075c;
	/*0x0760*/ u32 unk0760;
	/*0x0764*/ u32 unk0764;
	/*0x0768*/ u32 unk0768;
	/*0x076c*/ u32 unk076c;
	/*0x0770*/ u32 unk0770;
	/*0x0774*/ u32 unk0774;
	/*0x0778*/ u32 unk0778;
	/*0x077c*/ u32 unk077c;
	/*0x0780*/ u32 unk0780;
	/*0x0784*/ u32 unk0784;
	/*0x0788*/ u32 unk0788;
	/*0x078c*/ u32 unk078c;
	/*0x0790*/ u32 unk0790;
	/*0x0794*/ u32 unk0794;
	/*0x0798*/ u32 unk0798;
	/*0x079c*/ u32 unk079c;
	/*0x07a0*/ u32 unk07a0;
	/*0x07a4*/ u32 unk07a4;
	/*0x07a8*/ u32 unk07a8;
	/*0x07ac*/ u32 unk07ac;
	/*0x07b0*/ u32 unk07b0;
	/*0x07b4*/ u32 unk07b4;
	/*0x07b8*/ u32 unk07b8;
	/*0x07bc*/ u32 unk07bc;
	/*0x07c0*/ u32 unk07c0;
	/*0x07c4*/ u32 unk07c4;
	/*0x07c8*/ u32 unk07c8;
	/*0x07cc*/ u32 unk07cc;
	/*0x07d0*/ u32 unk07d0;
	/*0x07d4*/ u32 unk07d4;
	/*0x07d8*/ u32 unk07d8;
	/*0x07dc*/ u32 unk07dc;
	/*0x07e0*/ u32 unk07e0;
	/*0x07e4*/ u32 unk07e4;
	/*0x07e8*/ u32 unk07e8;
	/*0x07ec*/ u32 unk07ec;
	/*0x07f0*/ u32 unk07f0;
	/*0x07f4*/ u32 unk07f4;
	/*0x07f8*/ u32 unk07f8;
	/*0x07fc*/ u32 unk07fc;
	/*0x0800*/ u32 unk0800;
	/*0x0804*/ u32 unk0804;
	/*0x0808*/ u32 unk0808;
	/*0x080c*/ u32 unk080c;
	/*0x0810*/ u32 unk0810;
	/*0x0814*/ u32 unk0814;
	/*0x0818*/ u32 unk0818;
	/*0x081c*/ u32 unk081c;
	/*0x0820*/ u32 unk0820;
	/*0x0824*/ u32 unk0824;
	/*0x0828*/ u32 unk0828;
	/*0x082c*/ u32 unk082c;
	/*0x0830*/ u32 unk0830;
	/*0x0834*/ u32 unk0834;
	/*0x0838*/ u32 unk0838;
	/*0x083c*/ u32 unk083c;
	/*0x0840*/ u32 unk0840;
	/*0x0844*/ u32 unk0844;
	/*0x0848*/ u32 unk0848;
	/*0x084c*/ u32 unk084c;
	/*0x0850*/ u32 unk0850;
	/*0x0854*/ u32 unk0854;
	/*0x0858*/ u32 unk0858;
	/*0x085c*/ u32 unk085c;
	/*0x0860*/ u32 unk0860;
	/*0x0864*/ u32 unk0864;
	/*0x0868*/ u32 unk0868;
	/*0x086c*/ u32 unk086c;
	/*0x0870*/ u32 unk0870;
	/*0x0874*/ u32 unk0874;
	/*0x0878*/ u32 unk0878;
	/*0x087c*/ u32 unk087c;
	/*0x0880*/ u32 unk0880;
	/*0x0884*/ u32 unk0884;
	/*0x0888*/ u32 unk0888;
	/*0x088c*/ u32 unk088c;
	/*0x0890*/ u32 unk0890;
	/*0x0894*/ u32 unk0894;
	/*0x0898*/ u32 unk0898;
	/*0x089c*/ u32 unk089c;
	/*0x08a0*/ u32 unk08a0;
	/*0x08a4*/ u32 unk08a4;
	/*0x08a8*/ u32 unk08a8;
	/*0x08ac*/ u32 unk08ac;
	/*0x08b0*/ u32 unk08b0;
	/*0x08b4*/ u32 unk08b4;
	/*0x08b8*/ u32 unk08b8;
	/*0x08bc*/ u32 unk08bc;
	/*0x08c0*/ u32 unk08c0;
	/*0x08c4*/ u32 unk08c4;
	/*0x08c8*/ u32 unk08c8;
	/*0x08cc*/ u32 unk08cc;
	/*0x08d0*/ u32 unk08d0;
	/*0x08d4*/ u32 unk08d4;
	/*0x08d8*/ u32 unk08d8;
	/*0x08dc*/ u32 unk08dc;
	/*0x08e0*/ u32 unk08e0;
	/*0x08e4*/ u32 unk08e4;
	/*0x08e8*/ u32 unk08e8;
	/*0x08ec*/ u32 unk08ec;
	/*0x08f0*/ u32 unk08f0;
	/*0x08f4*/ u32 unk08f4;
	/*0x08f8*/ u32 unk08f8;
	/*0x08fc*/ u32 unk08fc;
	/*0x0900*/ u32 unk0900;
	/*0x0904*/ u32 unk0904;
	/*0x0908*/ u32 unk0908;
	/*0x090c*/ u32 unk090c;
	/*0x0910*/ u32 unk0910;
	/*0x0914*/ u32 unk0914;
	/*0x0918*/ u32 unk0918;
	/*0x091c*/ u32 unk091c;
	/*0x0920*/ u32 unk0920;
	/*0x0924*/ u32 unk0924;
	/*0x0928*/ u32 unk0928;
	/*0x092c*/ u32 unk092c;
	/*0x0930*/ u32 unk0930;
	/*0x0934*/ u32 unk0934;
	/*0x0938*/ u32 unk0938;
	/*0x093c*/ u32 unk093c;
	/*0x0940*/ u32 unk0940;
	/*0x0944*/ u32 unk0944;
	/*0x0948*/ u32 unk0948;
	/*0x094c*/ u32 unk094c;
	/*0x0950*/ u32 unk0950;
	/*0x0954*/ u32 unk0954;
	/*0x0958*/ u32 unk0958;
	/*0x095c*/ u32 unk095c;
	/*0x0960*/ u32 unk0960;
	/*0x0964*/ u32 unk0964;
	/*0x0968*/ u32 unk0968;
	/*0x096c*/ u32 unk096c;
	/*0x0970*/ u32 unk0970;
	/*0x0974*/ u32 unk0974;
	/*0x0978*/ u32 unk0978;
	/*0x097c*/ u32 unk097c;
	/*0x0980*/ u32 unk0980;
	/*0x0984*/ u32 unk0984;
	/*0x0988*/ u32 unk0988;
	/*0x098c*/ u32 unk098c;
	/*0x0990*/ u32 unk0990;
	/*0x0994*/ u32 unk0994;
	/*0x0998*/ u32 unk0998;
	/*0x099c*/ u32 unk099c;
	/*0x09a0*/ u32 unk09a0;
	/*0x09a4*/ u32 unk09a4;
	/*0x09a8*/ u32 unk09a8;
	/*0x09ac*/ u32 unk09ac;
	/*0x09b0*/ u32 unk09b0;
	/*0x09b4*/ u32 unk09b4;
	/*0x09b8*/ u32 unk09b8;
	/*0x09bc*/ u32 unk09bc;
	/*0x09c0*/ u32 unk09c0;
	/*0x09c4*/ u32 unk09c4;
	/*0x09c8*/ u32 unk09c8;
	/*0x09cc*/ u32 unk09cc;
	/*0x09d0*/ u32 unk09d0;
	/*0x09d4*/ u32 unk09d4;
	/*0x09d8*/ u32 unk09d8;
	/*0x09dc*/ u32 unk09dc;
	/*0x09e0*/ u32 unk09e0;
	/*0x09e4*/ u32 unk09e4;
	/*0x09e8*/ u32 unk09e8;
	/*0x09ec*/ u32 unk09ec;
	/*0x09f0*/ u32 unk09f0;
	/*0x09f4*/ u32 unk09f4;
	/*0x09f8*/ u32 unk09f8;
	/*0x09fc*/ u32 unk09fc;
	/*0x0a00*/ u32 unk0a00;
	/*0x0a04*/ u32 unk0a04;
	/*0x0a08*/ u32 unk0a08;
	/*0x0a0c*/ u32 unk0a0c;
	/*0x0a10*/ u32 unk0a10;
	/*0x0a14*/ u32 unk0a14;
	/*0x0a18*/ u32 unk0a18;
	/*0x0a1c*/ u32 unk0a1c;
	/*0x0a20*/ u32 unk0a20;
	/*0x0a24*/ u32 unk0a24;
	/*0x0a28*/ u32 unk0a28;
	/*0x0a2c*/ u32 unk0a2c;
	/*0x0a30*/ u32 unk0a30;
	/*0x0a34*/ u32 unk0a34;
	/*0x0a38*/ u32 unk0a38;
	/*0x0a3c*/ u32 unk0a3c;
	/*0x0a40*/ u32 unk0a40;
	/*0x0a44*/ u32 unk0a44;
	/*0x0a48*/ u32 unk0a48;
	/*0x0a4c*/ u32 unk0a4c;
	/*0x0a50*/ u32 unk0a50;
	/*0x0a54*/ u32 unk0a54;
	/*0x0a58*/ u32 unk0a58;
	/*0x0a5c*/ u32 unk0a5c;
	/*0x0a60*/ u32 unk0a60;
	/*0x0a64*/ u32 unk0a64;
	/*0x0a68*/ u32 unk0a68;
	/*0x0a6c*/ u32 unk0a6c;
	/*0x0a70*/ u32 unk0a70;
	/*0x0a74*/ u32 unk0a74;
	/*0x0a78*/ u32 unk0a78;
	/*0x0a7c*/ u32 unk0a7c;
	/*0x0a80*/ u32 unk0a80;
	/*0x0a84*/ u32 unk0a84;
	/*0x0a88*/ u32 unk0a88;
	/*0x0a8c*/ u32 unk0a8c;
	/*0x0a90*/ u32 unk0a90;
	/*0x0a94*/ u32 unk0a94;
	/*0x0a98*/ u32 unk0a98;
	/*0x0a9c*/ u32 unk0a9c;
	/*0x0aa0*/ u32 unk0aa0;
	/*0x0aa4*/ u32 unk0aa4;
	/*0x0aa8*/ u32 unk0aa8;
	/*0x0aac*/ u32 unk0aac;
	/*0x0ab0*/ u32 unk0ab0;
	/*0x0ab4*/ u32 unk0ab4;
	/*0x0ab8*/ u32 unk0ab8;
	/*0x0abc*/ u32 unk0abc;
	/*0x0ac0*/ u32 unk0ac0;
	/*0x0ac4*/ u32 unk0ac4;
	/*0x0ac8*/ u32 unk0ac8;
	/*0x0acc*/ u32 unk0acc;
	/*0x0ad0*/ u32 unk0ad0;
	/*0x0ad4*/ u32 unk0ad4;
	/*0x0ad8*/ u32 unk0ad8;
	/*0x0adc*/ u32 unk0adc;
	/*0x0ae0*/ u32 unk0ae0;
	/*0x0ae4*/ u32 unk0ae4;
	/*0x0ae8*/ u32 unk0ae8;
	/*0x0aec*/ u32 unk0aec;
	/*0x0af0*/ u32 unk0af0;
	/*0x0af4*/ u32 unk0af4;
	/*0x0af8*/ u32 unk0af8;
	/*0x0afc*/ u32 unk0afc;
	/*0x0b00*/ u32 unk0b00;
	/*0x0b04*/ u32 unk0b04;
	/*0x0b08*/ u32 unk0b08;
	/*0x0b0c*/ u32 unk0b0c;
	/*0x0b10*/ u32 unk0b10;
	/*0x0b14*/ u32 unk0b14;
	/*0x0b18*/ u32 unk0b18;
	/*0x0b1c*/ u32 unk0b1c;
	/*0x0b20*/ u32 unk0b20;
	/*0x0b24*/ u32 unk0b24;
	/*0x0b28*/ u32 unk0b28;
	/*0x0b2c*/ u32 unk0b2c;
	/*0x0b30*/ u32 unk0b30;
	/*0x0b34*/ u32 unk0b34;
	/*0x0b38*/ u32 unk0b38;
	/*0x0b3c*/ u32 unk0b3c;
	/*0x0b40*/ u32 unk0b40;
	/*0x0b44*/ u32 unk0b44;
	/*0x0b48*/ u32 unk0b48;
	/*0x0b4c*/ u32 unk0b4c;
	/*0x0b50*/ u32 unk0b50;
	/*0x0b54*/ u32 unk0b54;
	/*0x0b58*/ u32 unk0b58;
	/*0x0b5c*/ u32 unk0b5c;
	/*0x0b60*/ u32 unk0b60;
	/*0x0b64*/ u32 unk0b64;
	/*0x0b68*/ u32 unk0b68;
	/*0x0b6c*/ u32 unk0b6c;
	/*0x0b70*/ u32 unk0b70;
	/*0x0b74*/ u32 unk0b74;
	/*0x0b78*/ u32 unk0b78;
	/*0x0b7c*/ u32 unk0b7c;
	/*0x0b80*/ u32 unk0b80;
	/*0x0b84*/ u32 unk0b84;
	/*0x0b88*/ u32 unk0b88;
	/*0x0b8c*/ u32 unk0b8c;
	/*0x0b90*/ u32 unk0b90;
	/*0x0b94*/ u32 unk0b94;
	/*0x0b98*/ u32 unk0b98;
	/*0x0b9c*/ u32 unk0b9c;
	/*0x0ba0*/ u32 unk0ba0;
	/*0x0ba4*/ u32 unk0ba4;
	/*0x0ba8*/ u32 unk0ba8;
	/*0x0bac*/ u32 unk0bac;
	/*0x0bb0*/ u32 unk0bb0;
	/*0x0bb4*/ u32 unk0bb4;
	/*0x0bb8*/ u32 unk0bb8;
	/*0x0bbc*/ u32 unk0bbc;
	/*0x0bc0*/ u32 unk0bc0;
	/*0x0bc4*/ u32 unk0bc4;
	/*0x0bc8*/ u32 unk0bc8;
	/*0x0bcc*/ u32 unk0bcc;
	/*0x0bd0*/ u32 unk0bd0;
	/*0x0bd4*/ u32 unk0bd4;
	/*0x0bd8*/ u32 unk0bd8;
	/*0x0bdc*/ u32 unk0bdc;
	/*0x0be0*/ u32 unk0be0;
	/*0x0be4*/ u32 unk0be4;
	/*0x0be8*/ u32 unk0be8;
	/*0x0bec*/ u32 unk0bec;
	/*0x0bf0*/ u32 unk0bf0;
	/*0x0bf4*/ u32 unk0bf4;
	/*0x0bf8*/ u32 unk0bf8;
	/*0x0bfc*/ u32 unk0bfc;
	/*0x0c00*/ u32 unk0c00;
	/*0x0c04*/ u32 unk0c04;
	/*0x0c08*/ u32 unk0c08;
	/*0x0c0c*/ u32 unk0c0c;
	/*0x0c10*/ u32 unk0c10;
	/*0x0c14*/ u32 unk0c14;
	/*0x0c18*/ u32 unk0c18;
	/*0x0c1c*/ u32 unk0c1c;
	/*0x0c20*/ u32 unk0c20;
	/*0x0c24*/ u32 unk0c24;
	/*0x0c28*/ u32 unk0c28;
	/*0x0c2c*/ u32 unk0c2c;
	/*0x0c30*/ u32 unk0c30;
	/*0x0c34*/ u32 unk0c34;
	/*0x0c38*/ u32 unk0c38;
	/*0x0c3c*/ u32 unk0c3c;
	/*0x0c40*/ u32 unk0c40;
	/*0x0c44*/ u32 unk0c44;
	/*0x0c48*/ u32 unk0c48;
	/*0x0c4c*/ u32 unk0c4c;
	/*0x0c50*/ u32 unk0c50;
	/*0x0c54*/ u32 unk0c54;
	/*0x0c58*/ u32 unk0c58;
	/*0x0c5c*/ u32 unk0c5c;
	/*0x0c60*/ u32 unk0c60;
	/*0x0c64*/ u32 unk0c64;
	/*0x0c68*/ u32 unk0c68;
	/*0x0c6c*/ u32 unk0c6c;
	/*0x0c70*/ u32 unk0c70;
	/*0x0c74*/ u32 unk0c74;
	/*0x0c78*/ u32 unk0c78;
	/*0x0c7c*/ u32 unk0c7c;
	/*0x0c80*/ u32 unk0c80;
	/*0x0c84*/ u32 unk0c84;
	/*0x0c88*/ u32 unk0c88;
	/*0x0c8c*/ u32 unk0c8c;
	/*0x0c90*/ u32 unk0c90;
	/*0x0c94*/ u32 unk0c94;
	/*0x0c98*/ u32 unk0c98;
	/*0x0c9c*/ u32 unk0c9c;
	/*0x0ca0*/ u32 unk0ca0;
	/*0x0ca4*/ u32 unk0ca4;
	/*0x0ca8*/ u32 unk0ca8;
	/*0x0cac*/ u32 unk0cac;
	/*0x0cb0*/ u32 unk0cb0;
	/*0x0cb4*/ u32 unk0cb4;
	/*0x0cb8*/ u32 unk0cb8;
	/*0x0cbc*/ u32 unk0cbc;
	/*0x0cc0*/ u32 unk0cc0;
	/*0x0cc4*/ u32 unk0cc4;
	/*0x0cc8*/ u32 unk0cc8;
	/*0x0ccc*/ u32 unk0ccc;
	/*0x0cd0*/ u32 unk0cd0;
	/*0x0cd4*/ u32 unk0cd4;
	/*0x0cd8*/ u32 unk0cd8;
	/*0x0cdc*/ u32 unk0cdc;
	/*0x0ce0*/ u32 unk0ce0;
	/*0x0ce4*/ u32 unk0ce4;
	/*0x0ce8*/ u32 unk0ce8;
	/*0x0cec*/ u32 unk0cec;
	/*0x0cf0*/ u32 unk0cf0;
	/*0x0cf4*/ u32 unk0cf4;
	/*0x0cf8*/ u32 unk0cf8;
	/*0x0cfc*/ u32 unk0cfc;
	/*0x0d00*/ u32 unk0d00;
	/*0x0d04*/ u32 unk0d04;
	/*0x0d08*/ u32 unk0d08;
	/*0x0d0c*/ u32 unk0d0c;
	/*0x0d10*/ u32 unk0d10;
	/*0x0d14*/ u32 unk0d14;
	/*0x0d18*/ u32 unk0d18;
	/*0x0d1c*/ u32 unk0d1c;
	/*0x0d20*/ u32 unk0d20;
	/*0x0d24*/ u32 unk0d24;
	/*0x0d28*/ u32 unk0d28;
	/*0x0d2c*/ u32 unk0d2c;
	/*0x0d30*/ u32 unk0d30;
	/*0x0d34*/ u32 unk0d34;
	/*0x0d38*/ u32 unk0d38;
	/*0x0d3c*/ u32 unk0d3c;
	/*0x0d40*/ u32 unk0d40;
	/*0x0d44*/ u32 unk0d44;
	/*0x0d48*/ u32 unk0d48;
	/*0x0d4c*/ u32 unk0d4c;
	/*0x0d50*/ u32 unk0d50;
	/*0x0d54*/ u32 unk0d54;
	/*0x0d58*/ u32 unk0d58;
	/*0x0d5c*/ u32 unk0d5c;
	/*0x0d60*/ u32 unk0d60;
	/*0x0d64*/ u32 unk0d64;
	/*0x0d68*/ u32 unk0d68;
	/*0x0d6c*/ u32 unk0d6c;
	/*0x0d70*/ u32 unk0d70;
	/*0x0d74*/ u32 unk0d74;
	/*0x0d78*/ u32 unk0d78;
	/*0x0d7c*/ u32 unk0d7c;
	/*0x0d80*/ u32 unk0d80;
	/*0x0d84*/ u32 unk0d84;
	/*0x0d88*/ u32 unk0d88;
	/*0x0d8c*/ u32 unk0d8c;
	/*0x0d90*/ u32 unk0d90;
	/*0x0d94*/ u32 unk0d94;
	/*0x0d98*/ u32 unk0d98;
	/*0x0d9c*/ u32 unk0d9c;
	/*0x0da0*/ u32 unk0da0;
	/*0x0da4*/ u32 unk0da4;
	/*0x0da8*/ u32 unk0da8;
	/*0x0dac*/ u32 unk0dac;
	/*0x0db0*/ u32 unk0db0;
	/*0x0db4*/ u32 unk0db4;
	/*0x0db8*/ u32 unk0db8;
	/*0x0dbc*/ u32 unk0dbc;
	/*0x0dc0*/ u32 unk0dc0;
	/*0x0dc4*/ u32 unk0dc4;
	/*0x0dc8*/ u32 unk0dc8;
	/*0x0dcc*/ u32 unk0dcc;
	/*0x0dd0*/ u32 unk0dd0;
	/*0x0dd4*/ u32 unk0dd4;
	/*0x0dd8*/ u32 unk0dd8;
	/*0x0ddc*/ u32 unk0ddc;
	/*0x0de0*/ u32 unk0de0;
	/*0x0de4*/ u32 unk0de4;
	/*0x0de8*/ u32 unk0de8;
	/*0x0dec*/ u32 unk0dec;
	/*0x0df0*/ u32 unk0df0;
	/*0x0df4*/ u32 unk0df4;
	/*0x0df8*/ u32 unk0df8;
	/*0x0dfc*/ u32 unk0dfc;
	/*0x0e00*/ u32 unk0e00;
	/*0x0e04*/ u32 unk0e04;
	/*0x0e08*/ u32 unk0e08;
	/*0x0e0c*/ u32 unk0e0c;
	/*0x0e10*/ u32 unk0e10;
	/*0x0e14*/ u32 unk0e14;
	/*0x0e18*/ u32 unk0e18;
	/*0x0e1c*/ u32 unk0e1c;
	/*0x0e20*/ u32 unk0e20;
	/*0x0e24*/ u32 unk0e24;
	/*0x0e28*/ u32 unk0e28;
	/*0x0e2c*/ u32 unk0e2c;
	/*0x0e30*/ u32 unk0e30;
	/*0x0e34*/ u32 unk0e34;
	/*0x0e38*/ u32 unk0e38;
	/*0x0e3c*/ u32 unk0e3c;
	/*0x0e40*/ u32 unk0e40;
	/*0x0e44*/ u32 unk0e44;
	/*0x0e48*/ u32 unk0e48;
	/*0x0e4c*/ u32 unk0e4c;
	/*0x0e50*/ u32 unk0e50;
	/*0x0e54*/ u32 unk0e54;
	/*0x0e58*/ u32 unk0e58;
	/*0x0e5c*/ u32 unk0e5c;
	/*0x0e60*/ u32 unk0e60;
	/*0x0e64*/ u32 unk0e64;
	/*0x0e68*/ u32 unk0e68;
	/*0x0e6c*/ u32 unk0e6c;
	/*0x0e70*/ u32 unk0e70;
	/*0x0e74*/ u32 unk0e74;
	/*0x0e78*/ u32 unk0e78;
	/*0x0e7c*/ u32 unk0e7c;
	/*0x0e80*/ u32 unk0e80;
	/*0x0e84*/ u32 unk0e84;
	/*0x0e88*/ u32 unk0e88;
	/*0x0e8c*/ u32 unk0e8c;
	/*0x0e90*/ u32 unk0e90;
	/*0x0e94*/ u32 unk0e94;
	/*0x0e98*/ u32 unk0e98;
	/*0x0e9c*/ u32 unk0e9c;
	/*0x0ea0*/ u32 unk0ea0;
	/*0x0ea4*/ u32 unk0ea4;
	/*0x0ea8*/ u32 unk0ea8;
	/*0x0eac*/ u32 unk0eac;
	/*0x0eb0*/ u32 unk0eb0;
	/*0x0eb4*/ u32 unk0eb4;
	/*0x0eb8*/ u32 unk0eb8;
	/*0x0ebc*/ u32 unk0ebc;
	/*0x0ec0*/ u32 unk0ec0;
	/*0x0ec4*/ u32 unk0ec4;
	/*0x0ec8*/ u32 unk0ec8;
	/*0x0ecc*/ u32 unk0ecc;
	/*0x0ed0*/ u32 unk0ed0;
	/*0x0ed4*/ u32 unk0ed4;
	/*0x0ed8*/ u32 unk0ed8;
	/*0x0edc*/ u32 unk0edc;
	/*0x0ee0*/ u32 unk0ee0;
	/*0x0ee4*/ u32 unk0ee4;
	/*0x0ee8*/ u32 unk0ee8;
	/*0x0eec*/ u32 unk0eec;
	/*0x0ef0*/ u32 unk0ef0;
	/*0x0ef4*/ u32 unk0ef4;
	/*0x0ef8*/ u32 unk0ef8;
	/*0x0efc*/ u32 unk0efc;
	/*0x0f00*/ u32 unk0f00;
	/*0x0f04*/ u32 unk0f04;
	/*0x0f08*/ u32 unk0f08;
	/*0x0f0c*/ u32 unk0f0c;
	/*0x0f10*/ u32 unk0f10;
	/*0x0f14*/ u32 unk0f14;
	/*0x0f18*/ u32 unk0f18;
	/*0x0f1c*/ u32 unk0f1c;
	/*0x0f20*/ u32 unk0f20;
	/*0x0f24*/ u32 unk0f24;
	/*0x0f28*/ u32 unk0f28;
	/*0x0f2c*/ u32 unk0f2c;
	/*0x0f30*/ u32 unk0f30;
	/*0x0f34*/ u32 unk0f34;
	/*0x0f38*/ u32 unk0f38;
	/*0x0f3c*/ u32 unk0f3c;
	/*0x0f40*/ u32 unk0f40;
	/*0x0f44*/ u32 unk0f44;
	/*0x0f48*/ u32 unk0f48;
	/*0x0f4c*/ u32 unk0f4c;
	/*0x0f50*/ u32 unk0f50;
	/*0x0f54*/ u32 unk0f54;
	/*0x0f58*/ u32 unk0f58;
	/*0x0f5c*/ u32 unk0f5c;
	/*0x0f60*/ u32 unk0f60;
	/*0x0f64*/ u32 unk0f64;
	/*0x0f68*/ u32 unk0f68;
	/*0x0f6c*/ u32 unk0f6c;
	/*0x0f70*/ u32 unk0f70;
	/*0x0f74*/ u32 unk0f74;
	/*0x0f78*/ u32 unk0f78;
	/*0x0f7c*/ u32 unk0f7c;
	/*0x0f80*/ u32 unk0f80;
	/*0x0f84*/ u32 unk0f84;
	/*0x0f88*/ u32 unk0f88;
	/*0x0f8c*/ u32 unk0f8c;
	/*0x0f90*/ u32 unk0f90;
	/*0x0f94*/ u32 unk0f94;
	/*0x0f98*/ u32 unk0f98;
	/*0x0f9c*/ u32 unk0f9c;
	/*0x0fa0*/ u32 unk0fa0;
	/*0x0fa4*/ u32 unk0fa4;
	/*0x0fa8*/ u32 unk0fa8;
	/*0x0fac*/ u32 unk0fac;
	/*0x0fb0*/ u32 unk0fb0;
	/*0x0fb4*/ u32 unk0fb4;
	/*0x0fb8*/ u32 unk0fb8;
	/*0x0fbc*/ u32 unk0fbc;
	/*0x0fc0*/ u32 unk0fc0;
	/*0x0fc4*/ u32 unk0fc4;
	/*0x0fc8*/ u32 unk0fc8;
	/*0x0fcc*/ u32 unk0fcc;
	/*0x0fd0*/ u32 unk0fd0;
	/*0x0fd4*/ u32 unk0fd4;
	/*0x0fd8*/ u32 unk0fd8;
	/*0x0fdc*/ u32 unk0fdc;
	/*0x0fe0*/ u32 unk0fe0;
	/*0x0fe4*/ u32 unk0fe4;
	/*0x0fe8*/ u32 unk0fe8;
	/*0x0fec*/ u32 unk0fec;
	/*0x0ff0*/ u32 unk0ff0;
	/*0x0ff4*/ u32 unk0ff4;
	/*0x0ff8*/ u32 unk0ff8;
	/*0x0ffc*/ u32 unk0ffc;
	/*0x1000*/ u32 unk1000;
	/*0x1004*/ u32 unk1004;
	/*0x1008*/ u32 unk1008;
	/*0x100c*/ u32 unk100c;
	/*0x1010*/ u32 unk1010;
	/*0x1014*/ u32 unk1014;
	/*0x1018*/ u32 unk1018;
	/*0x101c*/ u32 unk101c;
	/*0x1020*/ u32 unk1020;
	/*0x1024*/ u32 unk1024;
	/*0x1028*/ u32 unk1028;
	/*0x102c*/ u32 unk102c;
	/*0x1030*/ u32 unk1030;
	/*0x1034*/ u32 unk1034;
	/*0x1038*/ u32 unk1038;
	/*0x103c*/ u32 unk103c;
	/*0x1040*/ u32 unk1040;
	/*0x1044*/ u32 unk1044;
	/*0x1048*/ u32 unk1048;
	/*0x104c*/ u32 unk104c;
	/*0x1050*/ u32 unk1050;
	/*0x1054*/ u32 unk1054;
	/*0x1058*/ u32 unk1058;
	/*0x105c*/ u32 unk105c;
	/*0x1060*/ u32 unk1060;
	/*0x1064*/ u32 unk1064;
	/*0x1068*/ u32 unk1068;
	/*0x106c*/ u32 unk106c;
	/*0x1070*/ u32 unk1070;
	/*0x1074*/ u32 unk1074;
	/*0x1078*/ u32 unk1078;
	/*0x107c*/ u32 unk107c;
	/*0x1080*/ u32 unk1080;
	/*0x1084*/ u32 unk1084;
	/*0x1088*/ u32 unk1088;
	/*0x108c*/ u32 unk108c;
	/*0x1090*/ u32 unk1090;
	/*0x1094*/ u32 unk1094;
	/*0x1098*/ u32 unk1098;
	/*0x109c*/ u32 unk109c;
	/*0x10a0*/ u32 unk10a0;
	/*0x10a4*/ u32 unk10a4;
	/*0x10a8*/ u32 unk10a8;
	/*0x10ac*/ u32 unk10ac;
	/*0x10b0*/ u32 unk10b0;
	/*0x10b4*/ u32 unk10b4;
	/*0x10b8*/ u32 unk10b8;
	/*0x10bc*/ u32 unk10bc;
	/*0x10c0*/ u32 unk10c0;
	/*0x10c4*/ u32 unk10c4;
	/*0x10c8*/ u32 unk10c8;
	/*0x10cc*/ u32 unk10cc;
	/*0x10d0*/ u32 unk10d0;
	/*0x10d4*/ u32 unk10d4;
	/*0x10d8*/ u32 unk10d8;
	/*0x10dc*/ u32 unk10dc;
	/*0x10e0*/ u32 unk10e0;
	/*0x10e4*/ u32 unk10e4;
	/*0x10e8*/ u32 unk10e8;
	/*0x10ec*/ u32 unk10ec;
	/*0x10f0*/ u32 unk10f0;
	/*0x10f4*/ u32 unk10f4;
	/*0x10f8*/ u32 unk10f8;
	/*0x10fc*/ u32 unk10fc;
	/*0x1100*/ u32 unk1100;
	/*0x1104*/ u32 unk1104;
	/*0x1108*/ u32 unk1108;
	/*0x110c*/ u32 unk110c;
	/*0x1110*/ u32 unk1110;
	/*0x1114*/ u32 unk1114;
	/*0x1118*/ u32 unk1118;
	/*0x111c*/ u32 unk111c;
	/*0x1120*/ u32 unk1120;
	/*0x1124*/ u32 unk1124;
	/*0x1128*/ u32 unk1128;
	/*0x112c*/ u32 unk112c;
	/*0x1130*/ u32 unk1130;
	/*0x1134*/ u32 unk1134;
	/*0x1138*/ u32 unk1138;
	/*0x113c*/ u32 unk113c;
	/*0x1140*/ u32 unk1140;
	/*0x1144*/ u32 unk1144;
	/*0x1148*/ u32 unk1148;
	/*0x114c*/ u32 unk114c;
	/*0x1150*/ u32 unk1150;
	/*0x1154*/ u32 unk1154;
	/*0x1158*/ u32 unk1158;
	/*0x115c*/ u32 unk115c;
	/*0x1160*/ u32 unk1160;
	/*0x1164*/ u32 unk1164;
	/*0x1168*/ u32 unk1168;
	/*0x116c*/ u32 unk116c;
	/*0x1170*/ u32 unk1170;
	/*0x1174*/ u32 unk1174;
	/*0x1178*/ u32 unk1178;
	/*0x117c*/ u32 unk117c;
	/*0x1180*/ u32 unk1180;
	/*0x1184*/ u32 unk1184;
	/*0x1188*/ u32 unk1188;
	/*0x118c*/ u32 unk118c;
	/*0x1190*/ u32 unk1190;
	/*0x1194*/ u32 unk1194;
	/*0x1198*/ u32 unk1198;
	/*0x119c*/ u32 unk119c;
	/*0x11a0*/ u32 unk11a0;
	/*0x11a4*/ u32 unk11a4;
	/*0x11a8*/ u32 unk11a8;
	/*0x11ac*/ u32 unk11ac;
	/*0x11b0*/ u32 unk11b0;
	/*0x11b4*/ u32 unk11b4;
	/*0x11b8*/ u32 unk11b8;
	/*0x11bc*/ u32 unk11bc;
	/*0x11c0*/ u32 unk11c0;
	/*0x11c4*/ u32 unk11c4;
	/*0x11c8*/ u32 unk11c8;
	/*0x11cc*/ u32 unk11cc;
	/*0x11d0*/ u32 unk11d0;
	/*0x11d4*/ u32 unk11d4;
	/*0x11d8*/ u32 unk11d8;
	/*0x11dc*/ u32 unk11dc;
	/*0x11e0*/ u32 unk11e0;
	/*0x11e4*/ u32 unk11e4;
	/*0x11e8*/ u32 unk11e8;
	/*0x11ec*/ u32 unk11ec;
	/*0x11f0*/ u32 unk11f0;
	/*0x11f4*/ u32 unk11f4;
	/*0x11f8*/ u32 unk11f8;
	/*0x11fc*/ u32 unk11fc;
	/*0x1200*/ u32 unk1200;
	/*0x1204*/ u32 unk1204;
	/*0x1208*/ u32 unk1208;
	/*0x120c*/ u32 unk120c;
	/*0x1210*/ u32 unk1210;
	/*0x1214*/ u32 unk1214;
	/*0x1218*/ u32 unk1218;
	/*0x121c*/ u32 unk121c;
	/*0x1220*/ u32 unk1220;
	/*0x1224*/ u32 unk1224;
	/*0x1228*/ u32 unk1228;
	/*0x122c*/ u32 unk122c;
	/*0x1230*/ u32 unk1230;
	/*0x1234*/ u32 unk1234;
	/*0x1238*/ u32 unk1238;
	/*0x123c*/ u32 unk123c;
	/*0x1240*/ u32 unk1240;
	/*0x1244*/ u32 unk1244;
	/*0x1248*/ u32 unk1248;
	/*0x124c*/ u32 unk124c;
	/*0x1250*/ u32 unk1250;
	/*0x1254*/ u32 unk1254;
	/*0x1258*/ u32 unk1258;
	/*0x125c*/ u32 unk125c;
	/*0x1260*/ u32 unk1260;
	/*0x1264*/ u32 unk1264;
	/*0x1268*/ u32 unk1268;
	/*0x126c*/ u32 unk126c;
	/*0x1270*/ u32 unk1270;
	/*0x1274*/ u32 unk1274;
	/*0x1278*/ u32 unk1278;
	/*0x127c*/ u32 unk127c;
	/*0x1280*/ u32 unk1280;
	/*0x1284*/ u32 unk1284;
	/*0x1288*/ u32 unk1288;
	/*0x128c*/ u32 unk128c;
	/*0x1290*/ u32 unk1290;
	/*0x1294*/ u32 unk1294;
	/*0x1298*/ u32 unk1298;
	/*0x129c*/ u32 unk129c;
	/*0x12a0*/ u32 unk12a0;
	/*0x12a4*/ u32 unk12a4;
	/*0x12a8*/ u32 unk12a8;
	/*0x12ac*/ u32 unk12ac;
	/*0x12b0*/ u32 unk12b0;
	/*0x12b4*/ u32 unk12b4;
	/*0x12b8*/ u32 unk12b8;
	/*0x12bc*/ u32 unk12bc;
	/*0x12c0*/ u32 unk12c0;
	/*0x12c4*/ u32 unk12c4;
	/*0x12c8*/ u32 unk12c8;
	/*0x12cc*/ u32 unk12cc;
	/*0x12d0*/ u32 unk12d0;
	/*0x12d4*/ u32 unk12d4;
	/*0x12d8*/ u32 unk12d8;
	/*0x12dc*/ u32 unk12dc;
	/*0x12e0*/ u32 unk12e0;
	/*0x12e4*/ u32 unk12e4;
	/*0x12e8*/ u32 unk12e8;
	/*0x12ec*/ u32 unk12ec;
	/*0x12f0*/ u32 unk12f0;
	/*0x12f4*/ u32 unk12f4;
	/*0x12f8*/ u32 unk12f8;
	/*0x12fc*/ u32 unk12fc;
	/*0x1300*/ u32 unk1300;
	/*0x1304*/ u32 unk1304;
	/*0x1308*/ u32 unk1308;
	/*0x130c*/ u32 unk130c;
	/*0x1310*/ u32 unk1310;
	/*0x1314*/ u32 unk1314;
	/*0x1318*/ u32 unk1318;
	/*0x131c*/ u32 unk131c;
	/*0x1320*/ u32 unk1320;
	/*0x1324*/ u32 unk1324;
	/*0x1328*/ u32 unk1328;
	/*0x132c*/ u32 unk132c;
	/*0x1330*/ u32 unk1330;
	/*0x1334*/ u32 unk1334;
	/*0x1338*/ u32 unk1338;
	/*0x133c*/ u32 unk133c;
	/*0x1340*/ u32 unk1340;
	/*0x1344*/ u32 unk1344;
	/*0x1348*/ u32 unk1348;
	/*0x134c*/ u32 unk134c;
	/*0x1350*/ u32 unk1350;
	/*0x1354*/ u32 unk1354;
	/*0x1358*/ u32 unk1358;
	/*0x135c*/ u32 unk135c;
	/*0x1360*/ u32 unk1360;
	/*0x1364*/ u32 unk1364;
	/*0x1368*/ u32 unk1368;
	/*0x136c*/ u32 unk136c;
	/*0x1370*/ u32 unk1370;
	/*0x1374*/ u32 unk1374;
	/*0x1378*/ u32 unk1378;
	/*0x137c*/ u32 unk137c;
	/*0x1380*/ u32 unk1380;
	/*0x1384*/ u32 unk1384;
	/*0x1388*/ u32 unk1388;
	/*0x138c*/ u32 unk138c;
	/*0x1390*/ u32 unk1390;
	/*0x1394*/ u32 unk1394;
	/*0x1398*/ u32 unk1398;
	/*0x139c*/ u32 unk139c;
	/*0x13a0*/ u32 unk13a0;
	/*0x13a4*/ u32 unk13a4;
	/*0x13a8*/ u32 unk13a8;
	/*0x13ac*/ u32 unk13ac;
	/*0x13b0*/ u32 unk13b0;
	/*0x13b4*/ u32 unk13b4;
	/*0x13b8*/ u32 unk13b8;
	/*0x13bc*/ u32 unk13bc;
	/*0x13c0*/ u32 unk13c0;
	/*0x13c4*/ u32 unk13c4;
	/*0x13c8*/ u32 unk13c8;
	/*0x13cc*/ u32 unk13cc;
	/*0x13d0*/ u32 unk13d0;
	/*0x13d4*/ u32 unk13d4;
	/*0x13d8*/ u32 unk13d8;
	/*0x13dc*/ u32 unk13dc;
	/*0x13e0*/ u32 unk13e0;
	/*0x13e4*/ u32 unk13e4;
	/*0x13e8*/ u32 unk13e8;
	/*0x13ec*/ u32 unk13ec;
	/*0x13f0*/ u32 unk13f0;
	/*0x13f4*/ u32 unk13f4;
	/*0x13f8*/ u32 unk13f8;
	/*0x13fc*/ u32 unk13fc;
	/*0x1400*/ u32 unk1400;
	/*0x1404*/ u32 unk1404;
	/*0x1408*/ u32 unk1408;
	/*0x140c*/ u32 unk140c;
	/*0x1410*/ u32 unk1410;
	/*0x1414*/ u32 unk1414;
	/*0x1418*/ u32 unk1418;
	/*0x141c*/ u32 unk141c;
	/*0x1420*/ u32 unk1420;
	/*0x1424*/ u32 unk1424;
	/*0x1428*/ u32 unk1428;
	/*0x142c*/ u32 unk142c;
	/*0x1430*/ u32 unk1430;
	/*0x1434*/ u32 unk1434;
	/*0x1438*/ u32 unk1438;
	/*0x143c*/ u32 unk143c;
	/*0x1440*/ u32 unk1440;
	/*0x1444*/ u32 unk1444;
	/*0x1448*/ u32 unk1448;
	/*0x144c*/ u32 unk144c;
	/*0x1450*/ u32 unk1450;
	/*0x1454*/ u32 unk1454;
	/*0x1458*/ u32 unk1458;
	/*0x145c*/ u32 unk145c;
	/*0x1460*/ u32 unk1460;
	/*0x1464*/ u32 unk1464;
	/*0x1468*/ u32 unk1468;
	/*0x146c*/ u32 unk146c;
	/*0x1470*/ u32 unk1470;
	/*0x1474*/ u32 unk1474;
	/*0x1478*/ u32 unk1478;
	/*0x147c*/ u32 unk147c;
	/*0x1480*/ u32 unk1480;
	/*0x1484*/ u32 unk1484;
	/*0x1488*/ u32 unk1488;
	/*0x148c*/ u32 unk148c;
	/*0x1490*/ u32 unk1490;
	/*0x1494*/ u32 unk1494;
	/*0x1498*/ u32 unk1498;
	/*0x149c*/ u32 unk149c;
	/*0x14a0*/ u32 unk14a0;
	/*0x14a4*/ u32 unk14a4;
	/*0x14a8*/ u32 unk14a8;
	/*0x14ac*/ u32 unk14ac;
	/*0x14b0*/ u32 unk14b0;
	/*0x14b4*/ u32 unk14b4;
	/*0x14b8*/ u32 unk14b8;
	/*0x14bc*/ u32 unk14bc;
	/*0x14c0*/ u32 unk14c0;
	/*0x14c4*/ u32 unk14c4;
	/*0x14c8*/ u32 unk14c8;
	/*0x14cc*/ u32 unk14cc;
	/*0x14d0*/ u32 unk14d0;
	/*0x14d4*/ u32 unk14d4;
	/*0x14d8*/ u32 unk14d8;
	/*0x14dc*/ u32 unk14dc;
	/*0x14e0*/ u32 unk14e0;
	/*0x14e4*/ u32 unk14e4;
	/*0x14e8*/ u32 unk14e8;
	/*0x14ec*/ u32 unk14ec;
	/*0x14f0*/ u32 unk14f0;
	/*0x14f4*/ u32 unk14f4;
	/*0x14f8*/ u32 unk14f8;
	/*0x14fc*/ u32 unk14fc;
	/*0x1500*/ u32 unk1500;
	/*0x1504*/ u32 unk1504;
	/*0x1508*/ u32 unk1508;
	/*0x150c*/ u32 unk150c;
	/*0x1510*/ u32 unk1510;
	/*0x1514*/ u32 unk1514;
	/*0x1518*/ u32 unk1518;
	/*0x151c*/ u32 unk151c;
	/*0x1520*/ u32 unk1520;
	/*0x1524*/ u32 unk1524;
	/*0x1528*/ u32 unk1528;
	/*0x152c*/ u32 unk152c;
	/*0x1530*/ u32 unk1530;
	/*0x1534*/ u32 unk1534;
	/*0x1538*/ u32 unk1538;
	/*0x153c*/ u32 unk153c;
	/*0x1540*/ u32 unk1540;
	/*0x1544*/ u32 unk1544;
	/*0x1548*/ u32 unk1548;
	/*0x154c*/ u32 unk154c;
	/*0x1550*/ u32 unk1550;
	/*0x1554*/ u32 unk1554;
	/*0x1558*/ u32 unk1558;
	/*0x155c*/ u32 unk155c;
	/*0x1560*/ u32 unk1560;
	/*0x1564*/ u32 unk1564;
	/*0x1568*/ u32 unk1568;
	/*0x156c*/ u32 unk156c;
	/*0x1570*/ u32 unk1570;
	/*0x1574*/ u32 unk1574;
	/*0x1578*/ u32 unk1578;
	/*0x157c*/ u32 unk157c;
	/*0x1580*/ u32 unk1580;
	/*0x1584*/ u32 unk1584;
	/*0x1588*/ u32 unk1588;
	/*0x158c*/ u32 unk158c;
	/*0x1590*/ u32 unk1590;
	/*0x1594*/ u32 unk1594;
	/*0x1598*/ u32 unk1598;
	/*0x159c*/ u32 unk159c;
	/*0x15a0*/ u32 unk15a0;
	/*0x15a4*/ u32 unk15a4;
	/*0x15a8*/ u32 unk15a8;
	/*0x15ac*/ u32 unk15ac;
	/*0x15b0*/ u32 unk15b0;
	/*0x15b4*/ u32 unk15b4;
	/*0x15b8*/ u32 unk15b8;
	/*0x15bc*/ u32 unk15bc;
	/*0x15c0*/ u32 unk15c0;
	/*0x15c4*/ u32 unk15c4;
	/*0x15c8*/ u32 unk15c8;
	/*0x15cc*/ u32 unk15cc;
	/*0x15d0*/ u32 unk15d0;
	/*0x15d4*/ u32 unk15d4;
	/*0x15d8*/ u32 unk15d8;
	/*0x15dc*/ u32 unk15dc;
	/*0x15e0*/ u32 unk15e0;
	/*0x15e4*/ u32 unk15e4;
	/*0x15e8*/ u32 unk15e8;
	/*0x15ec*/ u32 unk15ec;
	/*0x15f0*/ u32 unk15f0;
	/*0x15f4*/ u32 unk15f4;
	/*0x15f8*/ u32 unk15f8;
	/*0x15fc*/ u32 unk15fc;
	/*0x1600*/ u32 unk1600;
	/*0x1604*/ u32 unk1604;
	/*0x1608*/ u32 unk1608;
	/*0x160c*/ u32 unk160c;
	/*0x1610*/ u32 unk1610;
	/*0x1614*/ u32 unk1614;
	/*0x1618*/ u32 unk1618;
	/*0x161c*/ u32 unk161c;
	/*0x1620*/ u32 unk1620;
	/*0x1624*/ u32 unk1624;
	/*0x1628*/ u32 unk1628;
	/*0x162c*/ u32 unk162c;
	/*0x1630*/ u32 unk1630;
	/*0x1634*/ u32 unk1634;
	/*0x1638*/ u32 unk1638;
	/*0x163c*/ u32 unk163c;
	/*0x1640*/ u32 unk1640;
	/*0x1644*/ u32 unk1644;
	/*0x1648*/ u32 unk1648;
	/*0x164c*/ u32 unk164c;
	/*0x1650*/ u32 unk1650;
	/*0x1654*/ u32 unk1654;
	/*0x1658*/ u32 unk1658;
	/*0x165c*/ u32 unk165c;
	/*0x1660*/ u32 unk1660;
	/*0x1664*/ u32 unk1664;
	/*0x1668*/ u32 unk1668;
	/*0x166c*/ u32 unk166c;
	/*0x1670*/ u32 unk1670;
	/*0x1674*/ u32 unk1674;
	/*0x1678*/ u32 unk1678;
	/*0x167c*/ u32 unk167c;
	/*0x1680*/ u32 unk1680;
	/*0x1684*/ u32 unk1684;
	/*0x1688*/ u32 unk1688;
	/*0x168c*/ u32 unk168c;
	/*0x1690*/ u32 unk1690;
	/*0x1694*/ u32 unk1694;
	/*0x1698*/ u32 unk1698;
	/*0x169c*/ u32 unk169c;
	/*0x16a0*/ u32 unk16a0;
	/*0x16a4*/ u32 unk16a4;
	/*0x16a8*/ u32 unk16a8;
	/*0x16ac*/ u32 unk16ac;
	/*0x16b0*/ u32 unk16b0;
	/*0x16b4*/ u32 unk16b4;
	/*0x16b8*/ u32 unk16b8;
	/*0x16bc*/ u32 unk16bc;
	/*0x16c0*/ u32 unk16c0;
	/*0x16c4*/ u32 unk16c4;
	/*0x16c8*/ u32 unk16c8;
	/*0x16cc*/ u32 unk16cc;
	/*0x16d0*/ u32 unk16d0;
	/*0x16d4*/ u32 unk16d4;
	/*0x16d8*/ u32 unk16d8;
	/*0x16dc*/ u32 unk16dc;
	/*0x16e0*/ u32 unk16e0;
	/*0x16e4*/ u32 unk16e4;
	/*0x16e8*/ u32 unk16e8;
	/*0x16ec*/ u32 unk16ec;
	/*0x16f0*/ u32 unk16f0;
	/*0x16f4*/ u32 unk16f4;
	/*0x16f8*/ u32 unk16f8;
	/*0x16fc*/ u32 unk16fc;
	/*0x1700*/ u32 unk1700;
	/*0x1704*/ u32 unk1704;
	/*0x1708*/ u32 unk1708;
	/*0x170c*/ u32 unk170c;
	/*0x1710*/ u32 unk1710;
	/*0x1714*/ u32 unk1714;
	/*0x1718*/ u32 unk1718;
	/*0x171c*/ u32 unk171c;
	/*0x1720*/ u32 unk1720;
	/*0x1724*/ u32 unk1724;
	/*0x1728*/ u32 unk1728;
	/*0x172c*/ u32 unk172c;
	/*0x1730*/ u32 unk1730;
	/*0x1734*/ u32 unk1734;
	/*0x1738*/ u32 unk1738;
	/*0x173c*/ u32 unk173c;
	/*0x1740*/ u32 unk1740;
	/*0x1744*/ u32 unk1744;
	/*0x1748*/ u32 unk1748;
	/*0x174c*/ u32 unk174c;
	/*0x1750*/ u32 unk1750;
	/*0x1754*/ u32 unk1754;
	/*0x1758*/ u32 unk1758;
	/*0x175c*/ u32 unk175c;
	/*0x1760*/ u32 unk1760;
	/*0x1764*/ u32 unk1764;
	/*0x1768*/ u32 unk1768;
	/*0x176c*/ u32 unk176c;
	/*0x1770*/ u32 unk1770;
	/*0x1774*/ u32 unk1774;
	/*0x1778*/ u32 unk1778;
	/*0x177c*/ u32 unk177c;
	/*0x1780*/ u32 unk1780;
	/*0x1784*/ u32 unk1784;
	/*0x1788*/ u32 unk1788;
	/*0x178c*/ u32 unk178c;
	/*0x1790*/ u32 unk1790;
	/*0x1794*/ u32 unk1794;
	/*0x1798*/ u32 unk1798;
	/*0x179c*/ u32 unk179c;
	/*0x17a0*/ u32 unk17a0;
	/*0x17a4*/ u32 unk17a4;
	/*0x17a8*/ u32 unk17a8;
	/*0x17ac*/ u32 unk17ac;
	/*0x17b0*/ u32 unk17b0;
	/*0x17b4*/ u32 unk17b4;
	/*0x17b8*/ u32 unk17b8;
	/*0x17bc*/ u32 unk17bc;
	/*0x17c0*/ u32 unk17c0;
	/*0x17c4*/ u32 unk17c4;
	/*0x17c8*/ u32 unk17c8;
	/*0x17cc*/ u32 unk17cc;
	/*0x17d0*/ u32 unk17d0;
	/*0x17d4*/ u32 unk17d4;
	/*0x17d8*/ u32 unk17d8;
	/*0x17dc*/ u32 unk17dc;
	/*0x17e0*/ u32 unk17e0;
	/*0x17e4*/ u32 unk17e4;
	/*0x17e8*/ u32 unk17e8;
	/*0x17ec*/ u32 unk17ec;
	/*0x17f0*/ u32 unk17f0;
	/*0x17f4*/ u32 unk17f4;
	/*0x17f8*/ u32 unk17f8;
	/*0x17fc*/ u32 unk17fc;
	/*0x1800*/ u32 unk1800;
	/*0x1804*/ u32 unk1804;
	/*0x1808*/ u32 unk1808;
	/*0x180c*/ u32 unk180c;
	/*0x1810*/ u32 unk1810;
	/*0x1814*/ u32 unk1814;
	/*0x1818*/ u32 unk1818;
	/*0x181c*/ u32 unk181c;
	/*0x1820*/ u32 unk1820;
	/*0x1824*/ u32 unk1824;
	/*0x1828*/ u32 unk1828;
	/*0x182c*/ u32 unk182c;
	/*0x1830*/ u32 unk1830;
	/*0x1834*/ u32 unk1834;
	/*0x1838*/ u32 unk1838;
	/*0x183c*/ u32 unk183c;
	/*0x1840*/ u32 unk1840;
	/*0x1844*/ u32 unk1844;
	/*0x1848*/ u32 unk1848;
	/*0x184c*/ u32 unk184c;
	/*0x1850*/ u32 unk1850;
	/*0x1854*/ u32 unk1854;
	/*0x1858*/ u32 unk1858;
	/*0x185c*/ u32 unk185c;
	/*0x1860*/ u32 unk1860;
	/*0x1864*/ u32 unk1864;
	/*0x1868*/ u32 unk1868;
	/*0x186c*/ u32 unk186c;
	/*0x1870*/ u32 unk1870;
	/*0x1874*/ u32 unk1874;
	/*0x1878*/ u32 unk1878;
	/*0x187c*/ u32 unk187c;
	/*0x1880*/ u32 unk1880;
	/*0x1884*/ u32 unk1884;
	/*0x1888*/ u32 unk1888;
	/*0x188c*/ u32 unk188c;
	/*0x1890*/ u32 unk1890;
	/*0x1894*/ u32 unk1894;
	/*0x1898*/ u32 unk1898;
	/*0x189c*/ u32 unk189c;
	/*0x18a0*/ u32 unk18a0;
	/*0x18a4*/ u32 unk18a4;
	/*0x18a8*/ u32 unk18a8;
	/*0x18ac*/ u32 unk18ac;
	/*0x18b0*/ u32 unk18b0;
	/*0x18b4*/ u32 unk18b4;
	/*0x18b8*/ u32 unk18b8;
	/*0x18bc*/ u32 unk18bc;
	/*0x18c0*/ u32 unk18c0;
	/*0x18c4*/ u32 unk18c4;
	/*0x18c8*/ u32 unk18c8;
	/*0x18cc*/ u32 unk18cc;
	/*0x18d0*/ u32 unk18d0;
	/*0x18d4*/ u32 unk18d4;
	/*0x18d8*/ u32 unk18d8;
	/*0x18dc*/ u32 unk18dc;
	/*0x18e0*/ u32 unk18e0;
	/*0x18e4*/ u32 unk18e4;
	/*0x18e8*/ u32 unk18e8;
	/*0x18ec*/ u32 unk18ec;
	/*0x18f0*/ u32 unk18f0;
	/*0x18f4*/ u32 unk18f4;
	/*0x18f8*/ u32 unk18f8;
	/*0x18fc*/ u32 unk18fc;
	/*0x1900*/ u32 unk1900;
	/*0x1904*/ u32 unk1904;
	/*0x1908*/ u32 unk1908;
	/*0x190c*/ u32 unk190c;
	/*0x1910*/ u32 unk1910;
	/*0x1914*/ u32 unk1914;
	/*0x1918*/ u32 unk1918;
	/*0x191c*/ u32 unk191c;
	/*0x1920*/ u32 unk1920;
	/*0x1924*/ u32 unk1924;
	/*0x1928*/ u32 unk1928;
	/*0x192c*/ u32 unk192c;
	/*0x1930*/ u32 unk1930;
	/*0x1934*/ u32 unk1934;
	/*0x1938*/ u32 unk1938;
	/*0x193c*/ u32 unk193c;
	/*0x1940*/ u32 unk1940;
	/*0x1944*/ u32 unk1944;
	/*0x1948*/ u32 unk1948;
	/*0x194c*/ u32 unk194c;
	/*0x1950*/ u32 unk1950;
	/*0x1954*/ u32 unk1954;
	/*0x1958*/ u32 unk1958;
	/*0x195c*/ u32 unk195c;
	/*0x1960*/ u32 unk1960;
	/*0x1964*/ u32 unk1964;
	/*0x1968*/ u32 unk1968;
	/*0x196c*/ u32 unk196c;
	/*0x1970*/ u32 unk1970;
	/*0x1974*/ u32 unk1974;
	/*0x1978*/ u32 unk1978;
	/*0x197c*/ u32 unk197c;
	/*0x1980*/ u32 unk1980;
	/*0x1984*/ u32 unk1984;
	/*0x1988*/ u32 unk1988;
	/*0x198c*/ u32 unk198c;
	/*0x1990*/ u32 unk1990;
	/*0x1994*/ u32 unk1994;
	/*0x1998*/ u32 unk1998;
	/*0x199c*/ u32 unk199c;
	/*0x19a0*/ u32 unk19a0;
	/*0x19a4*/ u32 unk19a4;
	/*0x19a8*/ u32 unk19a8;
	/*0x19ac*/ u32 unk19ac;
	/*0x19b0*/ u32 unk19b0;
	/*0x19b4*/ u32 unk19b4;
	/*0x19b8*/ u32 unk19b8;
	/*0x19bc*/ u32 unk19bc;
	/*0x19c0*/ u32 unk19c0;
	/*0x19c4*/ u32 unk19c4;
	/*0x19c8*/ u32 unk19c8;
	/*0x19cc*/ u32 unk19cc;
	/*0x19d0*/ u32 unk19d0;
	/*0x19d4*/ u32 unk19d4;
	/*0x19d8*/ u32 unk19d8;
	/*0x19dc*/ u32 unk19dc;
	/*0x19e0*/ u32 unk19e0;
	/*0x19e4*/ u32 unk19e4;
	/*0x19e8*/ u32 unk19e8;
	/*0x19ec*/ u32 unk19ec;
	/*0x19f0*/ u32 unk19f0;
	/*0x19f4*/ u32 unk19f4;
	/*0x19f8*/ u32 unk19f8;
	/*0x19fc*/ u32 unk19fc;
	/*0x1a00*/ u32 unk1a00;
	/*0x1a04*/ u32 unk1a04;
	/*0x1a08*/ u32 unk1a08;
	/*0x1a0c*/ u32 unk1a0c;
	/*0x1a10*/ u32 unk1a10;
	/*0x1a14*/ u32 unk1a14;
	/*0x1a18*/ u32 unk1a18;
	/*0x1a1c*/ u32 unk1a1c;
	/*0x1a20*/ u32 unk1a20;
	/*0x1a24*/ u32 unk1a24;
	/*0x1a28*/ u32 unk1a28;
	/*0x1a2c*/ u32 unk1a2c;
	/*0x1a30*/ u32 unk1a30;
	/*0x1a34*/ u32 unk1a34;
	/*0x1a38*/ u32 unk1a38;
	/*0x1a3c*/ u32 unk1a3c;
	/*0x1a40*/ u32 unk1a40;
	/*0x1a44*/ u32 unk1a44;
	/*0x1a48*/ u32 unk1a48;
	/*0x1a4c*/ u32 unk1a4c;
	/*0x1a50*/ u32 unk1a50;
	/*0x1a54*/ u32 unk1a54;
	/*0x1a58*/ u32 unk1a58;
	/*0x1a5c*/ u32 unk1a5c;
	/*0x1a60*/ u32 unk1a60;
	/*0x1a64*/ u32 unk1a64;
	/*0x1a68*/ u32 unk1a68;
	/*0x1a6c*/ u32 unk1a6c;
	/*0x1a70*/ u32 unk1a70;
	/*0x1a74*/ u32 unk1a74;
	/*0x1a78*/ u32 unk1a78;
	/*0x1a7c*/ u32 unk1a7c;
	/*0x1a80*/ u32 unk1a80;
	/*0x1a84*/ u32 unk1a84;
	/*0x1a88*/ u32 unk1a88;
	/*0x1a8c*/ u32 unk1a8c;
	/*0x1a90*/ u32 unk1a90;
	/*0x1a94*/ u32 unk1a94;
	/*0x1a98*/ u32 unk1a98;
	/*0x1a9c*/ u32 unk1a9c;
	/*0x1aa0*/ u32 unk1aa0;
	/*0x1aa4*/ u32 unk1aa4;
	/*0x1aa8*/ u32 unk1aa8;
	/*0x1aac*/ u32 unk1aac;
	/*0x1ab0*/ u32 unk1ab0;
	/*0x1ab4*/ u32 unk1ab4;
	/*0x1ab8*/ u32 unk1ab8;
	/*0x1abc*/ u32 unk1abc;
	/*0x1ac0*/ u32 unk1ac0;
	/*0x1ac4*/ u32 unk1ac4;
	/*0x1ac8*/ u32 unk1ac8;
	/*0x1acc*/ u32 unk1acc;
	/*0x1ad0*/ u32 unk1ad0;
	/*0x1ad4*/ u32 unk1ad4;
	/*0x1ad8*/ u32 unk1ad8;
	/*0x1adc*/ u32 unk1adc;
	/*0x1ae0*/ u32 unk1ae0;
	/*0x1ae4*/ u32 unk1ae4;
	/*0x1ae8*/ u32 unk1ae8;
	/*0x1aec*/ u32 unk1aec;
	/*0x1af0*/ u32 unk1af0;
	/*0x1af4*/ u32 unk1af4;
	/*0x1af8*/ u32 unk1af8;
	/*0x1afc*/ u32 unk1afc;
	/*0x1b00*/ u32 unk1b00;
	/*0x1b04*/ u32 unk1b04;
	/*0x1b08*/ u32 unk1b08;
	/*0x1b0c*/ u32 unk1b0c;
	/*0x1b10*/ u32 unk1b10;
	/*0x1b14*/ u32 unk1b14;
	/*0x1b18*/ u32 unk1b18;
	/*0x1b1c*/ u32 unk1b1c;
	/*0x1b20*/ u32 unk1b20;
	/*0x1b24*/ u32 unk1b24;
	/*0x1b28*/ u32 unk1b28;
	/*0x1b2c*/ u32 unk1b2c;
	/*0x1b30*/ u32 unk1b30;
	/*0x1b34*/ u32 unk1b34;
	/*0x1b38*/ u32 unk1b38;
	/*0x1b3c*/ u32 unk1b3c;
	/*0x1b40*/ u32 unk1b40;
	/*0x1b44*/ u32 unk1b44;
	/*0x1b48*/ u32 unk1b48;
	/*0x1b4c*/ u32 unk1b4c;
	/*0x1b50*/ u32 unk1b50;
	/*0x1b54*/ u32 unk1b54;
	/*0x1b58*/ u32 unk1b58;
	/*0x1b5c*/ u32 unk1b5c;
	/*0x1b60*/ u32 unk1b60;
	/*0x1b64*/ u32 unk1b64;
	/*0x1b68*/ u32 unk1b68;
	/*0x1b6c*/ u32 unk1b6c;
	/*0x1b70*/ u32 unk1b70;
	/*0x1b74*/ u32 unk1b74;
	/*0x1b78*/ u32 unk1b78;
	/*0x1b7c*/ u32 unk1b7c;
	/*0x1b80*/ u32 unk1b80;
	/*0x1b84*/ u32 unk1b84;
	/*0x1b88*/ u32 unk1b88;
	/*0x1b8c*/ u32 unk1b8c;
	/*0x1b90*/ u32 unk1b90;
	/*0x1b94*/ u32 unk1b94;
	/*0x1b98*/ u32 unk1b98;
	/*0x1b9c*/ u32 unk1b9c;
	/*0x1ba0*/ u32 unk1ba0;
	/*0x1ba4*/ u32 unk1ba4;
	/*0x1ba8*/ u32 unk1ba8;
	/*0x1bac*/ u32 unk1bac;
	/*0x1bb0*/ u32 unk1bb0;
	/*0x1bb4*/ u32 unk1bb4;
	/*0x1bb8*/ u32 unk1bb8;
	/*0x1bbc*/ u32 unk1bbc;
	/*0x1bc0*/ u32 unk1bc0;
	/*0x1bc4*/ u32 unk1bc4;
	/*0x1bc8*/ u32 unk1bc8;
	/*0x1bcc*/ u32 unk1bcc;
	/*0x1bd0*/ u32 unk1bd0;
	/*0x1bd4*/ u32 unk1bd4;
	/*0x1bd8*/ u32 unk1bd8;
	/*0x1bdc*/ u32 unk1bdc;
	/*0x1be0*/ u32 unk1be0;
	/*0x1be4*/ u32 unk1be4;
	/*0x1be8*/ u32 unk1be8;
	/*0x1bec*/ u32 unk1bec;
	/*0x1bf0*/ u32 unk1bf0;
	/*0x1bf4*/ u32 unk1bf4;
	/*0x1bf8*/ u32 unk1bf8;
	/*0x1bfc*/ u32 unk1bfc;
	/*0x1c00*/ u32 unk1c00;
	/*0x1c04*/ u32 unk1c04;
	/*0x1c08*/ u32 unk1c08;
	/*0x1c0c*/ u32 unk1c0c;
	/*0x1c10*/ u32 unk1c10;
	/*0x1c14*/ u32 unk1c14;
	/*0x1c18*/ u32 unk1c18;
	/*0x1c1c*/ u32 unk1c1c;
	/*0x1c20*/ u32 unk1c20;
	/*0x1c24*/ u32 unk1c24;
	/*0x1c28*/ u32 unk1c28;
	/*0x1c2c*/ u32 unk1c2c;
	/*0x1c30*/ u32 unk1c30;
	/*0x1c34*/ u32 unk1c34;
	/*0x1c38*/ u32 unk1c38;
	/*0x1c3c*/ u32 unk1c3c;
	/*0x1c40*/ u32 unk1c40;
	/*0x1c44*/ u32 unk1c44;
	/*0x1c48*/ u32 unk1c48;
	/*0x1c4c*/ u32 unk1c4c;
	/*0x1c50*/ u32 unk1c50;
	/*0x1c54*/ u32 unk1c54;
	/*0x1c58*/ u32 unk1c58;
	/*0x1c5c*/ u32 unk1c5c;
	/*0x1c60*/ u32 unk1c60;
	/*0x1c64*/ u32 unk1c64;
	/*0x1c68*/ u32 unk1c68;
	/*0x1c6c*/ u32 unk1c6c;
	/*0x1c70*/ u32 unk1c70;
	/*0x1c74*/ u32 unk1c74;
	/*0x1c78*/ u32 unk1c78;
	/*0x1c7c*/ u32 unk1c7c;
	/*0x1c80*/ u32 unk1c80;
	/*0x1c84*/ u32 unk1c84;
	/*0x1c88*/ u32 unk1c88;
	/*0x1c8c*/ u32 unk1c8c;
	/*0x1c90*/ u32 unk1c90;
	/*0x1c94*/ u32 unk1c94;
	/*0x1c98*/ u32 unk1c98;
	/*0x1c9c*/ u32 unk1c9c;
	/*0x1ca0*/ u32 unk1ca0;
	/*0x1ca4*/ u32 unk1ca4;
	/*0x1ca8*/ u32 unk1ca8;
	/*0x1cac*/ u32 unk1cac;
	/*0x1cb0*/ u32 unk1cb0;
	/*0x1cb4*/ u32 unk1cb4;
	/*0x1cb8*/ u32 unk1cb8;
	/*0x1cbc*/ u32 unk1cbc;
	/*0x1cc0*/ u32 unk1cc0;
	/*0x1cc4*/ u32 unk1cc4;
	/*0x1cc8*/ u32 unk1cc8;
	/*0x1ccc*/ u32 unk1ccc;
	/*0x1cd0*/ u32 unk1cd0;
	/*0x1cd4*/ u32 unk1cd4;
	/*0x1cd8*/ u32 unk1cd8;
	/*0x1cdc*/ u32 unk1cdc;
	/*0x1ce0*/ u32 unk1ce0;
	/*0x1ce4*/ u32 unk1ce4;
	/*0x1ce8*/ u32 unk1ce8;
	/*0x1cec*/ u32 unk1cec;
	/*0x1cf0*/ u32 unk1cf0;
	/*0x1cf4*/ u32 unk1cf4;
	/*0x1cf8*/ u32 unk1cf8;
	/*0x1cfc*/ u32 unk1cfc;
	/*0x1d00*/ u32 unk1d00;
	/*0x1d04*/ u32 unk1d04;
	/*0x1d08*/ u32 unk1d08;
	/*0x1d0c*/ u32 unk1d0c;
	/*0x1d10*/ u32 unk1d10;
	/*0x1d14*/ u32 unk1d14;
	/*0x1d18*/ u32 unk1d18;
	/*0x1d1c*/ u32 unk1d1c;
	/*0x1d20*/ u32 unk1d20;
	/*0x1d24*/ u32 unk1d24;
	/*0x1d28*/ u32 unk1d28;
	/*0x1d2c*/ u32 unk1d2c;
	/*0x1d30*/ u32 unk1d30;
	/*0x1d34*/ u32 unk1d34;
	/*0x1d38*/ u32 unk1d38;
	/*0x1d3c*/ u32 unk1d3c;
	/*0x1d40*/ u32 unk1d40;
	/*0x1d44*/ u32 unk1d44;
	/*0x1d48*/ u32 unk1d48;
	/*0x1d4c*/ u32 unk1d4c;
	/*0x1d50*/ u32 unk1d50;
	/*0x1d54*/ u32 unk1d54;
	/*0x1d58*/ u32 unk1d58;
	/*0x1d5c*/ u32 unk1d5c;
	/*0x1d60*/ u32 unk1d60;
	/*0x1d64*/ u32 unk1d64;
	/*0x1d68*/ u32 unk1d68;
	/*0x1d6c*/ u32 unk1d6c;
	/*0x1d70*/ u32 unk1d70;
	/*0x1d74*/ u32 unk1d74;
	/*0x1d78*/ u32 unk1d78;
	/*0x1d7c*/ u32 unk1d7c;
	/*0x1d80*/ u32 unk1d80;
	/*0x1d84*/ u32 unk1d84;
	/*0x1d88*/ u32 unk1d88;
	/*0x1d8c*/ u32 unk1d8c;
	/*0x1d90*/ u32 unk1d90;
	/*0x1d94*/ u32 unk1d94;
	/*0x1d98*/ u32 unk1d98;
	/*0x1d9c*/ u32 unk1d9c;
	/*0x1da0*/ u32 unk1da0;
	/*0x1da4*/ u32 unk1da4;
	/*0x1da8*/ u32 unk1da8;
	/*0x1dac*/ u32 unk1dac;
	/*0x1db0*/ u32 unk1db0;
	/*0x1db4*/ u32 unk1db4;
	/*0x1db8*/ u32 unk1db8;
	/*0x1dbc*/ u32 unk1dbc;
	/*0x1dc0*/ u32 unk1dc0;
	/*0x1dc4*/ u32 unk1dc4;
	/*0x1dc8*/ u32 unk1dc8;
	/*0x1dcc*/ u32 unk1dcc;
	/*0x1dd0*/ u32 unk1dd0;
	/*0x1dd4*/ u32 unk1dd4;
	/*0x1dd8*/ u32 unk1dd8;
	/*0x1ddc*/ u32 unk1ddc;
	/*0x1de0*/ u32 unk1de0;
	/*0x1de4*/ u32 unk1de4;
	/*0x1de8*/ u32 unk1de8;
	/*0x1dec*/ u32 unk1dec;
	/*0x1df0*/ u32 unk1df0;
	/*0x1df4*/ u32 unk1df4;
	/*0x1df8*/ u32 unk1df8;
	/*0x1dfc*/ u32 unk1dfc;
	/*0x1e00*/ u32 unk1e00;
	/*0x1e04*/ u32 unk1e04;
	/*0x1e08*/ u32 unk1e08;
	/*0x1e0c*/ u32 unk1e0c;
	/*0x1e10*/ u32 unk1e10;
	/*0x1e14*/ u32 unk1e14;
	/*0x1e18*/ u32 unk1e18;
	/*0x1e1c*/ u32 unk1e1c;
	/*0x1e20*/ u32 unk1e20;
	/*0x1e24*/ u32 unk1e24;
	/*0x1e28*/ u32 unk1e28;
	/*0x1e2c*/ u32 unk1e2c;
	/*0x1e30*/ u32 unk1e30;
	/*0x1e34*/ u32 unk1e34;
	/*0x1e38*/ u32 unk1e38;
	/*0x1e3c*/ u32 unk1e3c;
	/*0x1e40*/ u32 unk1e40;
	/*0x1e44*/ u32 unk1e44;
	/*0x1e48*/ u32 unk1e48;
	/*0x1e4c*/ u32 unk1e4c;
	/*0x1e50*/ u32 unk1e50;
	/*0x1e54*/ u32 unk1e54;
	/*0x1e58*/ u32 unk1e58;
	/*0x1e5c*/ u32 unk1e5c;
	/*0x1e60*/ u32 unk1e60;
	/*0x1e64*/ u32 unk1e64;
	/*0x1e68*/ u32 unk1e68;
	/*0x1e6c*/ u32 unk1e6c;
	/*0x1e70*/ u32 unk1e70;
	/*0x1e74*/ u32 unk1e74;
	/*0x1e78*/ u32 unk1e78;
	/*0x1e7c*/ u32 unk1e7c;
	/*0x1e80*/ u32 unk1e80;
	/*0x1e84*/ u32 unk1e84;
	/*0x1e88*/ u32 unk1e88;
	/*0x1e8c*/ u32 unk1e8c;
	/*0x1e90*/ u32 unk1e90;
	/*0x1e94*/ u32 unk1e94;
	/*0x1e98*/ u32 unk1e98;
	/*0x1e9c*/ u32 unk1e9c;
	/*0x1ea0*/ u32 unk1ea0;
	/*0x1ea4*/ u32 unk1ea4;
	/*0x1ea8*/ u32 unk1ea8;
	/*0x1eac*/ u32 unk1eac;
	/*0x1eb0*/ u32 unk1eb0;
	/*0x1eb4*/ u32 unk1eb4;
	/*0x1eb8*/ u32 unk1eb8;
	/*0x1ebc*/ u32 unk1ebc;
	/*0x1ec0*/ u32 unk1ec0;
	/*0x1ec4*/ u32 unk1ec4;
	/*0x1ec8*/ u32 unk1ec8;
	/*0x1ecc*/ u32 unk1ecc;
	/*0x1ed0*/ u32 unk1ed0;
	/*0x1ed4*/ u32 unk1ed4;
	/*0x1ed8*/ u32 unk1ed8;
	/*0x1edc*/ u32 unk1edc;
	/*0x1ee0*/ u32 unk1ee0;
	/*0x1ee4*/ u32 unk1ee4;
	/*0x1ee8*/ u32 unk1ee8;
	/*0x1eec*/ u32 unk1eec;
	/*0x1ef0*/ u32 unk1ef0;
	/*0x1ef4*/ u32 unk1ef4;
	/*0x1ef8*/ u32 unk1ef8;
	/*0x1efc*/ u32 unk1efc;
	/*0x1f00*/ u32 unk1f00;
	/*0x1f04*/ u32 unk1f04;
	/*0x1f08*/ u32 unk1f08;
	/*0x1f0c*/ u32 unk1f0c;
	/*0x1f10*/ u32 unk1f10;
	/*0x1f14*/ u32 unk1f14;
	/*0x1f18*/ u32 unk1f18;
	/*0x1f1c*/ u32 unk1f1c;
	/*0x1f20*/ u32 unk1f20;
	/*0x1f24*/ u32 unk1f24;
	/*0x1f28*/ u32 unk1f28;
	/*0x1f2c*/ u32 unk1f2c;
	/*0x1f30*/ u32 unk1f30;
	/*0x1f34*/ u32 unk1f34;
	/*0x1f38*/ u32 unk1f38;
	/*0x1f3c*/ u32 unk1f3c;
	/*0x1f40*/ u32 unk1f40;
	/*0x1f44*/ u32 unk1f44;
	/*0x1f48*/ u32 unk1f48;
	/*0x1f4c*/ u32 unk1f4c;
	/*0x1f50*/ u32 unk1f50;
	/*0x1f54*/ u32 unk1f54;
	/*0x1f58*/ u32 unk1f58;
	/*0x1f5c*/ u32 unk1f5c;
	/*0x1f60*/ u32 unk1f60;
	/*0x1f64*/ u32 unk1f64;
	/*0x1f68*/ u32 unk1f68;
	/*0x1f6c*/ u32 unk1f6c;
	/*0x1f70*/ u32 unk1f70;
	/*0x1f74*/ u32 unk1f74;
	/*0x1f78*/ u32 unk1f78;
	/*0x1f7c*/ u32 unk1f7c;
	/*0x1f80*/ u32 unk1f80;
	/*0x1f84*/ u32 unk1f84;
	/*0x1f88*/ u32 unk1f88;
	/*0x1f8c*/ u32 unk1f8c;
	/*0x1f90*/ u32 unk1f90;
	/*0x1f94*/ u32 unk1f94;
	/*0x1f98*/ u32 unk1f98;
	/*0x1f9c*/ u32 unk1f9c;
	/*0x1fa0*/ u32 unk1fa0;
	/*0x1fa4*/ u32 unk1fa4;
	/*0x1fa8*/ u32 unk1fa8;
	/*0x1fac*/ u32 unk1fac;
	/*0x1fb0*/ u32 unk1fb0;
	/*0x1fb4*/ u32 unk1fb4;
	/*0x1fb8*/ u32 unk1fb8;
	/*0x1fbc*/ u32 unk1fbc;
	/*0x1fc0*/ u32 unk1fc0;
	/*0x1fc4*/ u32 unk1fc4;
	/*0x1fc8*/ u32 unk1fc8;
	/*0x1fcc*/ u32 unk1fcc;
	/*0x1fd0*/ u32 unk1fd0;
	/*0x1fd4*/ u32 unk1fd4;
	/*0x1fd8*/ u32 unk1fd8;
	/*0x1fdc*/ u32 unk1fdc;
	/*0x1fe0*/ u32 unk1fe0;
	/*0x1fe4*/ u32 unk1fe4;
	/*0x1fe8*/ u32 unk1fe8;
	/*0x1fec*/ u32 unk1fec;
	/*0x1ff0*/ u32 unk1ff0;
	/*0x1ff4*/ u32 unk1ff4;
	/*0x1ff8*/ u32 unk1ff8;
	/*0x1ffc*/ u32 unk1ffc;
	/*0x2000*/ u32 unk2000;
	/*0x2004*/ u32 unk2004;
	/*0x2008*/ u32 unk2008;
	/*0x200c*/ u32 unk200c;
	/*0x2010*/ u32 unk2010;
	/*0x2014*/ u32 unk2014;
	/*0x2018*/ u32 unk2018;
	/*0x201c*/ u32 unk201c;
	/*0x2020*/ u32 unk2020;
	/*0x2024*/ u32 unk2024;
	/*0x2028*/ u32 unk2028;
	/*0x202c*/ u32 unk202c;
	/*0x2030*/ u32 unk2030;
	/*0x2034*/ u32 unk2034;
	/*0x2038*/ u32 unk2038;
	/*0x203c*/ u32 unk203c;
	/*0x2040*/ u32 unk2040;
	/*0x2044*/ u32 unk2044;
	/*0x2048*/ u32 unk2048;
	/*0x204c*/ u32 unk204c;
	/*0x2050*/ u32 unk2050;
	/*0x2054*/ u32 unk2054;
	/*0x2058*/ u32 unk2058;
	/*0x205c*/ u32 unk205c;
	/*0x2060*/ u32 unk2060;
	/*0x2064*/ u32 unk2064;
	/*0x2068*/ u32 unk2068;
	/*0x206c*/ u32 unk206c;
	/*0x2070*/ u32 unk2070;
	/*0x2074*/ u32 unk2074;
	/*0x2078*/ u32 unk2078;
	/*0x207c*/ u32 unk207c;
	/*0x2080*/ u32 unk2080;
	/*0x2084*/ u32 unk2084;
	/*0x2088*/ u32 unk2088;
	/*0x208c*/ u32 unk208c;
	/*0x2090*/ u32 unk2090;
	/*0x2094*/ u32 unk2094;
	/*0x2098*/ u32 unk2098;
	/*0x209c*/ u32 unk209c;
	/*0x20a0*/ u32 unk20a0;
	/*0x20a4*/ u32 unk20a4;
	/*0x20a8*/ u32 unk20a8;
	/*0x20ac*/ u32 unk20ac;
	/*0x20b0*/ u32 unk20b0;
	/*0x20b4*/ u32 unk20b4;
	/*0x20b8*/ u32 unk20b8;
	/*0x20bc*/ u32 unk20bc;
	/*0x20c0*/ u32 unk20c0;
	/*0x20c4*/ u32 unk20c4;
	/*0x20c8*/ u32 unk20c8;
	/*0x20cc*/ u32 unk20cc;
	/*0x20d0*/ u32 unk20d0;
	/*0x20d4*/ u32 unk20d4;
	/*0x20d8*/ u32 unk20d8;
	/*0x20dc*/ u32 unk20dc;
	/*0x20e0*/ u32 unk20e0;
	/*0x20e4*/ u32 unk20e4;
	/*0x20e8*/ u32 unk20e8;
	/*0x20ec*/ u32 unk20ec;
	/*0x20f0*/ u32 unk20f0;
	/*0x20f4*/ u32 unk20f4;
	/*0x20f8*/ u32 unk20f8;
	/*0x20fc*/ u32 unk20fc;
	/*0x2100*/ u32 unk2100;
	/*0x2104*/ u32 unk2104;
	/*0x2108*/ u32 unk2108;
	/*0x210c*/ u32 unk210c;
	/*0x2110*/ u32 unk2110;
	/*0x2114*/ u32 unk2114;
	/*0x2118*/ u32 unk2118;
	/*0x211c*/ u32 unk211c;
	/*0x2120*/ u32 unk2120;
	/*0x2124*/ u32 unk2124;
	/*0x2128*/ u32 unk2128;
	/*0x212c*/ u32 unk212c;
	/*0x2130*/ u32 unk2130;
	/*0x2134*/ u32 unk2134;
	/*0x2138*/ u32 unk2138;
	/*0x213c*/ u32 unk213c;
	/*0x2140*/ u32 unk2140;
	/*0x2144*/ u32 unk2144;
	/*0x2148*/ u32 unk2148;
	/*0x214c*/ u32 unk214c;
	/*0x2150*/ u32 unk2150;
	/*0x2154*/ u32 unk2154;
	/*0x2158*/ u32 unk2158;
	/*0x215c*/ u32 unk215c;
	/*0x2160*/ u32 unk2160;
	/*0x2164*/ u32 unk2164;
	/*0x2168*/ u32 unk2168;
	/*0x216c*/ u32 unk216c;
	/*0x2170*/ u32 unk2170;
	/*0x2174*/ u32 unk2174;
	/*0x2178*/ u32 unk2178;
	/*0x217c*/ u32 unk217c;
	/*0x2180*/ u32 unk2180;
	/*0x2184*/ u32 unk2184;
	/*0x2188*/ u32 unk2188;
	/*0x218c*/ u32 unk218c;
	/*0x2190*/ u32 unk2190;
	/*0x2194*/ u32 unk2194;
	/*0x2198*/ u32 unk2198;
	/*0x219c*/ u32 unk219c;
	/*0x21a0*/ u32 unk21a0;
	/*0x21a4*/ u32 unk21a4;
	/*0x21a8*/ u32 unk21a8;
	/*0x21ac*/ u32 unk21ac;
	/*0x21b0*/ u32 unk21b0;
	/*0x21b4*/ u32 unk21b4;
	/*0x21b8*/ u32 unk21b8;
	/*0x21bc*/ u32 unk21bc;
	/*0x21c0*/ u32 unk21c0;
	/*0x21c4*/ u32 unk21c4;
	/*0x21c8*/ u32 unk21c8;
	/*0x21cc*/ u32 unk21cc;
	/*0x21d0*/ u32 unk21d0;
	/*0x21d4*/ u32 unk21d4;
	/*0x21d8*/ u32 unk21d8;
	/*0x21dc*/ u32 unk21dc;
	/*0x21e0*/ u32 unk21e0;
	/*0x21e4*/ u32 unk21e4;
	/*0x21e8*/ u32 unk21e8;
	/*0x21ec*/ u32 unk21ec;
	/*0x21f0*/ u32 unk21f0;
	/*0x21f4*/ u32 unk21f4;
	/*0x21f8*/ u32 unk21f8;
	/*0x21fc*/ u32 unk21fc;
	/*0x2200*/ u32 unk2200;
	/*0x2204*/ u32 unk2204;
	/*0x2208*/ u32 unk2208;
	/*0x220c*/ u32 unk220c;
	/*0x2210*/ u32 unk2210;
	/*0x2214*/ u32 unk2214;
	/*0x2218*/ u32 unk2218;
	/*0x221c*/ u32 unk221c;
	/*0x2220*/ u32 unk2220;
	/*0x2224*/ u32 unk2224;
	/*0x2228*/ u32 unk2228;
	/*0x222c*/ u32 unk222c;
	/*0x2230*/ u32 unk2230;
	/*0x2234*/ u32 unk2234;
	/*0x2238*/ u32 unk2238;
	/*0x223c*/ u32 unk223c;
	/*0x2240*/ u32 unk2240;
	/*0x2244*/ u32 unk2244;
	/*0x2248*/ u32 unk2248;
	/*0x224c*/ u32 unk224c;
	/*0x2250*/ u32 unk2250;
	/*0x2254*/ u32 unk2254;
	/*0x2258*/ u32 unk2258;
	/*0x225c*/ u32 unk225c;
	/*0x2260*/ u32 unk2260;
	/*0x2264*/ u32 unk2264;
	/*0x2268*/ u32 unk2268;
	/*0x226c*/ u32 unk226c;
	/*0x2270*/ u32 unk2270;
	/*0x2274*/ u32 unk2274;
	/*0x2278*/ u32 unk2278;
	/*0x227c*/ u32 unk227c;
	/*0x2280*/ u32 unk2280;
	/*0x2284*/ u32 unk2284;
	/*0x2288*/ u32 unk2288;
	/*0x228c*/ u32 unk228c;
	/*0x2290*/ u32 unk2290;
	/*0x2294*/ u32 unk2294;
	/*0x2298*/ u32 unk2298;
	/*0x229c*/ u32 unk229c;
	/*0x22a0*/ u32 unk22a0;
	/*0x22a4*/ u32 unk22a4;
	/*0x22a8*/ u32 unk22a8;
	/*0x22ac*/ u32 unk22ac;
	/*0x22b0*/ u32 unk22b0;
	/*0x22b4*/ u32 unk22b4;
	/*0x22b8*/ u32 unk22b8;
	/*0x22bc*/ u32 unk22bc;
	/*0x22c0*/ u32 unk22c0;
	/*0x22c4*/ u32 unk22c4;
	/*0x22c8*/ u32 unk22c8;
	/*0x22cc*/ u32 unk22cc;
	/*0x22d0*/ u32 unk22d0;
	/*0x22d4*/ u32 unk22d4;
	/*0x22d8*/ u32 unk22d8;
	/*0x22dc*/ u32 unk22dc;
	/*0x22e0*/ u32 unk22e0;
	/*0x22e4*/ u32 unk22e4;
	/*0x22e8*/ u32 unk22e8;
	/*0x22ec*/ u32 unk22ec;
	/*0x22f0*/ u32 unk22f0;
	/*0x22f4*/ u32 unk22f4;
	/*0x22f8*/ u32 unk22f8;
	/*0x22fc*/ u32 unk22fc;
	/*0x2300*/ u32 unk2300;
	/*0x2304*/ u32 unk2304;
	/*0x2308*/ u32 unk2308;
	/*0x230c*/ u32 unk230c;
	/*0x2310*/ u32 unk2310;
	/*0x2314*/ u32 unk2314;
	/*0x2318*/ u32 unk2318;
	/*0x231c*/ u32 unk231c;
	/*0x2320*/ u32 unk2320;
	/*0x2324*/ u32 unk2324;
	/*0x2328*/ u32 unk2328;
	/*0x232c*/ u32 unk232c;
	/*0x2330*/ u32 unk2330;
	/*0x2334*/ u32 unk2334;
	/*0x2338*/ u32 unk2338;
	/*0x233c*/ u32 unk233c;
	/*0x2340*/ u32 unk2340;
	/*0x2344*/ u32 unk2344;
	/*0x2348*/ u32 unk2348;
	/*0x234c*/ u32 unk234c;
	/*0x2350*/ u32 unk2350;
	/*0x2354*/ u32 unk2354;
	/*0x2358*/ u32 unk2358;
	/*0x235c*/ u32 unk235c;
	/*0x2360*/ u32 unk2360;
	/*0x2364*/ u32 unk2364;
	/*0x2368*/ u32 unk2368;
	/*0x236c*/ u32 unk236c;
	/*0x2370*/ u32 unk2370;
	/*0x2374*/ u32 unk2374;
	/*0x2378*/ u32 unk2378;
	/*0x237c*/ u32 unk237c;
	/*0x2380*/ u32 unk2380;
	/*0x2384*/ u32 unk2384;
	/*0x2388*/ u32 unk2388;
	/*0x238c*/ u32 unk238c;
	/*0x2390*/ u32 unk2390;
	/*0x2394*/ u32 unk2394;
	/*0x2398*/ u32 unk2398;
	/*0x239c*/ u32 unk239c;
	/*0x23a0*/ u32 unk23a0;
	/*0x23a4*/ u32 unk23a4;
	/*0x23a8*/ u32 unk23a8;
	/*0x23ac*/ u32 unk23ac;
	/*0x23b0*/ u32 unk23b0;
	/*0x23b4*/ u32 unk23b4;
	/*0x23b8*/ u32 unk23b8;
	/*0x23bc*/ u32 unk23bc;
	/*0x23c0*/ u32 unk23c0;
	/*0x23c4*/ u32 unk23c4;
	/*0x23c8*/ u32 unk23c8;
	/*0x23cc*/ u32 unk23cc;
	/*0x23d0*/ u32 unk23d0;
	/*0x23d4*/ u32 unk23d4;
	/*0x23d8*/ u32 unk23d8;
	/*0x23dc*/ u32 unk23dc;
	/*0x23e0*/ u32 unk23e0;
	/*0x23e4*/ u32 unk23e4;
	/*0x23e8*/ u32 unk23e8;
	/*0x23ec*/ u32 unk23ec;
	/*0x23f0*/ u32 unk23f0;
	/*0x23f4*/ u32 unk23f4;
	/*0x23f8*/ u32 unk23f8;
	/*0x23fc*/ u32 unk23fc;
	/*0x2400*/ u32 unk2400;
	/*0x2404*/ u32 unk2404;
	/*0x2408*/ u32 unk2408;
	/*0x240c*/ u32 unk240c;
	/*0x2410*/ u32 unk2410;
	/*0x2414*/ u32 unk2414;
	/*0x2418*/ u32 unk2418;
	/*0x241c*/ u32 unk241c;
	/*0x2420*/ u32 unk2420;
	/*0x2424*/ u32 unk2424;
	/*0x2428*/ u32 unk2428;
	/*0x242c*/ u32 unk242c;
	/*0x2430*/ u32 unk2430;
	/*0x2434*/ u32 unk2434;
	/*0x2438*/ u32 unk2438;
	/*0x243c*/ u32 unk243c;
	/*0x2440*/ u32 unk2440;
	/*0x2444*/ u32 unk2444;
	/*0x2448*/ u32 unk2448;
	/*0x244c*/ u32 unk244c;
	/*0x2450*/ u32 unk2450;
	/*0x2454*/ u32 unk2454;
	/*0x2458*/ u32 unk2458;
	/*0x245c*/ u32 unk245c;
	/*0x2460*/ u32 unk2460;
	/*0x2464*/ u32 unk2464;
	/*0x2468*/ u32 unk2468;
	/*0x246c*/ u32 unk246c;
	/*0x2470*/ u32 unk2470;
	/*0x2474*/ u32 unk2474;
	/*0x2478*/ u32 unk2478;
	/*0x247c*/ u32 unk247c;
	/*0x2480*/ u32 unk2480;
	/*0x2484*/ u32 unk2484;
	/*0x2488*/ u32 unk2488;
	/*0x248c*/ u32 unk248c;
	/*0x2490*/ u32 unk2490;
	/*0x2494*/ u32 unk2494;
	/*0x2498*/ u32 unk2498;
	/*0x249c*/ u32 unk249c;
	/*0x24a0*/ u32 unk24a0;
	/*0x24a4*/ u32 unk24a4;
	/*0x24a8*/ u32 unk24a8;
	/*0x24ac*/ u32 unk24ac;
	/*0x24b0*/ u32 unk24b0;
	/*0x24b4*/ u32 unk24b4;
	/*0x24b8*/ u32 unk24b8;
	/*0x24bc*/ u32 unk24bc;
	/*0x24c0*/ u32 unk24c0;
	/*0x24c4*/ u32 unk24c4;
	/*0x24c8*/ u32 unk24c8;
	/*0x24cc*/ u32 unk24cc;
	/*0x24d0*/ u32 unk24d0;
	/*0x24d4*/ u32 unk24d4;
	/*0x24d8*/ u32 unk24d8;
	/*0x24dc*/ u32 unk24dc;
	/*0x24e0*/ u32 unk24e0;
	/*0x24e4*/ u32 unk24e4;
	/*0x24e8*/ u32 unk24e8;
	/*0x24ec*/ u32 unk24ec;
	/*0x24f0*/ u32 unk24f0;
	/*0x24f4*/ u32 unk24f4;
	/*0x24f8*/ u32 unk24f8;
	/*0x24fc*/ u32 unk24fc;
	/*0x2500*/ u32 unk2500;
	/*0x2504*/ u32 unk2504;
	/*0x2508*/ u32 unk2508;
	/*0x250c*/ u32 unk250c;
	/*0x2510*/ u32 unk2510;
	/*0x2514*/ u32 unk2514;
	/*0x2518*/ u32 unk2518;
	/*0x251c*/ u32 unk251c;
	/*0x2520*/ u32 unk2520;
	/*0x2524*/ u32 unk2524;
	/*0x2528*/ u32 unk2528;
	/*0x252c*/ u32 unk252c;
	/*0x2530*/ u32 unk2530;
	/*0x2534*/ u32 unk2534;
	/*0x2538*/ u32 unk2538;
	/*0x253c*/ u32 unk253c;
	/*0x2540*/ u32 unk2540;
	/*0x2544*/ u32 unk2544;
	/*0x2548*/ u32 unk2548;
	/*0x254c*/ u32 unk254c;
	/*0x2550*/ u32 unk2550;
	/*0x2554*/ u32 unk2554;
	/*0x2558*/ u32 unk2558;
	/*0x255c*/ u32 unk255c;
	/*0x2560*/ u32 unk2560;
	/*0x2564*/ u32 unk2564;
	/*0x2568*/ u32 unk2568;
	/*0x256c*/ u32 unk256c;
	/*0x2570*/ u32 unk2570;
	/*0x2574*/ u32 unk2574;
	/*0x2578*/ u32 unk2578;
	/*0x257c*/ u32 unk257c;
	/*0x2580*/ u32 unk2580;
	/*0x2584*/ u32 unk2584;
	/*0x2588*/ u32 unk2588;
	/*0x258c*/ u32 unk258c;
	/*0x2590*/ u32 unk2590;
	/*0x2594*/ u32 unk2594;
	/*0x2598*/ u32 unk2598;
	/*0x259c*/ u32 unk259c;
	/*0x25a0*/ u32 unk25a0;
	/*0x25a4*/ u32 unk25a4;
	/*0x25a8*/ u32 unk25a8;
	/*0x25ac*/ u32 unk25ac;
	/*0x25b0*/ u32 unk25b0;
	/*0x25b4*/ u32 unk25b4;
	/*0x25b8*/ u32 unk25b8;
	/*0x25bc*/ u32 unk25bc;
	/*0x25c0*/ u32 unk25c0;
	/*0x25c4*/ u32 unk25c4;
	/*0x25c8*/ u32 unk25c8;
	/*0x25cc*/ u32 unk25cc;
	/*0x25d0*/ u32 unk25d0;
	/*0x25d4*/ u32 unk25d4;
	/*0x25d8*/ u32 unk25d8;
	/*0x25dc*/ u32 unk25dc;
	/*0x25e0*/ u32 unk25e0;
	/*0x25e4*/ u32 unk25e4;
	/*0x25e8*/ u32 unk25e8;
	/*0x25ec*/ u32 unk25ec;
	/*0x25f0*/ u32 unk25f0;
	/*0x25f4*/ u32 unk25f4;
	/*0x25f8*/ u32 unk25f8;
	/*0x25fc*/ u32 unk25fc;
	/*0x2600*/ u32 unk2600;
	/*0x2604*/ u32 unk2604;
	/*0x2608*/ u32 unk2608;
	/*0x260c*/ u32 unk260c;
	/*0x2610*/ u32 unk2610;
	/*0x2614*/ u32 unk2614;
	/*0x2618*/ u32 unk2618;
	/*0x261c*/ u32 unk261c;
	/*0x2620*/ u32 unk2620;
	/*0x2624*/ u32 unk2624;
	/*0x2628*/ u32 unk2628;
	/*0x262c*/ u32 unk262c;
	/*0x2630*/ u32 unk2630;
	/*0x2634*/ u32 unk2634;
	/*0x2638*/ u32 unk2638;
	/*0x263c*/ u32 unk263c;
	/*0x2640*/ u32 unk2640;
	/*0x2644*/ u32 unk2644;
	/*0x2648*/ u32 unk2648;
	/*0x264c*/ u32 unk264c;
	/*0x2650*/ u32 unk2650;
	/*0x2654*/ u32 unk2654;
	/*0x2658*/ u32 unk2658;
	/*0x265c*/ u32 unk265c;
	/*0x2660*/ u32 unk2660;
	/*0x2664*/ u32 unk2664;
	/*0x2668*/ u32 unk2668;
	/*0x266c*/ u32 unk266c;
	/*0x2670*/ u32 unk2670;
	/*0x2674*/ u32 unk2674;
	/*0x2678*/ u32 unk2678;
	/*0x267c*/ u32 unk267c;
	/*0x2680*/ u32 unk2680;
	/*0x2684*/ u32 unk2684;
	/*0x2688*/ u32 unk2688;
	/*0x268c*/ u32 unk268c;
	/*0x2690*/ u32 unk2690;
	/*0x2694*/ u32 unk2694;
	/*0x2698*/ u32 unk2698;
	/*0x269c*/ u32 unk269c;
	/*0x26a0*/ u32 unk26a0;
	/*0x26a4*/ u32 unk26a4;
	/*0x26a8*/ u32 unk26a8;
	/*0x26ac*/ u32 unk26ac;
	/*0x26b0*/ u32 unk26b0;
	/*0x26b4*/ u32 unk26b4;
	/*0x26b8*/ u32 unk26b8;
	/*0x26bc*/ u32 unk26bc;
	/*0x26c0*/ u32 unk26c0;
	/*0x26c4*/ u32 unk26c4;
	/*0x26c8*/ u32 unk26c8;
	/*0x26cc*/ u32 unk26cc;
	/*0x26d0*/ u32 unk26d0;
	/*0x26d4*/ u32 unk26d4;
	/*0x26d8*/ u32 unk26d8;
	/*0x26dc*/ u32 unk26dc;
	/*0x26e0*/ u32 unk26e0;
	/*0x26e4*/ u32 unk26e4;
	/*0x26e8*/ u32 unk26e8;
	/*0x26ec*/ u32 unk26ec;
	/*0x26f0*/ u32 unk26f0;
	/*0x26f4*/ u32 unk26f4;
	/*0x26f8*/ u32 unk26f8;
	/*0x26fc*/ u32 unk26fc;
	/*0x2700*/ u32 unk2700;
	/*0x2704*/ u32 unk2704;
	/*0x2708*/ u32 unk2708;
	/*0x270c*/ u32 unk270c;
	/*0x2710*/ u32 unk2710;
	/*0x2714*/ u32 unk2714;
	/*0x2718*/ u32 unk2718;
	/*0x271c*/ u32 unk271c;
	/*0x2720*/ u32 unk2720;
	/*0x2724*/ u32 unk2724;
	/*0x2728*/ u32 unk2728;
	/*0x272c*/ u32 unk272c;
	/*0x2730*/ u32 unk2730;
	/*0x2734*/ u32 unk2734;
	/*0x2738*/ u32 unk2738;
	/*0x273c*/ u32 unk273c;
	/*0x2740*/ u32 unk2740;
	/*0x2744*/ u32 unk2744;
	/*0x2748*/ u32 unk2748;
	/*0x274c*/ u32 unk274c;
	/*0x2750*/ u32 unk2750;
	/*0x2754*/ u32 unk2754;
	/*0x2758*/ u32 unk2758;
	/*0x275c*/ u32 unk275c;
	/*0x2760*/ u32 unk2760;
	/*0x2764*/ u32 unk2764;
	/*0x2768*/ u32 unk2768;
	/*0x276c*/ u32 unk276c;
	/*0x2770*/ u32 unk2770;
	/*0x2774*/ u32 unk2774;
	/*0x2778*/ u32 unk2778;
	/*0x277c*/ u32 unk277c;
	/*0x2780*/ u32 unk2780;
	/*0x2784*/ u32 unk2784;
	/*0x2788*/ u32 unk2788;
	/*0x278c*/ u32 unk278c;
	/*0x2790*/ u32 unk2790;
	/*0x2794*/ u32 unk2794;
	/*0x2798*/ u32 unk2798;
	/*0x279c*/ u32 unk279c;
	/*0x27a0*/ u32 unk27a0;
	/*0x27a4*/ u32 unk27a4;
	/*0x27a8*/ u32 unk27a8;
	/*0x27ac*/ u32 unk27ac;
	/*0x27b0*/ u32 unk27b0;
	/*0x27b4*/ u32 unk27b4;
	/*0x27b8*/ u32 unk27b8;
	/*0x27bc*/ u32 unk27bc;
	/*0x27c0*/ u32 unk27c0;
	/*0x27c4*/ u32 unk27c4;
	/*0x27c8*/ u32 unk27c8;
	/*0x27cc*/ u32 unk27cc;
	/*0x27d0*/ u32 unk27d0;
	/*0x27d4*/ u32 unk27d4;
	/*0x27d8*/ u32 unk27d8;
	/*0x27dc*/ u32 unk27dc;
	/*0x27e0*/ u32 unk27e0;
	/*0x27e4*/ u32 unk27e4;
	/*0x27e8*/ u32 unk27e8;
	/*0x27ec*/ u32 unk27ec;
	/*0x27f0*/ u32 unk27f0;
	/*0x27f4*/ u32 unk27f4;
	/*0x27f8*/ u32 unk27f8;
	/*0x27fc*/ u32 unk27fc;
	/*0x2800*/ u32 unk2800;
	/*0x2804*/ u32 unk2804;
	/*0x2808*/ u32 unk2808;
	/*0x280c*/ u32 unk280c;
	/*0x2810*/ u32 unk2810;
	/*0x2814*/ u32 unk2814;
	/*0x2818*/ u32 unk2818;
	/*0x281c*/ u32 unk281c;
	/*0x2820*/ u32 unk2820;
	/*0x2824*/ u32 unk2824;
	/*0x2828*/ u32 unk2828;
	/*0x282c*/ u32 unk282c;
	/*0x2830*/ u32 unk2830;
	/*0x2834*/ u32 unk2834;
	/*0x2838*/ u32 unk2838;
	/*0x283c*/ u32 unk283c;
	/*0x2840*/ u32 unk2840;
	/*0x2844*/ u32 unk2844;
	/*0x2848*/ u32 unk2848;
	/*0x284c*/ u32 unk284c;
	/*0x2850*/ u32 unk2850;
	/*0x2854*/ u32 unk2854;
	/*0x2858*/ u32 unk2858;
	/*0x285c*/ u32 unk285c;
	/*0x2860*/ u32 unk2860;
	/*0x2864*/ u32 unk2864;
	/*0x2868*/ u32 unk2868;
	/*0x286c*/ u32 unk286c;
	/*0x2870*/ u32 unk2870;
	/*0x2874*/ u32 unk2874;
	/*0x2878*/ u32 unk2878;
	/*0x287c*/ u32 unk287c;
	/*0x2880*/ u32 unk2880;
	/*0x2884*/ u32 unk2884;
	/*0x2888*/ u32 unk2888;
	/*0x288c*/ u32 unk288c;
	/*0x2890*/ u32 unk2890;
	/*0x2894*/ u32 unk2894;
	/*0x2898*/ u32 unk2898;
	/*0x289c*/ u32 unk289c;
	/*0x28a0*/ u32 unk28a0;
	/*0x28a4*/ u32 unk28a4;
	/*0x28a8*/ u32 unk28a8;
	/*0x28ac*/ u32 unk28ac;
	/*0x28b0*/ u32 unk28b0;
	/*0x28b4*/ u32 unk28b4;
	/*0x28b8*/ u32 unk28b8;
	/*0x28bc*/ u32 unk28bc;
	/*0x28c0*/ u32 unk28c0;
	/*0x28c4*/ u32 unk28c4;
	/*0x28c8*/ u32 unk28c8;
	/*0x28cc*/ u32 unk28cc;
	/*0x28d0*/ u32 unk28d0;
	/*0x28d4*/ u32 unk28d4;
	/*0x28d8*/ u32 unk28d8;
	/*0x28dc*/ u32 unk28dc;
	/*0x28e0*/ u32 unk28e0;
	/*0x28e4*/ u32 unk28e4;
	/*0x28e8*/ u32 unk28e8;
	/*0x28ec*/ u32 unk28ec;
	/*0x28f0*/ u32 unk28f0;
	/*0x28f4*/ u32 unk28f4;
	/*0x28f8*/ u32 unk28f8;
	/*0x28fc*/ u32 unk28fc;
	/*0x2900*/ u32 unk2900;
	/*0x2904*/ u32 unk2904;
	/*0x2908*/ u32 unk2908;
	/*0x290c*/ u32 unk290c;
	/*0x2910*/ u32 unk2910;
	/*0x2914*/ u32 unk2914;
	/*0x2918*/ u32 unk2918;
	/*0x291c*/ u32 unk291c;
	/*0x2920*/ u32 unk2920;
	/*0x2924*/ u32 unk2924;
	/*0x2928*/ u32 unk2928;
	/*0x292c*/ u32 unk292c;
	/*0x2930*/ u32 unk2930;
	/*0x2934*/ u32 unk2934;
	/*0x2938*/ u32 unk2938;
	/*0x293c*/ u32 unk293c;
	/*0x2940*/ u32 unk2940;
	/*0x2944*/ u32 unk2944;
	/*0x2948*/ u32 unk2948;
	/*0x294c*/ u32 unk294c;
	/*0x2950*/ u32 unk2950;
	/*0x2954*/ u32 unk2954;
	/*0x2958*/ u32 unk2958;
	/*0x295c*/ u32 unk295c;
	/*0x2960*/ u32 unk2960;
	/*0x2964*/ u32 unk2964;
	/*0x2968*/ u32 unk2968;
	/*0x296c*/ u32 unk296c;
	/*0x2970*/ u32 unk2970;
	/*0x2974*/ u32 unk2974;
	/*0x2978*/ u32 unk2978;
	/*0x297c*/ u32 unk297c;
	/*0x2980*/ u32 unk2980;
	/*0x2984*/ u32 unk2984;
	/*0x2988*/ u32 unk2988;
	/*0x298c*/ u32 unk298c;
	/*0x2990*/ u32 unk2990;
	/*0x2994*/ u32 unk2994;
	/*0x2998*/ u32 unk2998;
	/*0x299c*/ u32 unk299c;
	/*0x29a0*/ u32 unk29a0;
	/*0x29a4*/ u32 unk29a4;
	/*0x29a8*/ u32 unk29a8;
	/*0x29ac*/ u32 unk29ac;
	/*0x29b0*/ u32 unk29b0;
	/*0x29b4*/ u32 unk29b4;
	/*0x29b8*/ u32 unk29b8;
	/*0x29bc*/ u32 unk29bc;
	/*0x29c0*/ u32 unk29c0;
	/*0x29c4*/ u32 unk29c4;
	/*0x29c8*/ u32 unk29c8;
	/*0x29cc*/ u32 unk29cc;
	/*0x29d0*/ u32 unk29d0;
	/*0x29d4*/ u32 unk29d4;
	/*0x29d8*/ u32 unk29d8;
	/*0x29dc*/ u32 unk29dc;
	/*0x29e0*/ u32 unk29e0;
	/*0x29e4*/ u32 unk29e4;
	/*0x29e8*/ u32 unk29e8;
	/*0x29ec*/ u32 unk29ec;
	/*0x29f0*/ u32 unk29f0;
	/*0x29f4*/ u32 unk29f4;
	/*0x29f8*/ u32 unk29f8;
	/*0x29fc*/ u32 unk29fc;
	/*0x2a00*/ u32 unk2a00;
	/*0x2a04*/ u32 unk2a04;
	/*0x2a08*/ u32 unk2a08;
	/*0x2a0c*/ u32 unk2a0c;
	/*0x2a10*/ u32 unk2a10;
	/*0x2a14*/ u32 unk2a14;
	/*0x2a18*/ u32 unk2a18;
	/*0x2a1c*/ u32 unk2a1c;
	/*0x2a20*/ u32 unk2a20;
	/*0x2a24*/ u32 unk2a24;
	/*0x2a28*/ u32 unk2a28;
	/*0x2a2c*/ u32 unk2a2c;
	/*0x2a30*/ u32 unk2a30;
	/*0x2a34*/ u32 unk2a34;
	/*0x2a38*/ u32 unk2a38;
	/*0x2a3c*/ u32 unk2a3c;
	/*0x2a40*/ u32 unk2a40;
	/*0x2a44*/ u32 unk2a44;
	/*0x2a48*/ u32 unk2a48;
	/*0x2a4c*/ u32 unk2a4c;
	/*0x2a50*/ u32 unk2a50;
	/*0x2a54*/ u32 unk2a54;
	/*0x2a58*/ u32 unk2a58;
	/*0x2a5c*/ u32 unk2a5c;
	/*0x2a60*/ u32 unk2a60;
	/*0x2a64*/ u32 unk2a64;
	/*0x2a68*/ u32 unk2a68;
	/*0x2a6c*/ u32 unk2a6c;
	/*0x2a70*/ u32 unk2a70;
	/*0x2a74*/ u32 unk2a74;
	/*0x2a78*/ u32 unk2a78;
	/*0x2a7c*/ u32 unk2a7c;
	/*0x2a80*/ u32 unk2a80;
	/*0x2a84*/ u32 unk2a84;
	/*0x2a88*/ u32 unk2a88;
	/*0x2a8c*/ u32 unk2a8c;
	/*0x2a90*/ u32 unk2a90;
	/*0x2a94*/ u32 unk2a94;
	/*0x2a98*/ u32 unk2a98;
	/*0x2a9c*/ u32 unk2a9c;
	/*0x2aa0*/ u32 unk2aa0;
	/*0x2aa4*/ u32 unk2aa4;
	/*0x2aa8*/ u32 unk2aa8;
	/*0x2aac*/ u32 unk2aac;
	/*0x2ab0*/ u32 unk2ab0;
	/*0x2ab4*/ u32 unk2ab4;
	/*0x2ab8*/ u32 unk2ab8;
	/*0x2abc*/ u32 unk2abc;
	/*0x2ac0*/ u32 unk2ac0;
	/*0x2ac4*/ u32 unk2ac4;
	/*0x2ac8*/ u32 unk2ac8;
	/*0x2acc*/ u32 unk2acc;
	/*0x2ad0*/ u32 unk2ad0;
	/*0x2ad4*/ u32 unk2ad4;
	/*0x2ad8*/ u32 unk2ad8;
	/*0x2adc*/ u32 unk2adc;
	/*0x2ae0*/ u32 unk2ae0;
	/*0x2ae4*/ u32 unk2ae4;
	/*0x2ae8*/ u32 unk2ae8;
	/*0x2aec*/ u32 unk2aec;
	/*0x2af0*/ u32 unk2af0;
	/*0x2af4*/ u32 unk2af4;
	/*0x2af8*/ u32 unk2af8;
	/*0x2afc*/ u32 unk2afc;
	/*0x2b00*/ u32 unk2b00;
	/*0x2b04*/ u32 unk2b04;
	/*0x2b08*/ u32 unk2b08;
	/*0x2b0c*/ u32 unk2b0c;
	/*0x2b10*/ u32 unk2b10;
	/*0x2b14*/ u32 unk2b14;
	/*0x2b18*/ u32 unk2b18;
	/*0x2b1c*/ u32 unk2b1c;
	/*0x2b20*/ u32 unk2b20;
	/*0x2b24*/ u32 unk2b24;
	/*0x2b28*/ u32 unk2b28;
	/*0x2b2c*/ u32 unk2b2c;
	/*0x2b30*/ u32 unk2b30;
	/*0x2b34*/ u32 unk2b34;
	/*0x2b38*/ u32 unk2b38;
	/*0x2b3c*/ u32 unk2b3c;
	/*0x2b40*/ u32 unk2b40;
	/*0x2b44*/ u32 unk2b44;
	/*0x2b48*/ u32 unk2b48;
	/*0x2b4c*/ u32 unk2b4c;
	/*0x2b50*/ u32 unk2b50;
	/*0x2b54*/ u32 unk2b54;
	/*0x2b58*/ u32 unk2b58;
	/*0x2b5c*/ u32 unk2b5c;
	/*0x2b60*/ u32 unk2b60;
	/*0x2b64*/ u32 unk2b64;
	/*0x2b68*/ u32 unk2b68;
	/*0x2b6c*/ u32 unk2b6c;
	/*0x2b70*/ u32 unk2b70;
	/*0x2b74*/ u32 unk2b74;
	/*0x2b78*/ u32 unk2b78;
	/*0x2b7c*/ u32 unk2b7c;
	/*0x2b80*/ u32 unk2b80;
	/*0x2b84*/ u32 unk2b84;
	/*0x2b88*/ u32 unk2b88;
	/*0x2b8c*/ u32 unk2b8c;
	/*0x2b90*/ u32 unk2b90;
	/*0x2b94*/ u32 unk2b94;
	/*0x2b98*/ u32 unk2b98;
	/*0x2b9c*/ u32 unk2b9c;
	/*0x2ba0*/ u32 unk2ba0;
	/*0x2ba4*/ u32 unk2ba4;
	/*0x2ba8*/ u32 unk2ba8;
	/*0x2bac*/ u32 unk2bac;
	/*0x2bb0*/ u32 unk2bb0;
	/*0x2bb4*/ u32 unk2bb4;
	/*0x2bb8*/ u32 unk2bb8;
	/*0x2bbc*/ u32 unk2bbc;
	/*0x2bc0*/ u32 unk2bc0;
	/*0x2bc4*/ u32 unk2bc4;
	/*0x2bc8*/ u32 unk2bc8;
	/*0x2bcc*/ u32 unk2bcc;
	/*0x2bd0*/ u32 unk2bd0;
	/*0x2bd4*/ u32 unk2bd4;
	/*0x2bd8*/ u32 unk2bd8;
	/*0x2bdc*/ u32 unk2bdc;
	/*0x2be0*/ u32 unk2be0;
	/*0x2be4*/ u32 unk2be4;
	/*0x2be8*/ u32 unk2be8;
	/*0x2bec*/ u32 unk2bec;
	/*0x2bf0*/ u32 unk2bf0;
	/*0x2bf4*/ u32 unk2bf4;
	/*0x2bf8*/ u32 unk2bf8;
	/*0x2bfc*/ u32 unk2bfc;
	/*0x2c00*/ u32 unk2c00;
	/*0x2c04*/ u32 unk2c04;
	/*0x2c08*/ u32 unk2c08;
	/*0x2c0c*/ u32 unk2c0c;
	/*0x2c10*/ u32 unk2c10;
	/*0x2c14*/ u32 unk2c14;
	/*0x2c18*/ u32 unk2c18;
	/*0x2c1c*/ u32 unk2c1c;
	/*0x2c20*/ u32 unk2c20;
	/*0x2c24*/ u32 unk2c24;
	/*0x2c28*/ u32 unk2c28;
	/*0x2c2c*/ u32 unk2c2c;
	/*0x2c30*/ u32 unk2c30;
	/*0x2c34*/ u32 unk2c34;
	/*0x2c38*/ u32 unk2c38;
	/*0x2c3c*/ u32 unk2c3c;
	/*0x2c40*/ u32 unk2c40;
	/*0x2c44*/ u32 unk2c44;
	/*0x2c48*/ u32 unk2c48;
	/*0x2c4c*/ u32 unk2c4c;
	/*0x2c50*/ u32 unk2c50;
	/*0x2c54*/ u32 unk2c54;
	/*0x2c58*/ u32 unk2c58;
	/*0x2c5c*/ u32 unk2c5c;
	/*0x2c60*/ u32 unk2c60;
	/*0x2c64*/ u32 unk2c64;
	/*0x2c68*/ u32 unk2c68;
	/*0x2c6c*/ u32 unk2c6c;
	/*0x2c70*/ u32 unk2c70;
	/*0x2c74*/ u32 unk2c74;
	/*0x2c78*/ u32 unk2c78;
	/*0x2c7c*/ u32 unk2c7c;
	/*0x2c80*/ u32 unk2c80;
	/*0x2c84*/ u32 unk2c84;
	/*0x2c88*/ u32 unk2c88;
	/*0x2c8c*/ u32 unk2c8c;
	/*0x2c90*/ u32 unk2c90;
	/*0x2c94*/ u32 unk2c94;
	/*0x2c98*/ u32 unk2c98;
	/*0x2c9c*/ u32 unk2c9c;
	/*0x2ca0*/ u32 unk2ca0;
	/*0x2ca4*/ u32 unk2ca4;
	/*0x2ca8*/ u32 unk2ca8;
	/*0x2cac*/ u32 unk2cac;
	/*0x2cb0*/ u32 unk2cb0;
	/*0x2cb4*/ u32 unk2cb4;
	/*0x2cb8*/ u32 unk2cb8;
	/*0x2cbc*/ u32 unk2cbc;
	/*0x2cc0*/ u32 unk2cc0;
	/*0x2cc4*/ u32 unk2cc4;
	/*0x2cc8*/ u32 unk2cc8;
	/*0x2ccc*/ u32 unk2ccc;
	/*0x2cd0*/ u32 unk2cd0;
	/*0x2cd4*/ u32 unk2cd4;
	/*0x2cd8*/ u32 unk2cd8;
	/*0x2cdc*/ u32 unk2cdc;
	/*0x2ce0*/ u32 unk2ce0;
	/*0x2ce4*/ u32 unk2ce4;
	/*0x2ce8*/ u32 unk2ce8;
	/*0x2cec*/ u32 unk2cec;
	/*0x2cf0*/ u32 unk2cf0;
	/*0x2cf4*/ u32 unk2cf4;
	/*0x2cf8*/ u32 unk2cf8;
	/*0x2cfc*/ u32 unk2cfc;
	/*0x2d00*/ u32 unk2d00;
	/*0x2d04*/ u32 unk2d04;
	/*0x2d08*/ u32 unk2d08;
	/*0x2d0c*/ u32 unk2d0c;
	/*0x2d10*/ u32 unk2d10;
	/*0x2d14*/ u32 unk2d14;
	/*0x2d18*/ u32 unk2d18;
	/*0x2d1c*/ u32 unk2d1c;
	/*0x2d20*/ u32 unk2d20;
	/*0x2d24*/ u32 unk2d24;
	/*0x2d28*/ u32 unk2d28;
	/*0x2d2c*/ u32 unk2d2c;
	/*0x2d30*/ u32 unk2d30;
	/*0x2d34*/ u32 unk2d34;
	/*0x2d38*/ u32 unk2d38;
	/*0x2d3c*/ u32 unk2d3c;
	/*0x2d40*/ u32 unk2d40;
	/*0x2d44*/ u32 unk2d44;
	/*0x2d48*/ u32 unk2d48;
	/*0x2d4c*/ u32 unk2d4c;
	/*0x2d50*/ u32 unk2d50;
	/*0x2d54*/ u32 unk2d54;
	/*0x2d58*/ u32 unk2d58;
	/*0x2d5c*/ u32 unk2d5c;
	/*0x2d60*/ u32 unk2d60;
	/*0x2d64*/ u32 unk2d64;
	/*0x2d68*/ u32 unk2d68;
	/*0x2d6c*/ u32 unk2d6c;
	/*0x2d70*/ u32 unk2d70;
	/*0x2d74*/ u32 unk2d74;
	/*0x2d78*/ u32 unk2d78;
	/*0x2d7c*/ u32 unk2d7c;
	/*0x2d80*/ u32 unk2d80;
	/*0x2d84*/ u32 unk2d84;
	/*0x2d88*/ u32 unk2d88;
	/*0x2d8c*/ u32 unk2d8c;
	/*0x2d90*/ u32 unk2d90;
	/*0x2d94*/ u32 unk2d94;
	/*0x2d98*/ u32 unk2d98;
	/*0x2d9c*/ u32 unk2d9c;
	/*0x2da0*/ u32 unk2da0;
	/*0x2da4*/ u32 unk2da4;
	/*0x2da8*/ u32 unk2da8;
	/*0x2dac*/ u32 unk2dac;
	/*0x2db0*/ u32 unk2db0;
	/*0x2db4*/ u32 unk2db4;
	/*0x2db8*/ u32 unk2db8;
	/*0x2dbc*/ u32 unk2dbc;
	/*0x2dc0*/ u32 unk2dc0;
	/*0x2dc4*/ u32 unk2dc4;
	/*0x2dc8*/ u32 unk2dc8;
	/*0x2dcc*/ u32 unk2dcc;
	/*0x2dd0*/ u32 unk2dd0;
	/*0x2dd4*/ u32 unk2dd4;
	/*0x2dd8*/ u32 unk2dd8;
	/*0x2ddc*/ u32 unk2ddc;
	/*0x2de0*/ u32 unk2de0;
	/*0x2de4*/ u32 unk2de4;
	/*0x2de8*/ u32 unk2de8;
	/*0x2dec*/ u32 unk2dec;
	/*0x2df0*/ u32 unk2df0;
	/*0x2df4*/ u32 unk2df4;
	/*0x2df8*/ u32 unk2df8;
	/*0x2dfc*/ u32 unk2dfc;
	/*0x2e00*/ u32 unk2e00;
	/*0x2e04*/ u32 unk2e04;
	/*0x2e08*/ u32 unk2e08;
	/*0x2e0c*/ u32 unk2e0c;
	/*0x2e10*/ u32 unk2e10;
	/*0x2e14*/ u32 unk2e14;
	/*0x2e18*/ u32 unk2e18;
	/*0x2e1c*/ u32 unk2e1c;
	/*0x2e20*/ u32 unk2e20;
	/*0x2e24*/ u32 unk2e24;
	/*0x2e28*/ u32 unk2e28;
	/*0x2e2c*/ u32 unk2e2c;
	/*0x2e30*/ u32 unk2e30;
	/*0x2e34*/ u32 unk2e34;
	/*0x2e38*/ u32 unk2e38;
	/*0x2e3c*/ u32 unk2e3c;
	/*0x2e40*/ u32 unk2e40;
	/*0x2e44*/ u32 unk2e44;
	/*0x2e48*/ u32 unk2e48;
	/*0x2e4c*/ u32 unk2e4c;
	/*0x2e50*/ u32 unk2e50;
	/*0x2e54*/ u32 unk2e54;
	/*0x2e58*/ u32 unk2e58;
	/*0x2e5c*/ u32 unk2e5c;
	/*0x2e60*/ u32 unk2e60;
	/*0x2e64*/ u32 unk2e64;
	/*0x2e68*/ u32 unk2e68;
	/*0x2e6c*/ u32 unk2e6c;
	/*0x2e70*/ u32 unk2e70;
	/*0x2e74*/ u32 unk2e74;
	/*0x2e78*/ u32 unk2e78;
	/*0x2e7c*/ u32 unk2e7c;
	/*0x2e80*/ u32 unk2e80;
	/*0x2e84*/ u32 unk2e84;
	/*0x2e88*/ u32 unk2e88;
	/*0x2e8c*/ u32 unk2e8c;
	/*0x2e90*/ u32 unk2e90;
	/*0x2e94*/ u32 unk2e94;
	/*0x2e98*/ u32 unk2e98;
	/*0x2e9c*/ u32 unk2e9c;
	/*0x2ea0*/ u32 unk2ea0;
	/*0x2ea4*/ u32 unk2ea4;
	/*0x2ea8*/ u32 unk2ea8;
	/*0x2eac*/ u32 unk2eac;
	/*0x2eb0*/ u32 unk2eb0;
	/*0x2eb4*/ u32 unk2eb4;
	/*0x2eb8*/ u32 unk2eb8;
	/*0x2ebc*/ u32 unk2ebc;
	/*0x2ec0*/ u32 unk2ec0;
	/*0x2ec4*/ u32 unk2ec4;
	/*0x2ec8*/ u32 unk2ec8;
	/*0x2ecc*/ u32 unk2ecc;
	/*0x2ed0*/ u32 unk2ed0;
	/*0x2ed4*/ u32 unk2ed4;
	/*0x2ed8*/ u32 unk2ed8;
	/*0x2edc*/ u32 unk2edc;
	/*0x2ee0*/ u32 unk2ee0;
	/*0x2ee4*/ u32 unk2ee4;
	/*0x2ee8*/ u32 unk2ee8;
	/*0x2eec*/ u8 unk2eec;
	/*0x2eed*/ u8 unk2eed;
	/*0x2eee*/ u8 unk2eee;
	/*0x2eef*/ u8 unk2eef;
	/*0x2ef0*/ u8 unk2ef0;
	/*0x2ef4*/ u32 unk2ef4;
	/*0x2ef8*/ u32 unk2ef8;
	/*0x2efc*/ u32 unk2efc;
	/*0x2f00*/ u32 unk2f00;
	/*0x2f04*/ u32 unk2f04;
	/*0x2f08*/ u32 unk2f08;
	/*0x2f0c*/ u32 unk2f0c;
	/*0x2f10*/ u32 unk2f10;
	/*0x2f14*/ u32 unk2f14;
	/*0x2f18*/ u32 unk2f18;
	/*0x2f1c*/ u32 unk2f1c;
	/*0x2f20*/ u32 unk2f20;
	/*0x2f24*/ u32 unk2f24;
	/*0x2f28*/ u32 unk2f28;
	/*0x2f2c*/ u32 unk2f2c;
	/*0x2f30*/ u32 unk2f30;
	/*0x2f34*/ u32 unk2f34;
	/*0x2f38*/ u32 unk2f38;
	/*0x2f3c*/ u32 unk2f3c;
	/*0x2f40*/ u32 unk2f40;
	/*0x2f44*/ u32 unk2f44;
	/*0x2f48*/ u32 unk2f48;
	/*0x2f4c*/ u32 unk2f4c;
	/*0x2f50*/ u32 unk2f50;
	/*0x2f54*/ u32 unk2f54;
	/*0x2f58*/ u32 unk2f58;
	/*0x2f5c*/ u32 unk2f5c;
	/*0x2f60*/ u32 unk2f60;
	/*0x2f64*/ u32 unk2f64;
	/*0x2f68*/ u32 unk2f68;
	/*0x2f6c*/ u32 unk2f6c;
	/*0x2f70*/ u32 unk2f70;
	/*0x2f74*/ u32 unk2f74;
	/*0x2f78*/ u32 unk2f78;
	/*0x2f7c*/ u32 unk2f7c;
	/*0x2f80*/ u32 unk2f80;
	/*0x2f84*/ u32 unk2f84;
	/*0x2f88*/ u32 unk2f88;
	/*0x2f8c*/ u32 unk2f8c;
	/*0x2f90*/ u32 unk2f90;
	/*0x2f94*/ u32 unk2f94;
	/*0x2f98*/ u32 unk2f98;
	/*0x2f9c*/ u32 unk2f9c;
	/*0x2fa0*/ u32 unk2fa0;
	/*0x2fa4*/ u32 unk2fa4;
	/*0x2fa8*/ u32 unk2fa8;
	/*0x2fac*/ u32 unk2fac;
	/*0x2fb0*/ u32 unk2fb0;
	/*0x2fb4*/ u32 unk2fb4;
	/*0x2fb8*/ u32 unk2fb8;
	/*0x2fbc*/ u32 unk2fbc;
	/*0x2fc0*/ u32 unk2fc0;
	/*0x2fc4*/ u32 unk2fc4;
	/*0x2fc8*/ u32 unk2fc8;
	/*0x2fcc*/ u32 unk2fcc;
	/*0x2fd0*/ u32 unk2fd0;
	/*0x2fd4*/ u32 unk2fd4;
	/*0x2fd8*/ u32 unk2fd8;
	/*0x2fdc*/ u32 unk2fdc;
	/*0x2fe0*/ u32 unk2fe0;
	/*0x2fe4*/ u32 unk2fe4;
	/*0x2fe8*/ u32 unk2fe8;
	/*0x2fec*/ u32 unk2fec;
	/*0x2ff0*/ u32 unk2ff0;
	/*0x2ff4*/ u32 unk2ff4;
	/*0x2ff8*/ u32 unk2ff8;
	/*0x2ffc*/ u32 unk2ffc;
	/*0x3000*/ u32 unk3000;
	/*0x3004*/ u32 unk3004;
	/*0x3008*/ u32 unk3008;
	/*0x300c*/ u32 unk300c;
	/*0x3010*/ u32 unk3010;
	/*0x3014*/ u32 unk3014;
	/*0x3018*/ u32 unk3018;
	/*0x301c*/ u32 unk301c;
	/*0x3020*/ u32 unk3020;
	/*0x3024*/ u32 unk3024;
	/*0x3028*/ u32 unk3028;
	/*0x302c*/ u32 unk302c;
	/*0x3030*/ u32 unk3030;
	/*0x3034*/ u32 unk3034;
	/*0x3038*/ u32 unk3038;
	/*0x303c*/ u32 unk303c;
	/*0x3040*/ u32 unk3040;
	/*0x3044*/ u32 unk3044;
	/*0x3048*/ u32 unk3048;
	/*0x304c*/ u32 unk304c;
	/*0x3050*/ u32 unk3050;
	/*0x3054*/ u32 unk3054;
	/*0x3058*/ u32 unk3058;
	/*0x305c*/ u32 unk305c;
	/*0x3060*/ u32 unk3060;
	/*0x3064*/ u32 unk3064;
	/*0x3068*/ u32 unk3068;
	/*0x306c*/ u32 unk306c;
	/*0x3070*/ u32 unk3070;
	/*0x3074*/ u32 unk3074;
	/*0x3078*/ u32 unk3078;
	/*0x307c*/ u32 unk307c;
	/*0x3080*/ u32 unk3080;
	/*0x3084*/ u32 unk3084;
	/*0x3088*/ u32 unk3088;
	/*0x308c*/ u32 unk308c;
	/*0x3090*/ u32 unk3090;
	/*0x3094*/ u32 unk3094;
	/*0x3098*/ u32 unk3098;
	/*0x309c*/ u32 unk309c;
	/*0x30a0*/ u32 unk30a0;
	/*0x30a4*/ u32 unk30a4;
	/*0x30a8*/ u32 unk30a8;
	/*0x30ac*/ u32 unk30ac;
	/*0x30b0*/ u32 unk30b0;
	/*0x30b4*/ u32 unk30b4;
	/*0x30b8*/ u32 unk30b8;
	/*0x30bc*/ u32 unk30bc;
	/*0x30c0*/ u32 unk30c0;
	/*0x30c4*/ u32 unk30c4;
	/*0x30c8*/ u32 unk30c8;
	/*0x30cc*/ u32 unk30cc;
	/*0x30d0*/ u32 unk30d0;
	/*0x30d4*/ u32 unk30d4;
	/*0x30d8*/ u32 unk30d8;
	/*0x30dc*/ u32 unk30dc;
	/*0x30e0*/ u32 unk30e0;
	/*0x30e4*/ u32 unk30e4;
	/*0x30e8*/ u32 unk30e8;
	/*0x30ec*/ u32 unk30ec;
	/*0x30f0*/ u32 unk30f0;
	/*0x30f4*/ u32 unk30f4;
	/*0x30f8*/ u32 unk30f8;
	/*0x30fc*/ u32 unk30fc;
	/*0x3100*/ u32 unk3100;
	/*0x3104*/ u32 unk3104;
	/*0x3108*/ u32 unk3108;
	/*0x310c*/ u32 unk310c;
	/*0x3110*/ u32 unk3110;
	/*0x3114*/ u32 unk3114;
	/*0x3118*/ u32 unk3118;
	/*0x311c*/ u32 unk311c;
	/*0x3120*/ u32 unk3120;
	/*0x3124*/ u32 unk3124;
	/*0x3128*/ u32 unk3128;
	/*0x312c*/ u32 unk312c;
	/*0x3130*/ u32 unk3130;
	/*0x3134*/ u32 unk3134;
	/*0x3138*/ u32 unk3138;
	/*0x313c*/ u32 unk313c;
	/*0x3140*/ u32 unk3140;
	/*0x3144*/ u32 unk3144;
	/*0x3148*/ u32 unk3148;
	/*0x314c*/ u32 unk314c;
	/*0x3150*/ u32 unk3150;
	/*0x3154*/ u32 unk3154;
	/*0x3158*/ u32 unk3158;
	/*0x315c*/ u32 unk315c;
	/*0x3160*/ u32 unk3160;
	/*0x3164*/ u32 unk3164;
	/*0x3168*/ u32 unk3168;
	/*0x316c*/ u32 unk316c;
	/*0x3170*/ u32 unk3170;
	/*0x3174*/ u32 unk3174;
	/*0x3178*/ u32 unk3178;
	/*0x317c*/ u32 unk317c;
	/*0x3180*/ u32 unk3180;
	/*0x3184*/ u32 unk3184;
	/*0x3188*/ u32 unk3188;
	/*0x318c*/ u32 unk318c;
	/*0x3190*/ u32 unk3190;
	/*0x3194*/ u32 unk3194;
	/*0x3198*/ u32 unk3198;
	/*0x319c*/ u32 unk319c;
	/*0x31a0*/ u32 unk31a0;
	/*0x31a4*/ u32 unk31a4;
	/*0x31a8*/ u32 unk31a8;
	/*0x31ac*/ u32 unk31ac;
	/*0x31b0*/ u32 unk31b0;
	/*0x31b4*/ u32 unk31b4;
	/*0x31b8*/ u32 unk31b8;
	/*0x31bc*/ u32 unk31bc;
	/*0x31c0*/ u32 unk31c0;
	/*0x31c4*/ u32 unk31c4;
	/*0x31c8*/ u32 unk31c8;
	/*0x31cc*/ u32 unk31cc;
	/*0x31d0*/ u32 unk31d0;
	/*0x31d4*/ u32 unk31d4;
	/*0x31d8*/ u32 unk31d8;
	/*0x31dc*/ u32 unk31dc;
	/*0x31e0*/ u32 unk31e0;
	/*0x31e4*/ u32 unk31e4;
	/*0x31e8*/ u32 unk31e8;
	/*0x31ec*/ u32 unk31ec;
	/*0x31f0*/ u32 unk31f0;
	/*0x31f4*/ u32 unk31f4;
	/*0x31f8*/ u32 unk31f8;
	/*0x31fc*/ u32 unk31fc;
	/*0x3200*/ u32 unk3200;
	/*0x3204*/ u32 unk3204;
	/*0x3208*/ u32 unk3208;
	/*0x320c*/ u32 unk320c;
	/*0x3210*/ u32 unk3210;
	/*0x3214*/ u32 unk3214;
	/*0x3218*/ u32 unk3218;
	/*0x321c*/ u32 unk321c;
	/*0x3220*/ u32 unk3220;
	/*0x3224*/ u32 unk3224;
	/*0x3228*/ u32 unk3228;
	/*0x322c*/ u32 unk322c;
	/*0x3230*/ u32 unk3230;
	/*0x3234*/ u32 unk3234;
	/*0x3238*/ u32 unk3238;
	/*0x323c*/ u32 unk323c;
	/*0x3240*/ u32 unk3240;
	/*0x3244*/ u32 unk3244;
	/*0x3248*/ u32 unk3248;
	/*0x324c*/ u32 unk324c;
	/*0x3250*/ u32 unk3250;
	/*0x3254*/ u32 unk3254;
	/*0x3258*/ u32 unk3258;
	/*0x325c*/ u32 unk325c;
	/*0x3260*/ u32 unk3260;
	/*0x3264*/ u32 unk3264;
	/*0x3268*/ u32 unk3268;
	/*0x326c*/ u32 unk326c;
	/*0x3270*/ u32 unk3270;
	/*0x3274*/ u32 unk3274;
	/*0x3278*/ u32 unk3278;
	/*0x327c*/ u32 unk327c;
	/*0x3280*/ u32 unk3280;
	/*0x3284*/ u32 unk3284;
	/*0x3288*/ u32 unk3288;
	/*0x328c*/ u32 unk328c;
	/*0x3290*/ u32 unk3290;
	/*0x3294*/ u32 unk3294;
	/*0x3298*/ u32 unk3298;
	/*0x329c*/ u32 unk329c;
	/*0x32a0*/ u32 unk32a0;
	/*0x32a4*/ u32 unk32a4;
	/*0x32a8*/ u32 unk32a8;
	/*0x32ac*/ u32 unk32ac;
	/*0x32b0*/ u32 unk32b0;
	/*0x32b4*/ u32 unk32b4;
	/*0x32b8*/ u32 unk32b8;
	/*0x32bc*/ u32 unk32bc;
	/*0x32c0*/ u32 unk32c0;
	/*0x32c4*/ u32 unk32c4;
	/*0x32c8*/ u32 unk32c8;
	/*0x32cc*/ u32 unk32cc;
	/*0x32d0*/ u32 unk32d0;
	/*0x32d4*/ u32 unk32d4;
	/*0x32d8*/ u32 unk32d8;
	/*0x32dc*/ u32 unk32dc;
	/*0x32e0*/ u32 unk32e0;
	/*0x32e4*/ u32 unk32e4;
	/*0x32e8*/ u32 unk32e8;
	/*0x32ec*/ u32 unk32ec;
	/*0x32f0*/ u32 unk32f0;
	/*0x32f4*/ u32 unk32f4;
	/*0x32f8*/ u32 unk32f8;
	/*0x32fc*/ u32 unk32fc;
	/*0x3300*/ u32 unk3300;
	/*0x3304*/ u32 unk3304;
	/*0x3308*/ u32 unk3308;
	/*0x330c*/ u32 unk330c;
	/*0x3310*/ u32 unk3310;
	/*0x3314*/ u32 unk3314;
	/*0x3318*/ u32 unk3318;
	/*0x331c*/ u32 unk331c;
	/*0x3320*/ u32 unk3320;
	/*0x3324*/ u32 unk3324;
	/*0x3328*/ u32 unk3328;
	/*0x332c*/ u32 unk332c;
	/*0x3330*/ u32 unk3330;
	/*0x3334*/ u32 unk3334;
	/*0x3338*/ u32 unk3338;
	/*0x333c*/ u32 unk333c;
	/*0x3340*/ u32 unk3340;
	/*0x3344*/ u32 unk3344;
	/*0x3348*/ u32 unk3348;
	/*0x334c*/ u32 unk334c;
	/*0x3350*/ u32 unk3350;
	/*0x3354*/ u32 unk3354;
	/*0x3358*/ u32 unk3358;
	/*0x335c*/ u32 unk335c;
	/*0x3360*/ u32 unk3360;
	/*0x3364*/ u32 unk3364;
	/*0x3368*/ u32 unk3368;
	/*0x336c*/ u32 unk336c;
	/*0x3370*/ u32 unk3370;
	/*0x3374*/ u32 unk3374;
	/*0x3378*/ u32 unk3378;
	/*0x337c*/ u32 unk337c;
	/*0x3380*/ u32 unk3380;
	/*0x3384*/ u32 unk3384;
	/*0x3388*/ u32 unk3388;
	/*0x338c*/ u32 unk338c;
	/*0x3390*/ u32 unk3390;
	/*0x3394*/ u32 unk3394;
	/*0x3398*/ u32 unk3398;
	/*0x339c*/ u32 unk339c;
	/*0x33a0*/ u32 unk33a0;
	/*0x33a4*/ u32 unk33a4;
	/*0x33a8*/ u32 unk33a8;
	/*0x33ac*/ u32 unk33ac;
	/*0x33b0*/ u32 unk33b0;
	/*0x33b4*/ u32 unk33b4;
	/*0x33b8*/ u32 unk33b8;
	/*0x33bc*/ u32 unk33bc;
	/*0x33c0*/ u32 unk33c0;
	/*0x33c4*/ u32 unk33c4;
	/*0x33c8*/ u32 unk33c8;
	/*0x33cc*/ u32 unk33cc;
	/*0x33d0*/ u32 unk33d0;
	/*0x33d4*/ u32 unk33d4;
	/*0x33d8*/ u32 unk33d8;
	/*0x33dc*/ u32 unk33dc;
	/*0x33e0*/ u32 unk33e0;
	/*0x33e4*/ u32 unk33e4;
	/*0x33e8*/ u32 unk33e8;
	/*0x33ec*/ u32 unk33ec;
	/*0x33f0*/ u32 unk33f0;
	/*0x33f4*/ u32 unk33f4;
	/*0x33f8*/ u32 unk33f8;
	/*0x33fc*/ u32 unk33fc;
	/*0x3400*/ f32 unk3400;
	/*0x3404*/ f32 unk3404;
	/*0x3408*/ u32 unk3408;
	/*0x340c*/ f32 unk340c;
	/*0x3410*/ f32 unk3410;
	/*0x3414*/ f32 unk3414;
	/*0x3418*/ f32 unk3418;
	/*0x341c*/ u32 unk341c;
	/*0x3420*/ u32 unk3420;
	/*0x3424*/ u32 unk3424;
	/*0x3428*/ f32 unk3428;
	/*0x342c*/ f32 unk342c;
	/*0x3430*/ f32 unk3430;
	/*0x3434*/ f32 unk3434;
	/*0x3438*/ f32 unk3438;
	/*0x343c*/ f32 unk343c;
	/*0x3440*/ f32 unk3440;
	/*0x3444*/ u32 unk3444;
	/*0x3448*/ u32 unk3448;
	/*0x344c*/ u32 unk344c;
	/*0x3450*/ u32 unk3450;
	/*0x3454*/ u32 unk3454;
	/*0x3458*/ u32 unk3458;
	/*0x345c*/ u32 unk345c;
	/*0x3460*/ u32 unk3460;
	/*0x3464*/ u32 unk3464;
	/*0x3468*/ u32 unk3468;
	/*0x346c*/ u32 unk346c;
	/*0x3470*/ u32 unk3470;
	/*0x3474*/ u32 unk3474;
	/*0x3478*/ u32 unk3478;
	/*0x347c*/ u32 unk347c;
	/*0x3480*/ u32 unk3480;
	/*0x3484*/ u32 unk3484;
	/*0x3488*/ u32 unk3488;
	/*0x348c*/ u32 unk348c;
	/*0x3490*/ u32 unk3490;
	/*0x3494*/ u32 unk3494;
	/*0x3498*/ u32 unk3498;
	/*0x349c*/ u32 unk349c;
	/*0x34a0*/ u8 unk34a0;
	/*0x34a1*/ u8 unk34a1; // flags?
	/*0x34a4*/ u32 unk34a4;
	/*0x34a8*/ u32 unk34a8;
	/*0x34ac*/ u32 unk34ac;
	/*0x34b0*/ u32 unk34b0;
	/*0x34b4*/ u32 unk34b4;
	/*0x34b8*/ u32 unk34b8;
	/*0x34bc*/ u32 unk34bc;
	/*0x34c0*/ u32 unk34c0;
	/*0x34c4*/ u32 unk34c4;
	/*0x34c8*/ u32 unk34c8;
	/*0x34cc*/ u32 unk34cc;
	/*0x34d0*/ u32 unk34d0;
	/*0x34d4*/ u32 unk34d4;
	/*0x34d8*/ u32 unk34d8;
	/*0x34dc*/ u32 unk34dc;
	/*0x34e0*/ u32 unk34e0;
	/*0x34e4*/ u32 unk34e4;
	/*0x34e8*/ u32 unk34e8;
	/*0x34ec*/ u32 unk34ec;
	/*0x34f0*/ u32 unk34f0;
	/*0x34f4*/ u32 unk34f4;
	/*0x34f8*/ u32 unk34f8;
	/*0x34fc*/ u32 unk34fc;
	/*0x3500*/ u32 unk3500;
	/*0x3504*/ u32 unk3504;
	/*0x3508*/ u32 unk3508;
	/*0x350c*/ u32 unk350c;
	/*0x3510*/ u32 unk3510;
	/*0x3514*/ u32 unk3514;
	/*0x3518*/ u32 unk3518;
	/*0x351c*/ u32 unk351c;
	/*0x3520*/ u32 unk3520;
	/*0x3524*/ u32 unk3524;
	/*0x3528*/ u32 unk3528;
	/*0x352c*/ u32 unk352c;
	/*0x3530*/ u32 unk3530;
	/*0x3534*/ u32 unk3534;
	/*0x3538*/ u32 unk3538;
	/*0x353c*/ u32 unk353c;
	/*0x3540*/ u32 unk3540;
	/*0x3544*/ u32 unk3544;
	/*0x3548*/ u32 unk3548;
	/*0x354c*/ u32 unk354c;
	/*0x3550*/ u32 unk3550;
	/*0x3554*/ u32 unk3554;
	/*0x3558*/ u32 unk3558;
	/*0x355c*/ u32 unk355c;
	/*0x3560*/ u32 unk3560;
	/*0x3564*/ u32 unk3564;
	/*0x3568*/ u32 unk3568;
	/*0x356c*/ u32 unk356c;
	/*0x3570*/ u32 unk3570;
	/*0x3574*/ u32 unk3574;
	/*0x3578*/ u32 unk3578;
	/*0x357c*/ u32 unk357c;
	/*0x3580*/ u32 unk3580;
	/*0x3584*/ u32 unk3584;
	/*0x3588*/ u32 unk3588;
	/*0x358c*/ u32 unk358c;
	/*0x3590*/ u32 unk3590;
	/*0x3594*/ u32 unk3594;
	/*0x3598*/ u32 unk3598;
	/*0x359c*/ u32 unk359c;
	/*0x35a0*/ u32 unk35a0;
	/*0x35a4*/ u32 unk35a4;
	/*0x35a8*/ u32 unk35a8;
	/*0x35ac*/ u32 unk35ac;
	/*0x35b0*/ u32 unk35b0;
	/*0x35b4*/ u32 unk35b4;
	/*0x35b8*/ u32 unk35b8;
	/*0x35bc*/ u32 unk35bc;
	/*0x35c0*/ u32 unk35c0;
	/*0x35c4*/ u32 unk35c4;
	/*0x35c8*/ u32 unk35c8;
	/*0x35cc*/ u32 unk35cc;
	/*0x35d0*/ u32 unk35d0;
	/*0x35d4*/ u32 unk35d4;
	/*0x35d8*/ u32 unk35d8;
	/*0x35dc*/ u32 unk35dc;
	/*0x35e0*/ u32 unk35e0;
	/*0x35e4*/ u32 unk35e4;
	/*0x35e8*/ u32 unk35e8;
	/*0x35ec*/ u32 unk35ec;
	/*0x35f0*/ u32 unk35f0;
	/*0x35f4*/ u32 unk35f4;
	/*0x35f8*/ u32 unk35f8;
	/*0x35fc*/ u32 unk35fc;
	/*0x3600*/ u32 unk3600;
	/*0x3604*/ u32 unk3604;
	/*0x3608*/ u32 unk3608;
	/*0x360c*/ u32 unk360c;
	/*0x3610*/ u32 unk3610;
	/*0x3614*/ u32 unk3614;
	/*0x3618*/ u32 unk3618;
	/*0x361c*/ u32 unk361c;
	/*0x3620*/ u32 unk3620;
	/*0x3624*/ u32 unk3624;
	/*0x3628*/ u32 unk3628;
	/*0x362c*/ u32 unk362c;
	/*0x3630*/ u32 unk3630;
	/*0x3634*/ u32 unk3634;
	/*0x3638*/ u32 unk3638;
	/*0x363c*/ u32 unk363c;
	/*0x3640*/ u32 unk3640;
	/*0x3644*/ u32 unk3644;
	/*0x3648*/ u32 unk3648;
	/*0x364c*/ u32 unk364c;
	/*0x3650*/ u32 unk3650;
	/*0x3654*/ u32 unk3654;
	/*0x3658*/ u32 unk3658;
	/*0x365c*/ u32 unk365c;
	/*0x3660*/ u32 unk3660;
	/*0x3664*/ u32 unk3664;
	/*0x3668*/ u32 unk3668;
	/*0x366c*/ u32 unk366c;
	/*0x3670*/ u32 unk3670;
	/*0x3674*/ u32 unk3674;
	/*0x3678*/ u32 unk3678;
	/*0x367c*/ u32 unk367c;
	/*0x3680*/ u32 unk3680;
	/*0x3684*/ u32 unk3684;
	/*0x3688*/ u32 unk3688;
	/*0x368c*/ u32 unk368c;
	/*0x3690*/ u32 unk3690;
	/*0x3694*/ u32 unk3694;
	/*0x3698*/ u32 unk3698;
	/*0x369c*/ u32 unk369c;
	/*0x36a0*/ u32 unk36a0;
	/*0x36a4*/ u32 unk36a4;
	/*0x36a8*/ u32 unk36a8;
	/*0x36ac*/ u32 unk36ac;
	/*0x36b0*/ u32 unk36b0;
	/*0x36b4*/ u32 unk36b4;
	/*0x36b8*/ u32 unk36b8;
	/*0x36bc*/ u32 unk36bc;
	/*0x36c0*/ u32 unk36c0;
	/*0x36c4*/ u32 unk36c4;
	/*0x36c8*/ u32 unk36c8;
	/*0x36cc*/ u32 unk36cc;
	/*0x36d0*/ u32 unk36d0;
	/*0x36d4*/ u32 unk36d4;
	/*0x36d8*/ u32 unk36d8;
	/*0x36dc*/ u32 unk36dc;
	/*0x36e0*/ u32 unk36e0;
	/*0x36e4*/ u32 unk36e4;
	/*0x36e8*/ u32 unk36e8;
	/*0x36ec*/ u32 unk36ec;
	/*0x36f0*/ u32 unk36f0;
	/*0x36f4*/ u32 unk36f4;
	/*0x36f8*/ u32 unk36f8;
	/*0x36fc*/ u32 unk36fc;
	/*0x3700*/ u32 unk3700;
	/*0x3704*/ u32 unk3704;
	/*0x3708*/ u32 unk3708;
	/*0x370c*/ u32 unk370c;
	/*0x3710*/ u32 unk3710;
	/*0x3714*/ u32 unk3714;
	/*0x3718*/ u32 unk3718;
	/*0x371c*/ u32 unk371c;
	/*0x3720*/ u32 unk3720;
	/*0x3724*/ u32 unk3724;
	/*0x3728*/ u32 unk3728;
	/*0x372c*/ u32 unk372c;
	/*0x3730*/ u32 unk3730;
	/*0x3734*/ u32 unk3734;
	/*0x3738*/ u32 unk3738;
	/*0x373c*/ u32 unk373c;
	/*0x3740*/ u32 unk3740;
	/*0x3744*/ u32 unk3744;
	/*0x3748*/ u32 unk3748;
	/*0x374c*/ u32 unk374c;
	/*0x3750*/ u32 unk3750;
	/*0x3754*/ u32 unk3754;
	/*0x3758*/ u32 unk3758;
	/*0x375c*/ u32 unk375c;
	/*0x3760*/ u32 unk3760;
	/*0x3764*/ u32 unk3764;
	/*0x3768*/ u32 unk3768;
	/*0x376c*/ u32 unk376c;
	/*0x3770*/ u32 unk3770;
	/*0x3774*/ u32 unk3774;
	/*0x3778*/ u32 unk3778;
	/*0x377c*/ u32 unk377c;
	/*0x3780*/ u32 unk3780;
	/*0x3784*/ u32 unk3784;
	/*0x3788*/ u32 unk3788;
	/*0x378c*/ u32 unk378c;
	/*0x3790*/ u32 unk3790;
	/*0x3794*/ u32 unk3794;
	/*0x3798*/ u32 unk3798;
	/*0x379c*/ u32 unk379c;
	/*0x37a0*/ u32 unk37a0;
	/*0x37a4*/ u32 unk37a4;
	/*0x37a8*/ u32 unk37a8;
	/*0x37ac*/ u32 unk37ac;
	/*0x37b0*/ u32 unk37b0;
	/*0x37b4*/ u32 unk37b4;
	/*0x37b8*/ u32 unk37b8;
	/*0x37bc*/ u32 unk37bc;
	/*0x37c0*/ u32 unk37c0;
	/*0x37c4*/ u32 unk37c4;
	/*0x37c8*/ u32 unk37c8;
	/*0x37cc*/ u32 unk37cc;
	/*0x37d0*/ u32 unk37d0;
	/*0x37d4*/ u32 unk37d4;
	/*0x37d8*/ u32 unk37d8;
	/*0x37dc*/ u32 unk37dc;
	/*0x37e0*/ u32 unk37e0;
	/*0x37e4*/ u32 unk37e4;
	/*0x37e8*/ u32 unk37e8;
	/*0x37ec*/ u32 unk37ec;
	/*0x37f0*/ u32 unk37f0;
	/*0x37f4*/ u32 unk37f4;
	/*0x37f8*/ u32 unk37f8;
	/*0x37fc*/ u32 unk37fc;
	/*0x3800*/ u32 unk3800;
	/*0x3804*/ u32 unk3804;
	/*0x3808*/ u32 unk3808;
	/*0x380c*/ u32 unk380c;
	/*0x3810*/ u32 unk3810;
	/*0x3814*/ u32 unk3814;
	/*0x3818*/ u32 unk3818;
	/*0x381c*/ u32 unk381c;
	/*0x3820*/ u32 unk3820;
	/*0x3824*/ u32 unk3824;
	/*0x3828*/ u32 unk3828;
	/*0x382c*/ u32 unk382c;
	/*0x3830*/ u32 unk3830;
	/*0x3834*/ u32 unk3834;
	/*0x3838*/ u32 unk3838;
	/*0x383c*/ u32 unk383c;
	/*0x3840*/ u32 unk3840;
	/*0x3844*/ u32 unk3844;
	/*0x3848*/ u32 unk3848;
	/*0x384c*/ u32 unk384c;
	/*0x3850*/ u32 unk3850;
	/*0x3854*/ u32 unk3854;
	/*0x3858*/ u32 unk3858;
	/*0x385c*/ u32 unk385c;
	/*0x3860*/ u32 unk3860;
	/*0x3864*/ u32 unk3864;
	/*0x3868*/ u32 unk3868;
	/*0x386c*/ u32 unk386c;
	/*0x3870*/ u32 unk3870;
	/*0x3874*/ u32 unk3874;
	/*0x3878*/ u32 unk3878;
	/*0x387c*/ u32 unk387c;
	/*0x3880*/ u32 unk3880;
	/*0x3884*/ u32 unk3884;
	/*0x3888*/ u32 unk3888;
	/*0x388c*/ u32 unk388c;
	/*0x3890*/ u32 unk3890;
	/*0x3894*/ u32 unk3894;
	/*0x3898*/ u32 unk3898;
	/*0x389c*/ u32 unk389c;
	/*0x38a0*/ u32 unk38a0;
	/*0x38a4*/ u32 unk38a4;
	/*0x38a8*/ u32 unk38a8;
	/*0x38ac*/ u32 unk38ac;
	/*0x38b0*/ u32 unk38b0;
	/*0x38b4*/ u32 unk38b4;
	/*0x38b8*/ u32 unk38b8;
	/*0x38bc*/ u32 unk38bc;
	/*0x38c0*/ u32 unk38c0;
	/*0x38c4*/ u32 unk38c4;
	/*0x38c8*/ u32 unk38c8;
	/*0x38cc*/ u32 unk38cc;
	/*0x38d0*/ u32 unk38d0;
	/*0x38d4*/ u32 unk38d4;
	/*0x38d8*/ u32 unk38d8;
	/*0x38dc*/ u32 unk38dc;
	/*0x38e0*/ u32 unk38e0;
	/*0x38e4*/ u32 unk38e4;
	/*0x38e8*/ u32 unk38e8;
	/*0x38ec*/ u32 unk38ec;
	/*0x38f0*/ u32 unk38f0;
	/*0x38f4*/ u32 unk38f4;
	/*0x38f8*/ u32 unk38f8;
	/*0x38fc*/ u32 unk38fc;
	/*0x3900*/ u32 unk3900;
	/*0x3904*/ u32 unk3904;
	/*0x3908*/ u32 unk3908;
	/*0x390c*/ u32 unk390c;
	/*0x3910*/ u32 unk3910;
	/*0x3914*/ u32 unk3914;
	/*0x3918*/ u32 unk3918;
	/*0x391c*/ u32 unk391c;
	/*0x3920*/ u32 unk3920;
	/*0x3924*/ u32 unk3924;
	/*0x3928*/ u32 unk3928;
	/*0x392c*/ u32 unk392c;
	/*0x3930*/ u32 unk3930;
	/*0x3934*/ u32 unk3934;
	/*0x3938*/ u32 unk3938;
	/*0x393c*/ u32 unk393c;
	/*0x3940*/ u32 unk3940;
	/*0x3944*/ u32 unk3944;
	/*0x3948*/ u32 unk3948;
	/*0x394c*/ u32 unk394c;
	/*0x3950*/ u32 unk3950;
	/*0x3954*/ u32 unk3954;
	/*0x3958*/ u32 unk3958;
	/*0x395c*/ u32 unk395c;
	/*0x3960*/ u32 unk3960;
	/*0x3964*/ u32 unk3964;
	/*0x3968*/ u32 unk3968;
	/*0x396c*/ u32 unk396c;
	/*0x3970*/ u32 unk3970;
	/*0x3974*/ u32 unk3974;
	/*0x3978*/ u32 unk3978;
	/*0x397c*/ u32 unk397c;
	/*0x3980*/ u32 unk3980;
	/*0x3984*/ u32 unk3984;
	/*0x3988*/ u32 unk3988;
	/*0x398c*/ u32 unk398c;
	/*0x3990*/ u32 unk3990;
	/*0x3994*/ u32 unk3994;
	/*0x3998*/ u32 unk3998;
	/*0x399c*/ u32 unk399c;
	/*0x39a0*/ u32 unk39a0;
	/*0x39a4*/ u32 unk39a4;
	/*0x39a8*/ u32 unk39a8;
	/*0x39ac*/ u32 unk39ac;
	/*0x39b0*/ u32 unk39b0;
	/*0x39b4*/ u32 unk39b4;
	/*0x39b8*/ u32 unk39b8;
	/*0x39bc*/ u32 unk39bc;
	/*0x39c0*/ u32 unk39c0;
	/*0x39c4*/ u32 unk39c4;
	/*0x39c8*/ u32 unk39c8;
	/*0x39cc*/ u32 unk39cc;
	/*0x39d0*/ u32 unk39d0;
	/*0x39d4*/ u32 unk39d4;
	/*0x39d8*/ u32 unk39d8;
	/*0x39dc*/ u32 unk39dc;
	/*0x39e0*/ u32 unk39e0;
	/*0x39e4*/ u32 unk39e4;
	/*0x39e8*/ u32 unk39e8;
	/*0x39ec*/ u32 unk39ec;
	/*0x39f0*/ u32 unk39f0;
	/*0x39f4*/ u32 unk39f4;
	/*0x39f8*/ u32 unk39f8;
	/*0x39fc*/ u32 unk39fc;
	/*0x3a00*/ u32 unk3a00;
	/*0x3a04*/ u32 unk3a04;
	/*0x3a08*/ u32 unk3a08;
	/*0x3a0c*/ u32 unk3a0c;
	/*0x3a10*/ u32 unk3a10;
	/*0x3a14*/ u32 unk3a14;
	/*0x3a18*/ u32 unk3a18;
	/*0x3a1c*/ u32 unk3a1c;
	/*0x3a20*/ u32 unk3a20;
	/*0x3a24*/ u32 unk3a24;
	/*0x3a28*/ u32 unk3a28;
	/*0x3a2c*/ u32 unk3a2c;
	/*0x3a30*/ u32 unk3a30;
	/*0x3a34*/ u32 unk3a34;
	/*0x3a38*/ u32 unk3a38;
	/*0x3a3c*/ u32 unk3a3c;
	/*0x3a40*/ u32 unk3a40;
	/*0x3a44*/ u32 unk3a44;
	/*0x3a48*/ u32 unk3a48;
	/*0x3a4c*/ u32 unk3a4c;
	/*0x3a50*/ u32 unk3a50;
	/*0x3a54*/ u32 unk3a54;
	/*0x3a58*/ u32 unk3a58;
	/*0x3a5c*/ u32 unk3a5c;
	/*0x3a60*/ u32 unk3a60;
	/*0x3a64*/ u32 unk3a64;
	/*0x3a68*/ u32 unk3a68;
	/*0x3a6c*/ u32 unk3a6c;
	/*0x3a70*/ u32 unk3a70;
	/*0x3a74*/ u32 unk3a74;
	/*0x3a78*/ u32 unk3a78;
	/*0x3a7c*/ u32 unk3a7c;
	/*0x3a80*/ u32 unk3a80;
	/*0x3a84*/ u32 unk3a84;
	/*0x3a88*/ u32 unk3a88;
	/*0x3a8c*/ u32 unk3a8c;
	/*0x3a90*/ u32 unk3a90;
	/*0x3a94*/ u32 unk3a94;
	/*0x3a98*/ u32 unk3a98;
	/*0x3a9c*/ u32 unk3a9c;
	/*0x3aa0*/ u32 unk3aa0;
	/*0x3aa4*/ u32 unk3aa4;
	/*0x3aa8*/ u32 unk3aa8;
	/*0x3aac*/ u32 unk3aac;
	/*0x3ab0*/ u32 unk3ab0;
	/*0x3ab4*/ u32 unk3ab4;
	/*0x3ab8*/ u32 unk3ab8;
	/*0x3abc*/ u32 unk3abc;
	/*0x3ac0*/ u32 unk3ac0;
	/*0x3ac4*/ u32 unk3ac4;
	/*0x3ac8*/ u32 unk3ac8;
	/*0x3acc*/ u32 unk3acc;
	/*0x3ad0*/ u32 unk3ad0;
	/*0x3ad4*/ u32 unk3ad4;
	/*0x3ad8*/ u32 unk3ad8;
	/*0x3adc*/ u32 unk3adc;
	/*0x3ae0*/ u32 unk3ae0;
	/*0x3ae4*/ u32 unk3ae4;
	/*0x3ae8*/ u32 unk3ae8;
	/*0x3aec*/ u32 unk3aec;
	/*0x3af0*/ u32 unk3af0;
	/*0x3af4*/ u32 unk3af4;
	/*0x3af8*/ u32 unk3af8;
	/*0x3afc*/ u32 unk3afc;
	/*0x3b00*/ u32 unk3b00;
	/*0x3b04*/ u32 unk3b04;
	/*0x3b08*/ u32 unk3b08;
	/*0x3b0c*/ u32 unk3b0c;
	/*0x3b10*/ u32 unk3b10;
	/*0x3b14*/ u32 unk3b14;
	/*0x3b18*/ u32 unk3b18;
	/*0x3b1c*/ u32 unk3b1c;
	/*0x3b20*/ u32 unk3b20;
	/*0x3b24*/ u32 unk3b24;
	/*0x3b28*/ u32 unk3b28;
	/*0x3b2c*/ u32 unk3b2c;
	/*0x3b30*/ u32 unk3b30;
	/*0x3b34*/ u32 unk3b34;
	/*0x3b38*/ u32 unk3b38;
	/*0x3b3c*/ u32 unk3b3c;
	/*0x3b40*/ u32 unk3b40;
	/*0x3b44*/ u32 unk3b44;
	/*0x3b48*/ u32 unk3b48;
	/*0x3b4c*/ u32 unk3b4c;
	/*0x3b50*/ u32 unk3b50;
	/*0x3b54*/ u32 unk3b54;
	/*0x3b58*/ u32 unk3b58;
	/*0x3b5c*/ u32 unk3b5c;
	/*0x3b60*/ u32 unk3b60;
	/*0x3b64*/ u32 unk3b64;
	/*0x3b68*/ u32 unk3b68;
	/*0x3b6c*/ u32 unk3b6c;
	/*0x3b70*/ u32 unk3b70;
	/*0x3b74*/ u32 unk3b74;
	/*0x3b78*/ u32 unk3b78;
	/*0x3b7c*/ u32 unk3b7c;
	/*0x3b80*/ u32 unk3b80;
	/*0x3b84*/ u32 unk3b84;
	/*0x3b88*/ u32 unk3b88;
	/*0x3b8c*/ u32 unk3b8c;
	/*0x3b90*/ u32 unk3b90;
	/*0x3b94*/ u32 unk3b94;
	/*0x3b98*/ u32 unk3b98;
	/*0x3b9c*/ u32 unk3b9c;
	/*0x3ba0*/ u32 unk3ba0;
	/*0x3ba4*/ u32 unk3ba4;
	/*0x3ba8*/ u32 unk3ba8;
	/*0x3bac*/ u32 unk3bac;
	/*0x3bb0*/ u32 unk3bb0;
	/*0x3bb4*/ u32 unk3bb4;
	/*0x3bb8*/ u32 unk3bb8;
	/*0x3bbc*/ u32 unk3bbc;
	/*0x3bc0*/ u32 unk3bc0;
	/*0x3bc4*/ u32 unk3bc4;
	/*0x3bc8*/ u32 unk3bc8;
	/*0x3bcc*/ u32 unk3bcc;
	/*0x3bd0*/ u32 unk3bd0;
	/*0x3bd4*/ u32 unk3bd4;
	/*0x3bd8*/ u32 unk3bd8;
	/*0x3bdc*/ u32 unk3bdc;
	/*0x3be0*/ u32 unk3be0;
	/*0x3be4*/ u32 unk3be4;
	/*0x3be8*/ u32 unk3be8;
	/*0x3bec*/ u32 unk3bec;
	/*0x3bf0*/ u32 unk3bf0;
	/*0x3bf4*/ u32 unk3bf4;
	/*0x3bf8*/ u32 unk3bf8;
	/*0x3bfc*/ u32 unk3bfc;
	/*0x3c00*/ u32 unk3c00;
	/*0x3c04*/ u32 unk3c04;
	/*0x3c08*/ u32 unk3c08;
	/*0x3c0c*/ u32 unk3c0c;
	/*0x3c10*/ u32 unk3c10;
	/*0x3c14*/ u32 unk3c14;
	/*0x3c18*/ u32 unk3c18;
	/*0x3c1c*/ u32 unk3c1c;
	/*0x3c20*/ u32 unk3c20;
	/*0x3c24*/ u32 unk3c24;
	/*0x3c28*/ u32 unk3c28;
	/*0x3c2c*/ u32 unk3c2c;
	/*0x3c30*/ u32 unk3c30;
	/*0x3c34*/ u32 unk3c34;
	/*0x3c38*/ u32 unk3c38;
	/*0x3c3c*/ u32 unk3c3c;
	/*0x3c40*/ u32 unk3c40;
	/*0x3c44*/ u32 unk3c44;
	/*0x3c48*/ u32 unk3c48;
	/*0x3c4c*/ u32 unk3c4c;
	/*0x3c50*/ u32 unk3c50;
	/*0x3c54*/ u32 unk3c54;
	/*0x3c58*/ u32 unk3c58;
	/*0x3c5c*/ u32 unk3c5c;
	/*0x3c60*/ u32 unk3c60;
	/*0x3c64*/ u32 unk3c64;
	/*0x3c68*/ u32 unk3c68;
	/*0x3c6c*/ u32 unk3c6c;
	/*0x3c70*/ u32 unk3c70;
	/*0x3c74*/ u32 unk3c74;
	/*0x3c78*/ u32 unk3c78;
	/*0x3c7c*/ u32 unk3c7c;
	/*0x3c80*/ u32 unk3c80;
	/*0x3c84*/ u32 unk3c84;
	/*0x3c88*/ u32 unk3c88;
	/*0x3c8c*/ u32 unk3c8c;
	/*0x3c90*/ u32 unk3c90;
	/*0x3c94*/ u32 unk3c94;
	/*0x3c98*/ u32 unk3c98;
	/*0x3c9c*/ u32 unk3c9c;
	/*0x3ca0*/ u32 unk3ca0;
	/*0x3ca4*/ u32 unk3ca4;
	/*0x3ca8*/ u32 unk3ca8;
	/*0x3cac*/ u32 unk3cac;
	/*0x3cb0*/ u32 unk3cb0;
	/*0x3cb4*/ u32 unk3cb4;
	/*0x3cb8*/ u32 unk3cb8;
	/*0x3cbc*/ u32 unk3cbc;
	/*0x3cc0*/ u32 unk3cc0;
	/*0x3cc4*/ u32 unk3cc4;
	/*0x3cc8*/ u32 unk3cc8;
	/*0x3ccc*/ u32 unk3ccc;
	/*0x3cd0*/ u32 unk3cd0;
	/*0x3cd4*/ u32 unk3cd4;
	/*0x3cd8*/ u32 unk3cd8;
	/*0x3cdc*/ u32 unk3cdc;
	/*0x3ce0*/ u32 unk3ce0;
	/*0x3ce4*/ u32 unk3ce4;
	/*0x3ce8*/ u32 unk3ce8;
	/*0x3cec*/ u32 unk3cec;
	/*0x3cf0*/ u32 unk3cf0;
	/*0x3cf4*/ u32 unk3cf4;
	/*0x3cf8*/ u32 unk3cf8;
	/*0x3cfc*/ u32 unk3cfc;
	/*0x3d00*/ u32 unk3d00;
	/*0x3d04*/ u32 unk3d04;
	/*0x3d08*/ u32 unk3d08;
	/*0x3d0c*/ u32 unk3d0c;
	/*0x3d10*/ u32 unk3d10;
	/*0x3d14*/ u32 unk3d14;
	/*0x3d18*/ u32 unk3d18;
	/*0x3d1c*/ u32 unk3d1c;
	/*0x3d20*/ u32 unk3d20;
	/*0x3d24*/ u32 unk3d24;
	/*0x3d28*/ u32 unk3d28;
	/*0x3d2c*/ u32 unk3d2c;
	/*0x3d30*/ u32 unk3d30;
	/*0x3d34*/ u32 unk3d34;
	/*0x3d38*/ u32 unk3d38;
	/*0x3d3c*/ u32 unk3d3c;
	/*0x3d40*/ u32 unk3d40;
	/*0x3d44*/ u32 unk3d44;
	/*0x3d48*/ u32 unk3d48;
	/*0x3d4c*/ u32 unk3d4c;
	/*0x3d50*/ u32 unk3d50;
	/*0x3d54*/ u32 unk3d54;
	/*0x3d58*/ u32 unk3d58;
	/*0x3d5c*/ u32 unk3d5c;
	/*0x3d60*/ u32 unk3d60;
	/*0x3d64*/ u32 unk3d64;
	/*0x3d68*/ u32 unk3d68;
	/*0x3d6c*/ u32 unk3d6c;
	/*0x3d70*/ u32 unk3d70;
	/*0x3d74*/ u32 unk3d74;
	/*0x3d78*/ u32 unk3d78;
	/*0x3d7c*/ u32 unk3d7c;
	/*0x3d80*/ u32 unk3d80;
	/*0x3d84*/ u32 unk3d84;
	/*0x3d88*/ u32 unk3d88;
	/*0x3d8c*/ u32 unk3d8c;
	/*0x3d90*/ u32 unk3d90;
	/*0x3d94*/ u32 unk3d94;
	/*0x3d98*/ u32 unk3d98;
	/*0x3d9c*/ u32 unk3d9c;
	/*0x3da0*/ u32 unk3da0;
	/*0x3da4*/ u32 unk3da4;
	/*0x3da8*/ u32 unk3da8;
	/*0x3dac*/ u32 unk3dac;
	/*0x3db0*/ u32 unk3db0;
	/*0x3db4*/ u32 unk3db4;
	/*0x3db8*/ u32 unk3db8;
	/*0x3dbc*/ u32 unk3dbc;
	/*0x3dc0*/ u32 unk3dc0;
	/*0x3dc4*/ u32 unk3dc4;
	/*0x3dc8*/ u32 unk3dc8;
	/*0x3dcc*/ u32 unk3dcc;
	/*0x3dd0*/ u32 unk3dd0;
	/*0x3dd4*/ u32 unk3dd4;
	/*0x3dd8*/ u32 unk3dd8;
	/*0x3ddc*/ u32 unk3ddc;
	/*0x3de0*/ u32 unk3de0;
	/*0x3de4*/ u32 unk3de4;
	/*0x3de8*/ u32 unk3de8;
	/*0x3dec*/ u32 unk3dec;
	/*0x3df0*/ u32 unk3df0;
	/*0x3df4*/ u32 unk3df4;
	/*0x3df8*/ u32 unk3df8;
	/*0x3dfc*/ u32 unk3dfc;
	/*0x3e00*/ u32 unk3e00;
	/*0x3e04*/ u32 unk3e04;
	/*0x3e08*/ u32 unk3e08;
	/*0x3e0c*/ u32 unk3e0c;
	/*0x3e10*/ u32 unk3e10;
	/*0x3e14*/ u32 unk3e14;
	/*0x3e18*/ u32 unk3e18;
	/*0x3e1c*/ u32 unk3e1c;
	/*0x3e20*/ u32 unk3e20;
	/*0x3e24*/ u32 unk3e24;
	/*0x3e28*/ u32 unk3e28;
	/*0x3e2c*/ u32 unk3e2c;
	/*0x3e30*/ u32 unk3e30;
	/*0x3e34*/ u32 unk3e34;
	/*0x3e38*/ u32 unk3e38;
	/*0x3e3c*/ u32 unk3e3c;
	/*0x3e40*/ u32 unk3e40;
	/*0x3e44*/ u32 unk3e44;
	/*0x3e48*/ u32 unk3e48;
	/*0x3e4c*/ u32 unk3e4c;
	/*0x3e50*/ u32 unk3e50;
	/*0x3e54*/ u32 unk3e54;
	/*0x3e58*/ u32 unk3e58;
	/*0x3e5c*/ u32 unk3e5c;
	/*0x3e60*/ u32 unk3e60;
	/*0x3e64*/ u32 unk3e64;
	/*0x3e68*/ u32 unk3e68;
	/*0x3e6c*/ u32 unk3e6c;
	/*0x3e70*/ u32 unk3e70;
	/*0x3e74*/ u32 unk3e74;
	/*0x3e78*/ u32 unk3e78;
	/*0x3e7c*/ u32 unk3e7c;
	/*0x3e80*/ u32 unk3e80;
	/*0x3e84*/ u32 unk3e84;
	/*0x3e88*/ u32 unk3e88;
	/*0x3e8c*/ u32 unk3e8c;
	/*0x3e90*/ u32 unk3e90;
	/*0x3e94*/ u32 unk3e94;
	/*0x3e98*/ u32 unk3e98;
	/*0x3e9c*/ u32 unk3e9c;
	/*0x3ea0*/ u32 unk3ea0;
	/*0x3ea4*/ u32 unk3ea4;
	/*0x3ea8*/ u32 unk3ea8;
	/*0x3eac*/ u32 unk3eac;
	/*0x3eb0*/ u32 unk3eb0;
	/*0x3eb4*/ u32 unk3eb4;
	/*0x3eb8*/ u32 unk3eb8;
	/*0x3ebc*/ u32 unk3ebc;
	/*0x3ec0*/ u32 unk3ec0;
	/*0x3ec4*/ u32 unk3ec4;
	/*0x3ec8*/ u32 unk3ec8;
	/*0x3ecc*/ u32 unk3ecc;
	/*0x3ed0*/ u32 unk3ed0;
	/*0x3ed4*/ u32 unk3ed4;
	/*0x3ed8*/ u32 unk3ed8;
	/*0x3edc*/ u32 unk3edc;
	/*0x3ee0*/ u32 unk3ee0;
	/*0x3ee4*/ u32 unk3ee4;
	/*0x3ee8*/ u32 unk3ee8;
	/*0x3eec*/ u32 unk3eec;
	/*0x3ef0*/ u32 unk3ef0;
	/*0x3ef4*/ u32 unk3ef4;
	/*0x3ef8*/ u32 unk3ef8;
	/*0x3efc*/ u32 unk3efc;
	/*0x3f00*/ u32 unk3f00;
	/*0x3f04*/ u32 unk3f04;
	/*0x3f08*/ u32 unk3f08;
	/*0x3f0c*/ u32 unk3f0c;
	/*0x3f10*/ u32 unk3f10;
	/*0x3f14*/ u32 unk3f14;
	/*0x3f18*/ u32 unk3f18;
	/*0x3f1c*/ u32 unk3f1c;
	/*0x3f20*/ u32 unk3f20;
	/*0x3f24*/ u32 unk3f24;
	/*0x3f28*/ u32 unk3f28;
	/*0x3f2c*/ u32 unk3f2c;
	/*0x3f30*/ u32 unk3f30;
	/*0x3f34*/ u32 unk3f34;
	/*0x3f38*/ u32 unk3f38;
	/*0x3f3c*/ u32 unk3f3c;
	/*0x3f40*/ u32 unk3f40;
	/*0x3f44*/ u32 unk3f44;
	/*0x3f48*/ u32 unk3f48;
	/*0x3f4c*/ u32 unk3f4c;
	/*0x3f50*/ u32 unk3f50;
	/*0x3f54*/ u32 unk3f54;
	/*0x3f58*/ u32 unk3f58;
	/*0x3f5c*/ u32 unk3f5c;
	/*0x3f60*/ u32 unk3f60;
	/*0x3f64*/ u32 unk3f64;
	/*0x3f68*/ u32 unk3f68;
	/*0x3f6c*/ u32 unk3f6c;
	/*0x3f70*/ u32 unk3f70;
	/*0x3f74*/ u32 unk3f74;
	/*0x3f78*/ u32 unk3f78;
	/*0x3f7c*/ u32 unk3f7c;
	/*0x3f80*/ u32 unk3f80;
	/*0x3f84*/ u32 unk3f84;
	/*0x3f88*/ u32 unk3f88;
	/*0x3f8c*/ u32 unk3f8c;
	/*0x3f90*/ u32 unk3f90;
	/*0x3f94*/ u32 unk3f94;
	/*0x3f98*/ u32 unk3f98;
	/*0x3f9c*/ u32 unk3f9c;
	/*0x3fa0*/ u32 unk3fa0;
	/*0x3fa4*/ u32 unk3fa4;
	/*0x3fa8*/ u32 unk3fa8;
	/*0x3fac*/ u32 unk3fac;
	/*0x3fb0*/ u32 unk3fb0;
	/*0x3fb4*/ u32 unk3fb4;
	/*0x3fb8*/ u32 unk3fb8;
	/*0x3fbc*/ u32 unk3fbc;
	/*0x3fc0*/ u32 unk3fc0;
	/*0x3fc4*/ u32 unk3fc4;
	/*0x3fc8*/ u32 unk3fc8;
	/*0x3fcc*/ u32 unk3fcc;
	/*0x3fd0*/ u32 unk3fd0;
	/*0x3fd4*/ u32 unk3fd4;
	/*0x3fd8*/ u32 unk3fd8;
	/*0x3fdc*/ u32 unk3fdc;
	/*0x3fe0*/ u32 unk3fe0;
	/*0x3fe4*/ u32 unk3fe4;
	/*0x3fe8*/ u32 unk3fe8;
	/*0x3fec*/ u32 unk3fec;
	/*0x3ff0*/ u32 unk3ff0;
	/*0x3ff4*/ u32 unk3ff4;
	/*0x3ff8*/ u32 unk3ff8;
	/*0x3ffc*/ u32 unk3ffc;
	/*0x4000*/ u32 unk4000;
	/*0x4004*/ u32 unk4004;
	/*0x4008*/ u32 unk4008;
	/*0x400c*/ u32 unk400c;
	/*0x4010*/ u32 unk4010;
	/*0x4014*/ u32 unk4014;
	/*0x4018*/ u32 unk4018;
	/*0x401c*/ u32 unk401c;
	/*0x4020*/ u32 unk4020;
	/*0x4024*/ u32 unk4024;
	/*0x4028*/ u32 unk4028;
	/*0x402c*/ u32 unk402c;
	/*0x4030*/ u32 unk4030;
	/*0x4034*/ u32 unk4034;
	/*0x4038*/ u32 unk4038;
	/*0x403c*/ u32 unk403c;
	/*0x4040*/ u32 unk4040;
	/*0x4044*/ u32 unk4044;
	/*0x4048*/ u32 unk4048;
	/*0x404c*/ u32 unk404c;
	/*0x4050*/ u32 unk4050;
	/*0x4054*/ u32 unk4054;
	/*0x4058*/ u32 unk4058;
	/*0x405c*/ u32 unk405c;
	/*0x4060*/ u32 unk4060;
	/*0x4064*/ u32 unk4064;
	/*0x4068*/ u32 unk4068;
	/*0x406c*/ u32 unk406c;
	/*0x4070*/ u32 unk4070;
	/*0x4074*/ u32 unk4074;
	/*0x4078*/ u32 unk4078;
	/*0x407c*/ u32 unk407c;
	/*0x4080*/ u32 unk4080;
	/*0x4084*/ u32 unk4084;
	/*0x4088*/ u32 unk4088;
	/*0x408c*/ u32 unk408c;
	/*0x4090*/ u32 unk4090;
	/*0x4094*/ u32 unk4094;
	/*0x4098*/ u32 unk4098;
	/*0x409c*/ u32 unk409c;
	/*0x40a0*/ u32 unk40a0;
	/*0x40a4*/ u32 unk40a4;
	/*0x40a8*/ u32 unk40a8;
	/*0x40ac*/ u32 unk40ac;
	/*0x40b0*/ u32 unk40b0;
	/*0x40b4*/ u32 unk40b4;
	/*0x40b8*/ u32 unk40b8;
	/*0x40bc*/ u32 unk40bc;
	/*0x40c0*/ u32 unk40c0;
	/*0x40c4*/ u32 unk40c4;
	/*0x40c8*/ u32 unk40c8;
	/*0x40cc*/ u32 unk40cc;
	/*0x40d0*/ u32 unk40d0;
	/*0x40d4*/ u32 unk40d4;
	/*0x40d8*/ u32 unk40d8;
	/*0x40dc*/ u32 unk40dc;
	/*0x40e0*/ u32 unk40e0;
	/*0x40e4*/ u32 unk40e4;
	/*0x40e8*/ u32 unk40e8;
	/*0x40ec*/ u32 unk40ec;
	/*0x40f0*/ u32 unk40f0;
	/*0x40f4*/ u32 unk40f4;
	/*0x40f8*/ u32 unk40f8;
	/*0x40fc*/ u32 unk40fc;
	/*0x4100*/ u32 unk4100;
	/*0x4104*/ u32 unk4104;
	/*0x4108*/ u32 unk4108;
	/*0x410c*/ u32 unk410c;
	/*0x4110*/ u32 unk4110;
	/*0x4114*/ u32 unk4114;
	/*0x4118*/ u32 unk4118;
	/*0x411c*/ u32 unk411c;
	/*0x4120*/ u32 unk4120;
	/*0x4124*/ u32 unk4124;
	/*0x4128*/ u32 unk4128;
	/*0x412c*/ u32 unk412c;
	/*0x4130*/ u32 unk4130;
	/*0x4134*/ u32 unk4134;
	/*0x4138*/ u32 unk4138;
	/*0x413c*/ u32 unk413c;
	/*0x4140*/ u32 unk4140;
	/*0x4144*/ u32 unk4144;
	/*0x4148*/ u32 unk4148;
	/*0x414c*/ u32 unk414c;
	/*0x4150*/ u32 unk4150;
	/*0x4154*/ u32 unk4154;
	/*0x4158*/ u32 unk4158;
	/*0x415c*/ u32 unk415c;
	/*0x4160*/ u32 unk4160;
	/*0x4164*/ u32 unk4164;
	/*0x4168*/ u32 unk4168;
	/*0x416c*/ u32 unk416c;
	/*0x4170*/ u32 unk4170;
	/*0x4174*/ u32 unk4174;
	/*0x4178*/ u32 unk4178;
	/*0x417c*/ u32 unk417c;
	/*0x4180*/ u32 unk4180;
	/*0x4184*/ u32 unk4184;
	/*0x4188*/ u32 unk4188;
	/*0x418c*/ u32 unk418c;
	/*0x4190*/ u32 unk4190;
	/*0x4194*/ u32 unk4194;
	/*0x4198*/ u32 unk4198;
	/*0x419c*/ u32 unk419c;
	/*0x41a0*/ u32 unk41a0;
	/*0x41a4*/ u32 unk41a4;
	/*0x41a8*/ u32 unk41a8;
	/*0x41ac*/ u32 unk41ac;
	/*0x41b0*/ s8 unk41b0[2];
	/*0x41b4*/ struct credits41b4 unk41b4[4];
	/*0x41f4*/ u8 unk41f4;
	/*0x41f8*/ u32 unk41f8;
	/*0x41fc*/ u32 unk41fc;
	/*0x4200*/ u32 unk4200;
	/*0x4204*/ u32 unk4204;
	/*0x4208*/ u32 unk4208;
	/*0x420c*/ u32 unk420c;
	/*0x4210*/ u32 unk4210;
	/*0x4214*/ u32 unk4214;
	/*0x4218*/ u32 unk4218;
	/*0x421c*/ u32 unk421c;
	/*0x4220*/ u32 unk4220;
	/*0x4224*/ u32 unk4224;
	/*0x4228*/ u32 unk4228;
	/*0x422c*/ u32 unk422c;
	/*0x4230*/ u32 unk4230;
	/*0x4234*/ u32 unk4234;
	/*0x4238*/ u32 unk4238;
	/*0x423c*/ u32 unk423c;
};

#endif
