[
    {
        "id": "L_DAM_000",
        "en": "|Background - \n\nThe conspirators have thrown caution to the winds and have committed an act of piracy, taking over the Pelagic II and commencing hurried diving operations in the Pacific Ocean. Both dataDyne and its strange allies are involved in what appears to be a joint operation.\n\n|Carrington - \n\nAlthough this move seems reckless, it only serves to highlight how important the operation on the seabed must be to dataDyne and its allies. Disrupt the operation as extensively as possible, but remember our minimum force rules for noncombatants.\n\n|Objective One: - Disable Primary Power Source\n\nShutting down the primary power source will help cause the ship to wander from the operating location, but it will also cause blackouts in nonessential sections of the ship. Use the x-ray scanner to find the active switches on the power core.\n\n|Objective Two: - Secure Laboratories and Research Data\n\nWe want any information that dataDyne has amassed on this project. Secure the labs on the science deck and remember to stun the scientists and technicians working there; we will want to interrogate them later.\n\n|Objective Three: - Deactivate GPS and Autopilot\n\nGetting both the GPS location system and the ship's autopilot offline will cause the ship to drift off station; if only one is shut down, it will not be enough to prevent the diving operations from continuing. Do not harm any innocent civilians you come across.\n\n|Objective Four: - Activate Moon Pool Lift\n\nThis will activate the automatic pilot on the deep submersible, recalling it for you and Elvis to use. The controls are in the sub hangar.\n\n|Objective Five: - Rendezvous and Escape With Elvis\n\nFind Elvis and return to the Moon Pool to prep both the deep submersible and yourselves for the dive to the seafloor.\n\nEND\n",
        "gb": "|Background - \n\nThe conspirators have thrown caution to the winds and have committed an act of piracy, taking over the Pelagic II and commencing hurried diving operations in the Pacific Ocean. Both dataDyne and its strange allies are involved in what appears to be a joint operation.\n\n|Carrington - \n\nAlthough this move seems reckless, it only serves to highlight how important the operation on the seabed must be to dataDyne and its allies. Disrupt the operation as extensively as possible, but remember our minimum force rules for noncombatants.\n\n|Objective One: - Disable Primary Power Source\n\nShutting down the primary power source will help cause the ship to wander from the operating location, but it will also cause blackouts in nonessential sections of the ship. Use the x-ray scanner to find the active switches on the power core.\n\n|Objective Two: - Secure Laboratories and Research Data\n\nWe want any information that dataDyne has amassed on this project. Secure the labs on the science deck and remember to stun the scientists and technicians working there; we will want to interrogate them later.\n\n|Objective Three: - Deactivate GPS and Autopilot\n\nGetting both the GPS location system and the ship's autopilot offline will cause the ship to drift off station; if only one is shut down, it will not be enough to prevent the diving operations from continuing. Do not harm any innocent civilians you come across.\n\n|Objective Four: - Activate Moon Pool Lift\n\nThis will activate the automatic pilot on the deep submersible, recalling it for you and Elvis to use. The controls are in the sub hangar.\n\n|Objective Five: - Rendezvous and Escape With Elvis\n\nFind Elvis and return to the Moon Pool to prep both the deep submersible and yourselves for the dive to the seafloor.\n\nEND\n",
        "jp": "|Background - \n\nThe conspirators have thrown caution to the winds and have committed an act of piracy, taking over the Pelagic 2 and commencing hurried diving operations in the Pacific Ocean. Both dataDyne and their strange allies are involved in what appears to be a joint operation.\n\n|Carrington - \n\nAlthough this move seems reckless, it only serves to highlight how important the operation on the seabed must be to dataDyne and their allies. Disrupt the operation as extensively as possible but remember our minimum force rules for non-combatants.\n\n|Objective One: - Disable Primary Power Source\n\nShutting down the Primary Power Source will help cause the ship to wander from the operating location, but it will also cause blackouts in non-essential sections of the ship.\n\n|Objective Two: - Secure Laboratories And Research Data\n\nWe want any information that dataDyne have amassed on this project. Secure the labs on the science deck and remember to stun the scientists and technicians working there; we will want to interrogate them later.\n\n|Objective Three: - Deactivate GPS And AutoPilot\n\ngetting both the GPS location system and the ship's Autopilot offline will cause the ship to drift off station; if only one is shut down it will not be enough to prevent the diving operations from continuing.\n\n|Objective Four: - Activate Moon Pool Lift\n\nThis will activate the automatic pilot on the deep submersible, recalling it for you and Elvis to use. The controls are in the sub hangar.\n\n|Objective Five: - Rendezvous And Escape With Elvis\n\nfind Elvis and return to the Moon pool to prep both the deep submersible and yourselves for the dive to the seafloor.\n\nEND\n",
        "it": "|Situazione - \n\nRischiando il tutto per tutto, i cospiratori in un atto di pirateria hanno preso il comando del Pelagic II e hanno dato inizio a frettolose operazioni sottomarine nell'Oceano Pacifico. Sia la dataDyne che i suoi strani alleati sono coinvolti in quella che ha tutto l'aspetto di un'operazione congiunta.\n\n|Carrington - \n\nPer quanto la loro mossa possa sembrare avventata, in realtà non fa altro che confermare l'importanza delle operazioni sul fondo oceanico per la dataDyne e i suoi alleati. Ostacola le operazioni quanto più possibile, ma tenendo sempre presente la regola del ricorso minimo alla violenza contro i civili.\n\n|Obiettivo 1: - Disattiva la fonte d'energia primaria\n\nLa chiusura della fonte d'energia primaria permetterà lo spostamento del sottomarino dalla sua posizione operativa, ma interromperà anche l'erogazione energetica a settori non essenziali del sommergibile. Usa lo scanner a raggi X per trovare gli interruttori attivi nella centralina elettrica.\n\n|Obiettivo 2: - Chiudi a chiave i laboratori\n\nVogliamo ogni informazione che la dataDyne abbia raccolto su questo progetto. Chiudi a chiave i laboratori sul piano per la ricerca scientifica e stordisci gli scienziati e i tecnici che lavorano lì: li interrogheremo più tardi.\n\n|Obiettivo 3: - Disattiva il GPS e il pilota automatico\n\nDisattivando il sistema di orientamento GPS e il pilota automatico la nave inizierà ad allontanarsi dalla sua posizione. Se viene disattivato solo uno dei due, non sarà sufficiente ad impedire la continuazione delle operazioni sottomarine. Non ferire nessuno dei civili che incontri.\n\n|Obiettivo 4: - Attiva il sollevatore del Moon Pool\n\nQuesto attiverà il pilota automatico dell'unità sommergibile minore, richiamandola affinché tu ed Elvis possiate salire a bordo. I comandi sono nell'hangar.\n\n|Obiettivo 5: - Incontro e fuga con Elvis\n\nTrova Elvis e tornate al Moon Pool. Preparatevi per la fuga sul fondo oceanico a bordo di questo piccolo sommergibile.\n\nFINE\n",
        "fr": "|Briefing - \n\nLes conspirateurs ont détourné le Pelagic II et ont entamé d'importantes opérations sous-marines dans l'Océan Pacifique. La dataDyne et leurs mystérieux alliés semblent être impliqués dans une manoeuvre de coopération.\n\n|Carrington - \n\nBien que cette action semble maladroite, elle met en évidence l'importance de cette zone sous-marine aux yeux de la dataDyne et de ses alliés. Contrecarrez du mieux que vous pouvez l'opération tout en respectant notre protocole de sauvegarde des civils.\n\n|Objectif 1: - Désactiver source d'énergie principale\n\nLa coupure du générateur principal fera dériver le vaisseau de sa zone d'opération mais provoqua des blackouts dans les sections secondaires de l'appareil. Utilisez un scanner rayons X pour trouver les interrupteurs sur le générateur.\n\n|Objectif 2: - Sécuriser labos et données de recherche\n\nNous voulons les informations recueillies par la dataDyne sur ce projet. Sécurisez les labos du pont scientifique et souvenez-vous d'assommer les scientifiques et les techniciens du site. Nous les interrogerons plus tard.\n\n|Objectif 3: - Désactiver GPS et Auto-pilote\n\nDébrancher le système de localisation GPS et l'auto-pilote du vaisseau le fera s'écarter de la station. Si seulement l'un des deux est éteint, les opérations de plongée ne seront pas perturbées et suivront leur cours.\n\n|Objectif 4: - Activer l'ascenseur du sas\n\nCeci enclenchera le pilote automatique du submersible, ramenant celui-ci pour vous et Elvis. Les commandes se trouvent dans le hangar du sous-marin.\n\n|Objectif 5: - Retrouver Elvis et s'enfuir avec lui\n\nTrouvez Elvis et retournez au sas pour préparer le submersible et votre équipement pour une plongée.\n\nFIN\n",
        "de": "|Hintergrund - \n\nDie Verschwörer haben ihre Deckung fallen gelassen und einen Akt der Piraterie eingeleitet. Die Pelagic II wurde geentert und führt nun ein Tiefsee-Tauchmanöver im Pazifischen Ozean durch. Sowohl dataDyne als auch ihre eigenartigen Verbündeten scheinen in diese Operation verwickelt zu sein.\n\n|Carrington - \n\nObwohl dieser Schritt sehr leichtsinnig erscheint, zeigt diese Maßnahme, wie wichtig diese Tiefsee-Operation für die dataDyne-Gruppe und ihre Verbündeten sein muss. Ihre Aufgabe ist es, diese Operation zu stören. Bedenken Sie aber auch unsere Verhaltensregeln gegenüber unbeteiligten Personen.\n\n|1. Ziel: - Setzen Sie den Generator außer Kraft!\n\nDurch die Abschaltung des Generators wird das Schiff gezwungen, das Operationsgebiet zu verlassen. Allerdings führt der Energieverlust in manchen Teilen des Schiffs auch zu Blackouts. Setzen Sie den Röntgen-Scanner ein, um die aktiven Schalter zu finden.\n\n|2. Ziel: - Sichern Sie die Daten der Forschungsergebnisse!\n\nWir wollen sämtliche Informationen, die dataDyne bis dato über dieses Projekt gesammelt hat. Sichern Sie die Laboratorien am Forschungs-Deck, und setzen Sie die anwesenden Wissenschaftler und Techniker außer Gefecht. Vergessen Sie nicht, dass wir sie später noch verhören wollen!\n\n|3. Ziel: - Deaktivieren Sie das GPS und den Autopiloten!\n\nEs ist erforderlich, das GPS-Ortungssystem und den Autopiloten zu deaktivieren. Ohne die Unterstützung dieser Systeme beginnt das Schiff abzudriften. Die Abschaltung von nur einem System reicht nicht aus, die Fortführung der Operation zu unterbrechen. Zivilisten dürfen auf keinen Fall zu Schaden kommen.\n\n|4. Ziel: - Aktivieren Sie den Moon Pool-Aufzug!\n\nDie Steuerungselemente für das Tauchschiff befinden sich im Tiefhangar. Wenn Sie den Autopiloten des Tauchschiffs aktivieren, gelangt es für Sie und Elvis in Reichweite.\n\n|5. Ziel: - Treffen Sie sich mit Elvis, und flüchten Sie gemeinsam!\n\nFinden Sie Elvis und kehren Sie mit ihm zum Moon Pool zurück. Bereiten Sie dort sich selbst und das Tauchschiff für den Tauchgang zum Meeresgrund vor.\n\nENDE\n",
        "es": "|Antecedentes - \n\nLos conspiradores han echado la precaución por la borda y han cometido un acto de piratería, tomando el Pelagic II y comenzando a toda velocidad operaciones submarinas en el Océano Pacífico. Ambos, dataDyne y sus extraños aliados, están envueltos en lo que parece una operación conjunta.\n\n|Carrington - \n\nAunque este movimiento parece insensato, sólo sirve para mostrar lo importante que esta operación en el fondo marino debe ser para dataDyne y sus aliados. Interrumpe la operación tanto como sea posible, pero recuerda nuestras reglas de fuerza mínima para los no combatientes.\n\n|Objetivo Uno: - Desactivar la Fuente Primaria de Energía\n\nApagar la fuente primaria de energía puede causar que el navío se aparte de la zona de operaciones, pero también puede causar apagones en secciones no esenciales de la nave. Usa el escáner de rayos-x para encontrar los interruptores activos en el núcleo de energía.\n\n|Objetivo Dos: - Asegurar los Laboratorios y Datos de Investigación\n\nQueremos cualquier información que dataDyne haya reunido sobre este proyecto. Asegura los laboratorios de la cubierta de ciencias y recuerda aturdir a los científicos y técnicos que allí trabajan; queremos interrogarles más tarde.\n\n|Objectivo Tres: - Desactivar el GPS y el Piloto Automático\n\nApagar tanto el sistema de localización GPS como el piloto automático de la nave causará que el barco quede 'dormido'; si solamente uno es apagado, no será suficiente para evitar que las operaciones submarinas continúen. No hieras a los civiles con los que te cruces.\n\n|Objetivo Cuatro: - Activar el Ascensor de la Piscina\n\nEsto activará el piloto automático del sumergible de profundidad, trayéndolo de vuelta para que lo uséis Elvis y tú. Los controles están en el sub-hangar.\n\n|Objetivo Cinco: - Encontrar y Escapar con Elvis\n\nEncuentra a Elvis y regresa a la Piscina donde debéis preparar el sumergible y a vosotros mismos para sumergiros hacia el fondo marino.\n\nFIN\n"
    },
    {
        "id": "L_DAM_001",
        "en": "Cetan Ship\n",
        "gb": "Cetan Ship\n",
        "jp": "Cetan Ship\n",
        "it": "Astronave Cetan\n",
        "fr": "Vaisseau Cetan\n",
        "de": "Cetanisches Schiff\n",
        "es": "Nave Cetan\n"
    },
    {
        "id": "L_DAM_002",
        "en": "|Background - \n\nThe conspirators have thrown caution to the winds and have committed an act of piracy, taking over the Pelagic II and commencing hurried diving operations in the Pacific Ocean. Both dataDyne and its strange allies are involved in what appears to be a joint operation.\n\n|Carrington - \n\nAlthough this move seems reckless, it only serves to highlight how important the operation on the seabed must be to dataDyne and its allies. Disrupt the operation as extensively as possible, but remember our minimum force rules for noncombatants.\n\n|Objective One: - Disable Primary Power Source\n\nShutting down the primary power source will help cause the ship to wander from the operating location, but it will also cause blackouts in nonessential sections of the ship. Use the x-ray scanner to find the active switches on the power core.\n\n|Objective Two: - Deactivate GPS and Autopilot\n\nGetting both the GPS location system and the ship's autopilot offline will cause the ship to drift off station; if only one is shut down, it will not be enough to prevent the diving operations from continuing. Do not harm any innocent civilians you come across.\n\n|Objective Three: - Activate Moon Pool Lift\n\nThis will activate the automatic pilot on the deep submersible, recalling it for you and Elvis to use. The controls are in the sub hangar.\n\n|Objective Four: - Rendezvous and Escape With Elvis\n\nFind Elvis and return to the Moon Pool to prep both the deep submersible and yourselves for the dive to the seafloor.\n\nEND\n",
        "gb": "|Background - \n\nThe conspirators have thrown caution to the winds and have committed an act of piracy, taking over the Pelagic II and commencing hurried diving operations in the Pacific Ocean. Both dataDyne and its strange allies are involved in what appears to be a joint operation.\n\n|Carrington - \n\nAlthough this move seems reckless, it only serves to highlight how important the operation on the seabed must be to dataDyne and its allies. Disrupt the operation as extensively as possible, but remember our minimum force rules for noncombatants.\n\n|Objective One: - Disable Primary Power Source\n\nShutting down the primary power source will help cause the ship to wander from the operating location, but it will also cause blackouts in nonessential sections of the ship. Use the x-ray scanner to find the active switches on the power core.\n\n|Objective Two: - Deactivate GPS and Autopilot\n\nGetting both the GPS location system and the ship's autopilot offline will cause the ship to drift off station; if only one is shut down, it will not be enough to prevent the diving operations from continuing. Do not harm any innocent civilians you come across.\n\n|Objective Three: - Activate Moon Pool Lift\n\nThis will activate the automatic pilot on the deep submersible, recalling it for you and Elvis to use. The controls are in the sub hangar.\n\n|Objective Four: - Rendezvous and Escape With Elvis\n\nFind Elvis and return to the Moon Pool to prep both the deep submersible and yourselves for the dive to the seafloor.\n\nEND\n",
        "jp": "|Background - \n\nThe conspirators have thrown caution to the winds and have committed an act of piracy, taking over the Pelagic 2 and commencing hurried diving operations in the Pacific Ocean. Both dataDyne and their strange allies are involved in what appears to be a joint operation.\n\n|Carrington - \n\nAlthough this move seems reckless, it only serves to highlight how important the operation on the seabed must be to dataDyne and their allies. Disrupt the operation as extensively as possible but remember our minimum force rules for non-combatants.\n\n|Objective One: - Disable Primary Power Source\n\nShutting down the Primary Power Source will help cause the ship to wander from the operating location, but it will also cause blackouts in non-essential sections of the ship.\n\n|Objective Two: - Deactivate GPS And AutoPilot\n\ngetting both the GPS location system and the ship's Autopilot offline will cause the ship to drift off station; if only one is shut down it will not be enough to prevent the diving operations from continuing.\n\n|Objective Three: - Activate Moon Pool Lift\n\nThis will activate the automatic pilot on the deep submersible, recalling it for you and Elvis to use. The controls are in the sub hangar.\n\n|Objective Four: - Rendezvous And Escape With Elvis\n\nfind Elvis and return to the Moon pool to prep both the deep submersible and yourselves for the dive to the seafloor.\n\nEND\n",
        "it": "|Situazione - \n\nRischiando il tutto per tutto, i cospiratori in un atto di pirateria hanno preso il comando del Pelagic II e hanno dato inizio a frettolose operazioni sottomarine nell'Oceano Pacifico. Sia la dataDyne che i suoi strani alleati sono coinvolti in quella che ha tutto l'aspetto di un'operazione congiunta.\n\n|Carrington - \n\nPer quanto la loro mossa possa sembrare avventata, in realtà non fa altro che confermare l'importanza delle operazioni sul fondo oceanico per la dataDyne e i suoi alleati. Ostacola le operazioni quanto più possibile, ma tenendo sempre presente la regola del ricorso minimo alla violenza contro i civili.\n\n|Obiettivo 1: - Disattiva la fonte d'energia primaria\n\nLa chiusura della fonte d'energia primaria permetterà lo spostamento del sottomarino dalla sua posizione operativa, ma interromperà anche l'erogazione energetica a settori non essenziali del sommergibile. Usa lo scanner a raggi X per trovare gli interruttori attivi nella centralina elettrica.\n\n|Obiettivo 2: - Disattiva il GPS e il pilota automatico\n\nDisattivando il sistema di orientamento GPS e il pilota automatico la nave inizierà ad allontanarsi dalla sua posizione. Se viene disattivato solo uno dei due, non sarà sufficiente ad impedire la continuazione delle operazioni sottomarine. Non ferire nessuno dei civili che incontri.\n\n|Obiettivo 3: - Attiva il sollevatore del Moon Pool\n\nQuesto attiverà il pilota automatico dell'unità sommergibile minore, richiamandola affinché tu ed Elvis possiate salire a bordo. I comandi sono nell'hangar.\n\n|Obiettivo 4: - Incontro e fuga con Elvis\n\nTrova Elvis e tornate al Moon Pool. Preparatevi per la fuga sul fondo oceanico a bordo di questo piccolo sommergibile.\n\nFINE\n",
        "fr": "|Briefing - \n\nLes conspirateurs ont détourné le Pelagic II et ont entamé d'importantes opérations sous-marines dans l'Océan Pacifique. La dataDyne et leurs mystérieux alliés semblent être impliqués dans une manoeuvre de coopération.\n\n|Carrington - \n\nBien que cette action semble maladroite, elle met en évidence l'importance de cette zone sous-marine aux yeux de la dataDyne et de ses alliés. Contrecarrez du mieux que vous pouvez l'opération tout en respectant notre protocole de sauvegarde des civils.\n\n|Objectif 1: - Désactiver source d'énergie principale\n\nLa coupure du générateur principal fera dériver le vaisseau de sa zone d'opération mais provoqua des blackouts dans les sections secondaires de l'appareil. Utilisez un scanner rayons X pour trouver les interrupteurs sur le générateur.\n\n|Objectif 2: - Désactiver GPS et Auto-pilote\n\nDébrancher le système de localisation GPS et l'auto-pilote du vaisseau le fera s'écarter de la station. Si seulement l'un des deux est éteint, les opérations de plongée ne seront pas perturbées et suivront leur cours. Epargnez les civils.\n\n|Objectif 3: - Activer l'ascenseur du sas\n\nCeci enclenchera le pilote automatique du submersible, ramenant celui-ci pour vous et Elvis. Les commandes se trouvent dans le hangar du sous-marin.\n\n|Objectif 4: - Retrouver Elvis et s'enfuir avec lui\n\nTrouvez Elvis et retournez au sas pour préparer le submersible et votre équipement pour une plongée.\n\nFIN\n",
        "de": "|Hintergrund - \n\nDie Verschwörer haben ihre Deckung fallen gelassen und einen Akt der Piraterie eingeleitet. Die Pelagic II wurde geentert und führt nun ein Tiefsee-Tauchmanöver im Pazifischen Ozean durch. Sowohl dataDyne als auch ihre eigenartigen Verbündeten scheinen in diese Operation verwickelt zu sein.\n\n|Carrington - \n\nObwohl dieser Schritt sehr leichtsinnig erscheint, zeigt diese Maßnahme, wie wichtig diese Tiefsee-Operation für die dataDyne-Gruppe und ihre Verbündeten sein muss. Ihre Aufgabe ist es, diese Operation zu stören. Bedenken Sie aber auch unsere Verhaltensregeln gegenüber unbeteiligten Personen.\n\n|1. Ziel: - Setzen Sie den Generator außer Kraft!\n\nDurch die Abschaltung des Generators wird das Schiff gezwungen, das Operationsgebiet zu verlassen. Allerdings führt der Energieverlust in manchen Teilen des Schiffs auch zu Blackouts. Setzen Sie den Röntgen-Scanner ein, um die aktiven Schalter zu finden.\n\n|2. Ziel: - Deaktivieren Sie das GPS und den Autopiloten!\n\nEs ist erforderlich, das GPS-Ortungssystem und den Autopiloten zu deaktivieren. Ohne die Unterstützung dieser Systeme beginnt das Schiff abzudriften. Die Abschaltung von nur einem System reicht nicht aus, die Fortführung der Operation zu unterbrechen. Zivilisten dürfen auf keinen Fall zu Schaden kommen.\n\n|3. Ziel: - Aktivieren Sie den Moon Pool-Aufzug!\n\nDie Steuerungselemente für das Tauchschiff befinden sich im Tiefhangar. Wenn Sie den Autopiloten des Tauchschiffs aktivieren, gelangt es für Sie und Elvis in Reichweite.\n\n|4. Ziel: - Treffen Sie sich mit Elvis und flüchten Sie gemeinsam!\n\nFinden Sie Elvis und kehren Sie mit ihm zum Moon Pool zurück. Bereiten Sie dort sich selbst und das Tauchschiff für den Tauchgang zum Meeresgrund vor.\n\nENDE\n",
        "es": "|Antecedentes - \n\nLos conspiradores han echado la precaución por la borda y han cometido un acto de piratería, tomando el Pelagic II y comenzando a toda velocidad operaciones submarinas en el Océano Pacífico. Ambos, dataDyne y sus extraños aliados, están envueltos en lo que parece una operación conjunta.\n\n|Carrington - \n\nAunque este movimiento parece insensato, sólo sirve para mostrar lo importante que esta operación en el fondo marino debe ser para dataDyne y sus aliados. Interrumpe la operación tanto como sea posible, pero recuerda nuestras reglas de fuerza mínima para los no combatientes.\n\n|Objetivo Uno: - Desactivar la Fuente Primaria de Energía\n\nApagar la fuente primaria de energía puede causar que el navío se aparte de la zona de operaciones, pero también puede causar apagones en secciones no esenciales de la nave. Usa el escáner de rayos-x para encontrar los interruptores activos en el núcleo de energía.\n\n|Objectivo Dos: - Desactivar el GPS y el Piloto Automático\n\nApagar tanto el sistema de localización GPS como el piloto automático de la nave causará que el barco quede 'dormido'; si solamente uno es apagado, no será suficiente para evitar que las operaciones submarinas continúen. No hieras a los civiles con los que te cruces.\n\n|Objetivo Tres: - Activar el Ascensor de la Piscina\n\nEsto activará el piloto automático del sumergible de profundidad, trayéndolo de vuelta para que lo uséis Elvis y tú. Los controles están en el sub-hangar.\n\n|Objetivo Cuatro: - Encontrar y Escapar con Elvis\n\nEncuentra a Elvis y regresa a la Piscina donde debéis preparar el sumergible y a vosotros mismos para sumergiros hacia el fondo marino.\n\nFIN\n"
    },
    {
        "id": "L_DAM_003",
        "en": "|Background - \n\nThe conspirators have thrown caution to the winds and have committed an act of piracy, taking over the Pelagic II and commencing hurried diving operations in the Pacific Ocean. Both dataDyne and its strange allies are involved in what appears to be a joint operation.\n\n|Carrington - \n\nAlthough this move seems reckless, it only serves to highlight how important the operation on the seabed must be to dataDyne and its allies. Disrupt the operation as extensively as possible, but remember our minimum force rules for noncombatants.\n\n|Objective One: - Disable Primary Power Source\n\nShutting down the primary power source will help cause the ship to wander from the operating location, but it will also cause blackouts in nonessential sections of the ship. Use the x-ray scanner to find the active switches on the power core.\n\n|Objective Two: - Deactivate GPS and Autopilot\n\nGetting both the GPS location system and the ship's autopilot offline will cause the ship to drift off station; if only one is shut down, it will not be enough to prevent the diving operations from continuing. Do not harm any innocent civilians you come across.\n\n|Objective Three: - Rendezvous and Escape With Elvis\n\nFind Elvis and return to the Moon Pool to prep both the deep submersible and yourselves for the dive to the seafloor.\n\nEND\n",
        "gb": "|Background - \n\nThe conspirators have thrown caution to the winds and have committed an act of piracy, taking over the Pelagic II and commencing hurried diving operations in the Pacific Ocean. Both dataDyne and its strange allies are involved in what appears to be a joint operation.\n\n|Carrington - \n\nAlthough this move seems reckless, it only serves to highlight how important the operation on the seabed must be to dataDyne and its allies. Disrupt the operation as extensively as possible, but remember our minimum force rules for noncombatants.\n\n|Objective One: - Disable Primary Power Source\n\nShutting down the primary power source will help cause the ship to wander from the operating location, but it will also cause blackouts in nonessential sections of the ship. Use the x-ray scanner to find the active switches on the power core.\n\n|Objective Two: - Deactivate GPS and Autopilot\n\nGetting both the GPS location system and the ship's autopilot offline will cause the ship to drift off station; if only one is shut down, it will not be enough to prevent the diving operations from continuing. Do not harm any innocent civilians you come across.\n\n|Objective Three: - Rendezvous and Escape With Elvis\n\nFind Elvis and return to the Moon Pool to prep both the deep submersible and yourselves for the dive to the seafloor.\n\nEND\n",
        "jp": "|Background - \n\nThe conspirators have thrown caution to the winds and have committed an act of piracy, taking over the Pelagic 2 and commencing hurried diving operations in the Pacific Ocean. Both dataDyne and their strange allies are involved in what appears to be a joint operation.\n\n|Carrington - \n\nAlthough this move seems reckless, it only serves to highlight how important the operation on the seabed must be to dataDyne and their allies. Disrupt the operation as extensively as possible but remember our minimum force rules for non-combatants.\n\n|Objective One: - Disable Primary Power Source\n\nShutting down the Primary Power Source will help cause the ship to wander from the operating location, but it will also cause blackouts in non-essential sections of the ship.\n\n|Objective Two: - Deactivate GPS And AutoPilot\n\ngetting both the GPS location system and the ship's Autopilot offline will cause the ship to drift off station; if only one is shut down it will not be enough to prevent the diving operations from continuing.\n\n|Objective Three: - Rendezvous And Escape With Elvis\n\nfind Elvis and return to the Moon pool to prep both the deep submersible and yourselves for the dive to the seafloor.\n\nEND\n",
        "it": "|Situazione - \n\nRischiando il tutto per tutto, i cospiratori in un atto di pirateria hanno preso il comando del Pelagic II e hanno dato inizio a frettolose operazioni sottomarine nell'Oceano Pacifico. Sia la dataDyne che i suoi strani alleati sono coinvolti in quella che ha tutto l'aspetto di un'operazione congiunta.\n\n|Carrington - \n\nPer quanto la loro mossa possa sembrare avventata, in realtà non fa altro che confermare l'importanza delle operazioni sul fondo oceanico per la dataDyne e i suoi alleati. Ostacola le operazioni quanto più possibile, ma tenendo sempre presente la regola del ricorso minimo alla violenza contro i civili.\n\n|Obiettivo 1: - Disattiva la fonte d'energia primaria\n\nLa chiusura della fonte d'energia primaria permetterà lo spostamento del sottomarino dalla sua posizione operativa, ma interromperà anche l'erogazione energetica a settori non essenziali del sommergibile. Usa lo scanner a raggi X per trovare gli interruttori attivi nella centralina elettrica.\n\n|Obiettivo 2: - Disattiva il GPS e il pilota automatico\n\nDisattivando il sistema di orientamento GPS e il pilota automatico la nave inizierà ad allontanarsi dalla sua posizione. Se viene disattivato solo uno dei due, non sarà sufficiente ad impedire la continuazione delle operazioni sottomarine. Non ferire nessuno dei civili che incontri.\n\n|Obiettivo 3: - Incontro e fuga con Elvis\n\nTrova Elvis e tornate al Moon Pool. Preparatevi per la fuga sul fondo oceanico a bordo di questo piccolo sommergibile.\n\nFINE\n",
        "fr": "|Briefing - \n\nLes conspirateurs ont détourné le Pelagic II et ont entamé d'importantes opérations sous-marines dans l'Océan Pacifique. La dataDyne et leurs mystérieux alliés semblent être impliqués dans une manoeuvre de coopération.\n\n|Carrington - \n\nBien que cette action semble maladroite, elle met en évidence l'importance de cette zone sous-marine aux yeux de la dataDyne et de ses alliés. Contrecarrez du mieux que vous pouvez l'opération tout en respectant notre protocole de sauvegarde des civils.\n\n|Objectif 1: - Désactiver source d'énergie principale\n\nLa coupure du générateur principal fera dériver le vaisseau de sa zone d'opération mais provoqua des blackouts dans les sections secondaires de l'appareil. Utilisez un scanner rayons X pour trouver les interrupteurs sur le générateur.\n\n|Objectif 2: - Désactiver GPS et Auto-pilote\n\nDébrancher le système de localisation GPS et l'auto-pilote du vaisseau le fera s'écarter de la station. Si seulement l'un des deux est éteint, les opérations de plongée ne seront pas perturbées et suivront leur cours. Epargnez les civils.\n\n|Objectif 3: - Retrouver Elvis et s'enfuir avec lui\n\nTrouvez Elvis et retournez au sas pour préparer le submersible et votre équipement pour une plongée.\n\nFIN\n",
        "de": "|Hintergrund - \n\nDie Verschwörer haben ihre Deckung fallen gelassen und einen Akt der Piraterie eingeleitet. Die Pelagic II wurde geentert und führt nun ein Tiefsee-Tauchmanöver im Pazifischen Ozean durch. Sowohl dataDyne als auch ihre eigenartigen Verbündeten scheinen in diese Operation verwickelt zu sein.\n\n|Carrington - \n\nObwohl dieser Schritt sehr leichtsinnig erscheint, zeigt diese Maßnahme, wie wichtig diese Tiefsee-Operation für die dataDyne-Gruppe und ihre Verbündeten sein muss. Ihre Aufgabe ist es, diese Operation zu stören. Bedenken Sie aber auch unsere Verhaltensregeln gegenüber unbeteiligten Personen.\n\n|1. Ziel: - Setzen Sie den Generator außer Kraft!\n\nDurch die Abschaltung des Generators wird das Schiff gezwungen, das Operationsgebiet zu verlassen. Allerdings führt der Energieverlust in manchen Teilen des Schiffs auch zu Blackouts. Setzen Sie den Röntgen-Scanner ein, um die aktiven Schalter zu finden.\n\n|2. Ziel: - Deaktivieren Sie das GPS und den Autopiloten!\n\nEs ist erforderlich, das GPS-Ortungssystem und den Autopiloten zu deaktivieren. Ohne die Unterstützung dieser Systeme beginnt das Schiff abzudriften. Die Abschaltung von nur einem System reicht nicht aus, die Fortführung der Operation zu unterbrechen. Zivilisten dürfen auf keinen Fall zu Schaden kommen.\n\n|3. Ziel: - Treffen Sie sich mit Elvis und flüchten Sie gemeinsam!\n\nFinden Sie Elvis und kehren Sie mit ihm zum Moon Pool zurück. Bereiten Sie dort sich selbst und das Tauchschiff für den Tauchgang zum Meeresgrund vor.\n\nENDE\n",
        "es": "|Antecedentes - \n\nLos conspiradores han echado la precaución por la borda y han cometido un acto de piratería, tomando el Pelagic II y comenzando a toda velocidad operaciones submarinas en el Océano Pacífico. Ambos, dataDyne y sus extraños aliados, están envueltos en lo que parece una operación conjunta.\n\n|Carrington - \n\nAunque este movimiento parece insensato, sólo sirve para mostrar lo importante que esta operación en el fondo marino debe ser para dataDyne y sus aliados. Interrumpe la operación tanto como sea posible, pero recuerda nuestras reglas de fuerza mínima para los no combatientes.\n\n|Objetivo Uno: - Desactivar la Fuente Primaria de Energía\n\nApagar la fuente primaria de energía puede causar que el navío se aparte de la zona de operaciones, pero también puede causar apagones en secciones no esenciales de la nave. Usa el escáner de rayos-x para encontrar los interruptores activos en el núcleo de energía.\n\n|Objectivo Dos: - Desactivar el GPS y el Piloto Automático\n\nApagar tanto el sistema de localización GPS como el piloto automático de la nave causará que el barco quede 'dormido'; si solamente uno es apagado, no será suficiente para evitar que las operaciones submarinas continúen. No hieras a los civiles con los que te cruces.\n\n|Objetivo Tres: - Encontrar y Escapar con Elvis\n\nEncuentra a Elvis y regresa a la Piscina donde debéis preparar el sumergible y a vosotros mismos para sumergiros hacia el fondo marino.\n\nFIN\n"
    },
    {
        "id": "L_DAM_004",
        "en": "\n",
        "gb": "\n",
        "jp": "\n",
        "it": "\n",
        "fr": "\n",
        "de": "\n",
        "es": "\n"
    },
    {
        "id": "L_DAM_005",
        "en": "Deactivate GPS and autopilot\n",
        "gb": "Deactivate GPS and autopilot\n",
        "jp": "Deactivate GPS And AutoPilot\n",
        "it": "Disattiva il GPS e il pilota automatico\n",
        "fr": "Désactiver GPS et Auto-pilote\n",
        "de": "Deaktivieren Sie den Autopiloten!\n",
        "es": "Desactivar GPS y piloto automático\n"
    },
    {
        "id": "L_DAM_006",
        "en": "Disable primary power source\n",
        "gb": "Disable primary power source\n",
        "jp": "Disable Primary Power Source\n",
        "it": "Disattiva la fonte d'energia primaria\n",
        "fr": "Désactiver source d'énergie principale\n",
        "de": "Setzen Sie den Generator außer Kraft!\n",
        "es": "Desactivar fuente primaria de energía\n"
    },
    {
        "id": "L_DAM_007",
        "en": "Secure laboratories and research data\n",
        "gb": "Secure laboratories and research data\n",
        "jp": "Secure Laboratories And Research Data\n",
        "it": "Chiudi a chiave i laboratori\n",
        "fr": "Sécuriser labos et données de recherche\n",
        "de": "Sichern Sie die Daten!\n",
        "es": "Asegurar laboratorios y datos\n"
    },
    {
        "id": "L_DAM_008",
        "en": "Activate Moon Pool lift\n",
        "gb": "Activate Moon Pool lift\n",
        "jp": "Activate Moon Pool Lift\n",
        "it": "Attiva il sollevatore del Moon Pool\n",
        "fr": "Activer l'ascenseur du sas\n",
        "de": "Aktivieren Sie den Moon Pool-Aufzug!\n",
        "es": "Activar el ascensor de la piscina\n"
    },
    {
        "id": "L_DAM_009",
        "en": "Rendezvous and escape with Elvis\n",
        "gb": "Rendezvous and escape with Elvis\n",
        "jp": "Rendezvous And Escape With Elvis\n",
        "it": "Incontro e fuga con Elvis\n",
        "fr": "Retrouver Elvis et s'enfuir avec lui\n",
        "de": "Flüchten Sie gemeinsam mit Elvis!\n",
        "es": "Encontrar y escapar con Elvis\n"
    },
    {
        "id": "L_DAM_010",
        "en": "Cripple the engines and the ship will \ndrift... Perfect!\n",
        "gb": "Cripple the engines and the ship will \ndrift... Perfect!\n",
        "jp": "Cripple the engines and the ship will \ndrift... Perfect!\n",
        "it": "Disattivando il motore il sottomarino\n andrà alla deriva... Perfetto!\n",
        "fr": "On sabote les moteurs et le vaisseau \ndérivera... Parfait!\n",
        "de": "Leg die Maschinen lahm, dann \ndriftet das Schiff ab... Perfekt!\n",
        "es": "Estropea los motores y la nave irá \na la deriva... ¡Perfecto!\n"
    },
    {
        "id": "L_DAM_011",
        "en": "This must be where the sub's controlled from.\n",
        "gb": "This must be where the sub's controlled from.\n",
        "jp": "This must be where the sub's controlled from.\n",
        "it": "Ah, ecco da dove si controlla il sommergibile!\n",
        "fr": "Le sous-marin doit être contrôlé d'ici.\n",
        "de": "Von hier aus wird das Schiff gesteuert.\n",
        "es": "Desde aquí se debe controlar el submarino.\n"
    },
    {
        "id": "L_DAM_012",
        "en": "Without the autopilot and the GPS, the ship \nwill wander off station.\n",
        "gb": "Without the autopilot and the GPS, the ship \nwill wander off station.\n",
        "jp": "Without the autopilot and the GPS, the ship\nwill wander off station.\n",
        "it": "Senza il pilota automatico e il GPS, il sottomarino \nsi allontanerà dalla sua posizione.\n",
        "fr": "Sans auto-pilote ni GPS, l'appareil \ns'éloignera de la station.\n",
        "de": "Ohne Autopilot und GPS kann das Schiff \nseine Position nicht halten.\n",
        "es": "Sin el piloto automático y el GPS, la nave \ndeambulará fuera de la estación.\n"
    },
    {
        "id": "L_DAM_013",
        "en": "They'll be unable to conduct any operations \nwithout any power.\n",
        "gb": "They'll be unable to conduct any operations \nwithout any power.\n",
        "jp": "They'll be unable to conduct any operations\nwithout any power.\n",
        "it": "Senza energia non riusciranno a \ncondurre nessuna operazione.\n",
        "fr": "Ils ne pourront plus continuer l'opération \nsans énergie.\n",
        "de": "Das Schiff wird ohne Stromzufuhr völlig \nnavigationsunfähig sein.\n",
        "es": "No podrán realizar ninguna operación \nsin energía.\n"
    },
    {
        "id": "L_DAM_014",
        "en": "Autopilot system has been deactivated.\n",
        "gb": "Autopilot system has been deactivated.\n",
        "jp": "Autopilot System Has Been Deactivated.\n",
        "it": "Disattivato pilota automatico.\n",
        "fr": "Système auto-pilote désactivé.\n",
        "de": "Autopilot wurde deaktiviert.\n",
        "es": "El sistema de piloto automático ha sido desactivado.\n"
    },
    {
        "id": "L_DAM_015",
        "en": "GPS system has been deactivated.\n",
        "gb": "GPS system has been deactivated.\n",
        "jp": "GPS System Has Been Deactivated.\n",
        "it": "Disattivato sistema GPS.\n",
        "fr": "Système GPS désactivé.\n",
        "de": "GPS-System wurde deaktiviert.\n",
        "es": "El sistema GPS ha sido desactivado.\n"
    },
    {
        "id": "L_DAM_016",
        "en": "Critical mission object has been destroyed.\n",
        "gb": "Critical mission object has been destroyed.\n",
        "jp": "Critical Mission Object Has Been Destroyed.\n",
        "it": "Distrutto strumento essenziale alla missione.\n",
        "fr": "Objet crucial détruit.\n",
        "de": "Wichtiges Objekt wurde zerstört.\n",
        "es": "Objeto crítico de la misión destruido.\n"
    },
    {
        "id": "L_DAM_017",
        "en": "Reactor shutdown control hatch opened.\n",
        "gb": "Reactor shutdown control hatch opened.\n",
        "jp": "Reactor Shutdown Control Hatch Opened.\n",
        "it": "Aperto sportello comandi del reattore.\n",
        "fr": "Porte de commande d'arrêt du réacteur ouverte.\n",
        "de": "Reaktor-Kontrollkonsole geöffnet.\n",
        "es": "Escotilla del control de apagado del reactor abierta.\n"
    },
    {
        "id": "L_DAM_018",
        "en": "Reactor has been shut down.\n",
        "gb": "Reactor has been shut down.\n",
        "jp": "Reactor Has Been Shut Down.\n",
        "it": "Disattivato il reattore.\n",
        "fr": "Réacteur désactivé.\n",
        "de": "Reaktor wurde abgeschaltet.\n",
        "es": "El reactor ha sido apagado.\n"
    },
    {
        "id": "L_DAM_019",
        "en": "Diving control center has been located.\n",
        "gb": "Diving control center has been located.\n",
        "jp": "Diving Control Centre Has Been Located.\n",
        "it": "Localizzato centro di comando immersione.\n",
        "fr": "Centre de contrôle de plongée localisé.\n",
        "de": "Tauch-Kontrollzentrum wurde geortet.\n",
        "es": "El centro de control de buceo ha sido localizado.\n"
    },
    {
        "id": "L_DAM_020",
        "en": "Critical mission personnel killed.\n",
        "gb": "Critical mission personnel killed.\n",
        "jp": "Critical Mission Personnel Killed.\n",
        "it": "Ucciso personale essenziale alla missione.\n",
        "fr": "Personnel crucial abattu.\n",
        "de": "Wichtige Person neutralisiert.\n",
        "es": "Ha muerto personal crítico de la misión.\n"
    },
    {
        "id": "L_DAM_021",
        "en": "Research data has been secured.\n",
        "gb": "Research data has been secured.\n",
        "jp": "Research Data Has Been Secured.\n",
        "it": "I dati di ricerca sono al sicuro.\n",
        "fr": "Données de recherche sécurisées.\n",
        "de": "Forschungsdaten wurden gesichert.\n",
        "es": "Datos de investigación asegurados.\n"
    },
    {
        "id": "L_DAM_022",
        "en": "\n",
        "gb": "\n",
        "jp": "\n",
        "it": "\n",
        "fr": "\n",
        "de": "\n",
        "es": "\n"
    },
    {
        "id": "L_DAM_023",
        "en": "\n",
        "gb": "\n",
        "jp": "\n",
        "it": "\n",
        "fr": "\n",
        "de": "\n",
        "es": "\n"
    },
    {
        "id": "L_DAM_024",
        "en": "Research data disk\n",
        "gb": "Research data disk\n",
        "jp": "Research Data Disk\n",
        "it": "Disco dati di ricerca\n",
        "fr": "Disque de recherche\n",
        "de": "Sicherungsdiskette\n",
        "es": "Disco de datos de investigación\n"
    },
    {
        "id": "L_DAM_025",
        "en": "A research data disk\n",
        "gb": "A research data disk\n",
        "jp": "A Research Data Disk\n",
        "it": "Disco dati di ricerca\n",
        "fr": "Un disque de recherche\n",
        "de": "Eine Sicherungsdiskette\n",
        "es": "Un disco de datos de investigación\n"
    },
    {
        "id": "L_DAM_026",
        "en": "Picked up a research data disk.\n",
        "gb": "Picked up a research data disk.\n",
        "jp": "Picked up a Research Data Disk\n",
        "it": "Preso disco dati di ricerca.\n",
        "fr": "Disque de recherche obtenu.\n",
        "de": "Sicherungsdiskette aufgenommen.\n",
        "es": "Disco de datos de investigación obtenido.\n"
    },
    {
        "id": "L_DAM_027",
        "en": "Critical mission personnel have been killed.\n",
        "gb": "Critical mission personnel have been killed.\n",
        "jp": "Critical Mission Personnel Have Been Killed.\n",
        "it": "Ucciso personale essenziale alla missione.\n",
        "fr": "Personnel crucial abattu.\n",
        "de": "Wichtige Personen wurden neutralisiert.\n",
        "es": "Ha muerto personal crítico de la misión.\n"
    },
    {
        "id": "L_DAM_028",
        "en": "Lift door has been unlocked.\n",
        "gb": "Lift door has been unlocked.\n",
        "jp": "LIft Door Has Been Unlocked.\n",
        "it": "Aperta porta sollevatore.\n",
        "fr": "Porte ascenseur déverrouillée.\n",
        "de": "Aufzugstür wurde entriegelt.\n",
        "es": "La puerta del ascensor ha sido abierta.\n"
    },
    {
        "id": "L_DAM_029",
        "en": "Lift has been activated.\n",
        "gb": "Lift has been activated.\n",
        "jp": "LIft Has Been Activated.\n",
        "it": "Attivato sollevatore.\n",
        "fr": "Ascenseur activé.\n",
        "de": "Aufzug wurde aktiviert.\n",
        "es": "El ascensor ha sido activado.\n"
    },
    {
        "id": "L_DAM_030",
        "en": "Operation denied - hangar doors still closed.\n",
        "gb": "Operation denied - hangar doors still closed.\n",
        "jp": "Operation Denied - Hangar Doors Still Closed.\n",
        "it": "Operazione impossibile - Porte hangar ancora chiuse.\n",
        "fr": "Opération refusée - portes du hangar fermées.\n",
        "de": "Unzulässige Operation - Die Hangartüren sind noch geschlossen.\n",
        "es": "Operación denegada: puertas del hangar todavía cerradas.\n"
    },
    {
        "id": "L_DAM_031",
        "en": "Unlocking sequence has been reset.\n",
        "gb": "Unlocking sequence has been reset.\n",
        "jp": "Unlocking Sequence Has Been Reset.\n",
        "it": "La sequenza di sblocco è stata resettata.\n",
        "fr": "Séquence de déverrouillage réinitialisée.\n",
        "de": "Entriegelungssequenz wurde abgebrochen.\n",
        "es": "La secuencia de desbloqueo ha sido reinicializada.\n"
    },
    {
        "id": "L_DAM_032",
        "en": "You go on ahead, Jo. I'll secure the perimeter. \nWe'll meet up later.\n",
        "gb": "You go on ahead, Jo. I'll secure the perimeter. \nWe'll meet up later.\n",
        "jp": "You go on ahead Jo, I'll secure the perimeter.\nWe'll meet up later.\n",
        "it": "Va avanti tu, Jo. Io ti copro le spalle! \nCi vediamo dopo!\n",
        "fr": "Vas-y. Je sécurise le périmètre.\nOn se retrouve plus tard.\n",
        "de": "Du gehst voraus, Jo. Ich sichere das Gelände. \nWir treffen uns später.\n",
        "es": "Ve delante, Joanna. Aseguraré el perímetro. \nNos vemos más tarde.\n"
    },
    {
        "id": "L_DAM_033",
        "en": "Elvis has been killed.\n",
        "gb": "Elvis has been killed.\n",
        "jp": "Elvis Has Been Killed.\n",
        "it": "Elvis è stato ucciso.\n",
        "fr": "Elvis a été abattu.\n",
        "de": "Elvis wurde neutralisiert.\n",
        "es": "Elvis ha muerto.\n"
    },
    {
        "id": "L_DAM_034",
        "en": "Joanna... What took you so long? Follow me - \nlet's get out of this old tub.\n",
        "gb": "Joanna... What took you so long? Follow me - \nlet's get out of this old tub.\n",
        "jp": "Joanna..what took you so long?. Follow me,\nlets get out of this old tub.\n",
        "it": "Joanna, qualche problema? Dai, seguimi, \nusciamo da 'sta bagnarola!\n",
        "fr": "Qu'est-ce que tu faisais? Suis-moi...\nOn décampe.\n",
        "de": "Joanna... Was hat dich aufgehalten? Folge mir! \nLass uns von dieser Rostschüssel verschwinden.\n",
        "es": "Joanna... ¿Por qué has tardado tanto? Sígueme. \nSalgamos de esta vieja bañera.\n"
    },
    {
        "id": "L_DAM_035",
        "en": "Civilians have been killed.\n",
        "gb": "Civilians have been killed.\n",
        "jp": "Civilians Have Been Killed.\n",
        "it": "Uccisi dei civili.\n",
        "fr": "Des civils ont été abattus.\n",
        "de": "Zivile Verluste!!!\n",
        "es": "Han muerto civiles.\n"
    },
    {
        "id": "L_DAM_036",
        "en": "Critical mission object has been destroyed.\n",
        "gb": "Critical mission object has been destroyed.\n",
        "jp": "Critical Mission Objects Has Been Destroyed.\n",
        "it": "Distrutto strumento essenziale alla missione.\n",
        "fr": "Objet crucial détruit.\n",
        "de": "Wichtiges Objekt wurde zerstört.\n",
        "es": "Objeto crítico de la misión destruido.\n"
    },
    {
        "id": "L_DAM_037",
        "en": "Alarm has been activated.\n",
        "gb": "Alarm has been activated.\n",
        "jp": "Alarm Has Been Activated.\n",
        "it": "Attivato allarme.\n",
        "fr": "Alarme activée.\n",
        "de": "Alarm wurde aktiviert.\n",
        "es": "La alarma ha sido activada.\n"
    },
    {
        "id": "L_DAM_038",
        "en": "Alarm has been deactivated.\n",
        "gb": "Alarm has been deactivated.\n",
        "jp": "Alarm Has Been De-Activated.\n",
        "it": "Disattivato allarme.\n",
        "fr": "Alarme désactivée.\n",
        "de": "Alarm wurde deaktiviert.\n",
        "es": "La alarma ha sido desactivada.\n"
    },
    {
        "id": "L_DAM_039",
        "en": "Right. The diving operation has been disrupted on the surface. \nTime for a swim.\n",
        "gb": "Right. The diving operation has been disrupted on the surface. \nTime for a swim.\n",
        "jp": "Right. The diving operation has been disrupted on the surface. Time for a swim.",
        "it": "Bene. Sembra proprio che le operazioni \ndi immersione siano finite per ora! \nFacciamoci una nuotata...\n",
        "fr": "Bien. L'opération de plongée a été annulée à la surface.\nIl est temps de piquer une tête.\n",
        "de": "Korrekt. Die Operation wurde an der Oberfläche unterbrochen.\nZeit für ein wenig Badevergnügen.\n",
        "es": "Correcto. La operación de buceo ha sido desbaratada en la superficie. \nEs la hora del baño.\n"
    },
    {
        "id": "L_DAM_040",
        "en": "I hope the government don't want to use this ship anytime soon.\n",
        "gb": "I hope the government don't want to use this ship anytime soon.\n",
        "jp": "I hope the government don't want to use this ship anytime soon.",
        "it": "Spero bene che il governo non intenda usare questo sottomarino tanto presto!\n",
        "fr": "J'espère que le gouvernement ne compte pas utiliser ce vaisseau tout de suite.\n",
        "de": "Ich hoffe, die Regierung will dieses Schiff so rasch nicht benutzen.\n",
        "es": "Espero que el gobierno no quiera usar esta nave en breve.\n"
    },
    {
        "id": "L_DAM_041",
        "en": "Do you think we were a little heavy-handed?\n",
        "gb": "Do you think we were a little heavy-handed?\n",
        "jp": "Do you think we were a little heavy-handed?",
        "it": "Dici che abbiamo avuto un po'\ntroppo la mano pesante?\n",
        "fr": "On y est allé un peu fort, non?\n",
        "de": "Glaubst du, wir waren ein wenig zu grob?\n",
        "es": "¿Piensas que fuimos un poquito torpes?\n"
    },
    {
        "id": "L_DAM_042",
        "en": "Naaahhhh.\n",
        "gb": "Naaahhhh.\n",
        "jp": "Naaahhhh.",
        "it": "Ma va là!!!\n",
        "fr": "Mais non.\n",
        "de": "Ach, stell Dich nicht so mädchenhaft an!\n",
        "es": "Nooohhhh.\n"
    },
    {
        "id": "L_DAM_043",
        "en": "Pull the plug on that now.\n",
        "gb": "Pull the plug on that now.\n",
        "jp": null,
        "it": "E ora stacca la spina!\n",
        "fr": "Débranche ce truc.\n",
        "de": "Zieh den Stecker raus!\n",
        "es": "Tira del enchufe ahora.\n"
    },
    {
        "id": "L_DAM_044",
        "en": "Switch this thing off.\n",
        "gb": "Switch this thing off.\n",
        "jp": null,
        "it": "Spegni 'sto coso!\n",
        "fr": "Eteins-moi ça.\n",
        "de": "Schalte das Ding ab!\n",
        "es": "Apaga esa cosa.\n"
    },
    {
        "id": "L_DAM_045",
        "en": "I'll shut it down.\n",
        "gb": "I'll shut it down.\n",
        "jp": null,
        "it": "Ora lo chiudo!\n",
        "fr": "Je vais l'éteindre.\n",
        "de": "Ich schalte es ab.\n",
        "es": "Lo apagaré.\n"
    },
    {
        "id": "L_DAM_046",
        "en": "Please don't hurt me.\n",
        "gb": "Please don't hurt me.\n",
        "jp": null,
        "it": "Non farmi del male!\n",
        "fr": "Ne me faites pas de mal!\n",
        "de": "Bitte tu mir nichts.\n",
        "es": "Por favor, no me hagas daño.\n"
    },
    {
        "id": "L_DAM_047",
        "en": "Die, you traitors.\n",
        "gb": "Die, you traitors.\n",
        "jp": null,
        "it": "Crepa, traditore!\n",
        "fr": "Crevez, charognes!\n",
        "de": "Jetzt seid ihr dran, Verräter.\n",
        "es": "Morid, traidores...\n"
    }
]
