[
    {
        "id": "L_SHO_000",
        "en": "|Background - \n\nThe hidden heart of the Skedar religion is exposed at last - a desert planet burning under three suns. The leader of the Skedar terrorist faction is based at the Battle Shrine on the surface of the planet. The destruction of the Shrine and the death of their leader would break the morale of the Skedar.\n\n|Carrington - Not Available.\n\n|Elvis - \n\nThere's some groundwork to do, Joanna - I need parts of the temple marked as targets for bombardment. And we need to be absolutely certain that the Skedar leader is dead. He is sure to have powerful shielding capable of withstanding gunfire, so you may need to destroy part of the shrine itself to deal the final blow.\n\n|Objective One: - Identify Temple Targets\n\nAttach a targeting device to each of three obelisks on the surface. They form part of a damaged but still functional shield generator that might cause part of the Shrine to escape the bombardment. Use the R-Tracker to identify the correct ones.\n\n|Objective Two: - Activate Bridge\n\nYou may have to blow a hole in the outer wall just to gain access to the shrine interior - your IR scanner should help find a weak spot in the structure. Once inside the perimeter, there's another problem. Apparently caused many years ago by one of the earthquakes which plague the planet, a deep ravine cuts the Inner Sanctum area off from the rest of the Shrine. The Skedar have made a retractable bridge to provide access, but you can guarantee it will be well guarded.\n\n|Objective Three: - Gain Access to Inner Sanctum\n\nSearch through the maze of underground corridors to find the Inner Sanctum. Expect resistance to be fierce, fanatical even. This is a shrine to war, and they are very devout in their worship.\n\n|Objective Four: - Destroy Secret Skedar Army\n\nThe Maian High Command suspects that more Skedar warriors are kept in stasis in unknown locations. This could be one of those places. If it is, destroy them. The last thing we need to face now is a stream of psychotic reinforcements.\n\n|Objective Five: - Assassinate Skedar Leader\n\nThe leader is a warrior much revered by the Skedar. His death will be a hammer blow to their morale and will mark the end of their warpath throughout the galaxy. Peace for all.\n\nEND\n",
        "gb": "|Background - \n\nThe hidden heart of the Skedar religion is exposed at last - a desert planet burning under three suns. The leader of the Skedar terrorist faction is based at the Battle Shrine on the surface of the planet. The destruction of the Shrine and the death of their leader would break the morale of the Skedar.\n\n|Carrington - Not Available.\n\n|Elvis - \n\nThere's some groundwork to do, Joanna - I need parts of the temple marked as targets for bombardment. And we need to be absolutely certain that the Skedar leader is dead. He is sure to have powerful shielding capable of withstanding gunfire, so you may need to destroy part of the shrine itself to deal the final blow.\n\n|Objective One: - Identify Temple Targets\n\nAttach a targeting device to each of three obelisks on the surface. They form part of a damaged but still functional shield generator that might cause part of the Shrine to escape the bombardment. Use the R-Tracker to identify the correct ones.\n\n|Objective Two: - Activate Bridge\n\nYou may have to blow a hole in the outer wall just to gain access to the shrine interior - your IR scanner should help find a weak spot in the structure. Once inside the perimeter, there's another problem. Apparently caused many years ago by one of the earthquakes which plague the planet, a deep ravine cuts the Inner Sanctum area off from the rest of the Shrine. The Skedar have made a retractable bridge to provide access, but you can guarantee it will be well guarded.\n\n|Objective Three: - Gain Access to Inner Sanctum\n\nSearch through the maze of underground corridors to find the Inner Sanctum. Expect resistance to be fierce, fanatical even. This is a shrine to war, and they are very devout in their worship.\n\n|Objective Four: - Destroy Secret Skedar Army\n\nThe Maian High Command suspects that more Skedar warriors are kept in stasis in unknown locations. This could be one of those places. If it is, destroy them. The last thing we need to face now is a stream of psychotic reinforcements.\n\n|Objective Five: - Assassinate Skedar Leader\n\nThe leader is a warrior much revered by the Skedar. His death will be a hammer blow to their morale and will mark the end of their warpath throughout the galaxy. Peace for all.\n\nEND\n",
        "jp": "|ステ\\h8284ジ\\h8287工：\n\nスケダ\\h8284の\\h84b7\\h84e9\\h8298がついに\\h82c8\\h82c9された。３つの\\h84f4\\h8787を\\h82d5つ\\h87c9き\\h87b7の\\h8794\\h86f8だ。スケダ\\h8284のキングはこの\\h86f8にある「\\h8291いの\\h8685\\h8686」にいるようだ。この\\h8685\\h8686を\\h82ce\\h82cfしキングを\\h82d9せば、\\h85b9された\\h8385\\h86ea\\h86ebのスケダ\\h8284たちに、もはや\\h8486の\\h84e9り\\h83e7は\\h83bcくなるのだ。\n\n|キャリントン：\n\n\\h84e3\\h859c\\h82a0\\h82a2\n\n|エルビス：\n\nキングにいどむ\\h839dにまずは\\h8298\\h87cb\\h83db\\h8291がある。\\h85a0\\h82b9な\\h85a3\\h82d7のために\\h8790しい\\h85c8\\h8295\\h84ec\\h84edが千\\h8383なんだ。\\h83c9\\h8483マ\\h8284カを\\h82f9ってよね。キングが\\h82b9\\h8584に\\h82d9れたことを\\h82c9\\h85dcける千\\h8383もあって、\\h83bc\\h87b0\\h83ffに\\h85a3\\h82d7するわけにはいかないのさ。ジョアンナ、キングはユ\\h8284に\\h82b5せたよ。ヤツのパワフルなシ\\h8284ルドは、\\h82e0\\h86f2では\\h86ccち\\h82ceれないかもしれない。トドメをさすには、\\h8685\\h8686そのものを\\h82cfす千\\h8383もあるかもしれない。\n\n|\\h82b5\\h82b6１：\\h83c9\\h8483マ\\h8284カを\\h839bり\\h82bbけよ\n\n\\h8298\\h87cbにいくつかあるオベリスク（\\h87b8\\h87b9）の\\h828e、まだ\\h83c2\\h82a2している\\h83b0３つに\\h83c9\\h8483マ\\h8284カを\\h839bり\\h82bbけてくれ。これらをマイアン\\h84a6が\\h85a0\\h82b9に\\h85a3\\h82d7・\\h82ce\\h82cfすれば、\\h8685\\h8686のシ\\h8284ルドは\\h83bcくなるだろう。\\h83c2\\h82a2しているオベリスクを\\h82c9\\h8398けるには、Ｒトラッカを\\h82f9うのだ。\n\n|\\h82b5\\h82b6２：ブリッジを\\h82c3\\h82c4せよ\n\n\\h8685\\h8686エリアの\\h82f6り\\h8280が\\h82c9\\h82d3たらないので、\\h86a7の\\h85feい\\h828f\\h8398を\\h82cfすのがいいだろう。\\h82c9つけるにはIRスキャンが\\h83e1\\h83dcだ。\\h8685\\h8686エリア\\h828e\\h828fも\\h87bbによって\\h8398\\h86e1されておりさらに\\h85aeの\\h87baなるエリアへ\\h82b7むには、\\h87bbを\\h84fcる千\\h8383がある。おそらくスケダ\\h8284たちは、そこにブリッジを\\h83dbっているはずだ。もし、\\h82c9\\h82d3たらなければどこかにスイッチの\\h83fb\\h8497をするものがあるだろう。しかしそこは、きびしい\\h8289\\h838eがなされているに\\h82feいない。\n\n|\\h82b5\\h82b6３：\\h8685\\h8686の\\h87baなるエリアに\\h82b7\\h82f6\n\nスケダ\\h8284のキングは\\h8685\\h8686の\\h82adも\\h87baなるエリアにいるだろう。そこへの\\h82f6り\\h8280は\\h82aaか\\h84ad\\h83ffなロックがされているかもしれない。ここは「\\h8291いの\\h8685\\h8686」だ。\\h8297の\\h82ed\\h82d7はさらに\\h82dfしいものになるに\\h82feいない。\n\n|\\h82b5\\h82b6４：エリ\\h8284ト\\h8291\\h85fdを\\h8385て\\h82d9せ\n\nマイアン\\h82ad\\h83de\\h87a3民\\h84a2の\\h84c6\\h85a7では、スケダ\\h8284のエリ\\h8284ト\\h8291\\h85fdたちが、\\h87baなるエリアのどこかに\\h82e7\\h83c2しているとのことだ。ヤツらに\\h829fくわした\\h8393は\\h8385て\\h82d9すのだ。\n\n|\\h82b5\\h82b6５：スケダ\\h8284のキングを\\h82d9せ\n\nキングとの\\h83bd\\h8291だ。キングはサイキックを\\h82f9ってスケダ\\h8284\\h8291\\h85fdを\\h83a8み\\h829fすことができ、ヤツのシ\\h8284ルドは\\h82e0\\h86f2では\\h86ccち\\h82ceれないであろう。ヤツを\\h82d9せば、\\h85b9された\\h8385\\h86ea\\h86ebのスケダ\\h8284への\\h83c7\\h85a5\\h8282も\\h83bcくなり、ヤツらの\\h8485\\h84afにピリオドが\\h86ccたれることになる。そして\\h8385てが\\h84f5\\h86b6になるのだ。\n\nEND\n",
        "it": "|Situazione:\n\nFinalmente è stato scoperto il fulcro della religione Skedar: un pianeta deserto, arso dal calore di tre soli. Il capo della fazione terroristica Skedar ha la sua roccaforte nel Tempio della Guerra sulla superficie del pianeta. La distruzione del tempio e la morte del loro capo implicherebbe la decadenza degli Skedar.\n\n|Carrington:\n\nIrreperibile.\n\n|Elvis:\n\nC'è da fare un po' di lavoro preliminare, Joanna! Bisogna contrassegnare vari settori del tempio come obiettivi per il bombardamento. Inoltre dobbiamo essere assolutamente sicuri che il capo degli Skedar sia morto stecchito! Sappiamo che dispone di uno scudo molto potente in grado di contrastare le armi da fuoco, quindi dovrai distruggere parte del tempio stesso in preparazione al colpo finale.\n\n|Obiettivo 1: - Identifica gli obiettivi nel tempio\n\nAttacca un bersaglio su ciascuno dei tre obelischi del tempio. Essi fanno parte del generatore degli scudi che è stato danneggiato, ma è ancora attivo e perciò in grado di proteggere parte del tempio dalla distruzione totale. Usa il puntatore-R per identificare gli obiettivi corretti.\n\n|Obiettivo 2: - Attiva il ponte retrattile\n\nPer riuscire ad accedere al tempio dovrai ricavare un passaggio nel muro esterno. Lo scanner a infrarossi ti aiuterà a scoprire un punto debole nella struttura muraria. All'interno ti attende un altro problema: la zona dove si erge il Santuario Interno è separata dal resto del tempio da un profondo abisso apparentemente causato molti secoli or sono da uno dei frequenti terremoti che affliggono il pianeta. Per raggiungere tale area gli Skedar hanno costruito un ponte retrattile, che sarà sicuramente sotto sorveglianza speciale.\n\n|Obiettivo 3: - Trova l'accesso al Santuario Interno\n\nInoltrati nel labirinto di corridoi sotterranei per trovare l'ingresso al Santuario Interno. Troverai una resistenza accanita e talvolta addirittura fanatica. Si tratta di un tempio dedicato alla guerra, costruito da creature estremamente devote al loro culto.\n\n|Obiettivo 4: - Distruggi l'esercito segreto Skedar \n\nIl Comandante Supremo Maian sospetta la presenza di altri guerrieri Skedar conservati in stasi in luoghi a noi ignoti e questo potrebbe essere uno di quelli, perciò lo dovrai distruggere. L'ultima cosa di cui abbiamo bisogno ora è un'orda di fanatici psicotici.\n\n|Obiettivo 5: - Elimina il capo degli Skedar\n\nIl capo è un guerriero particolarmente venerato dagli Skedar. La sua morte sarebbe un colpo fatale per questa civiltà e segnerebbe la fine del loro sentiero di guerra attraverso la galassia. Finalmente regnerà la pace!\n\nFINE\n",
        "fr": "|Briefing - \n\nNous avons enfin découvert le sanctuaire de la religion Skedar. Il se trouve sur une planète désertique. Le chef des terroristes Skedars se cache dans un Temple de la guerre situé à la surface de la planète. La destruction du Temple et l'élimination de leur chef pourrait semer le trouble dans leurs rangs.\n\n|Carrington - Indisponible.\n\n|Elvis - \n\nIl va falloir faire dans l'infiltration, Joanna. Je veux que tu marques des parties du Temple pour guider un bombardement stratégique. De plus, je veux être sûr de l'élimination du chef des Skedars.\n\n|Objectif 1: - Identifier les cibles du Temple\n\nPlace une balise de guidage sur les trois obélisques à la surface. Ils forment une sorte de générateur de bouclier énergétique qui serait susceptible de protéger le Temple des bombardements. Utilise un Pisteur-R pour identifier les objectifs valides.\n\n|Objectif 2: - Activer le pont\n\nApparemment, un gigantesque tremblement de terre aurait créé une fissure qui sépare le saint des saints de ce sanctuaire du reste du Temple. Les Skedars ont installé un gigantesque pont escamotable qui permet d'y accéder, nous pouvons seulement garantir qu'il sera extrêmement bien gardé.\n\n|Objectif 3: - Accéder au Centre du Sanctuaire\n\nTu dois parcourir et explorer le dédale de corridors pour trouver le Sanctuaire. Tu vas certainement te heurter à une résistance acharnée. Tu vas te déplacer dans le Temple de la guerre, et les Skedars sont des fanatiques. Ils ne se laisseront pas faire.\n\n|Objectif 4: - Eliminer l'armée Skedar\n\nLe haut commandement maian pense que des soldats skedars sont gardés dans des champs de stase à l'intérieur de cette installation. Si cela est vrai, il faudra les détruire. La dernière chose dont nous avons besoin c'est une armée de fanatiques psychotiques.\n\n|Objectif 5: - Assassiner le chef des Skedars\n\nLe chef est un puissant guerrier, vénéré par les Skedars. Sa mort perturbera leur moral et mettra certainement un terme à leur désir de conquête galactique. La paix pourra ainsi régner.\n\nFIN\n",
        "de": "|Hintergrund - \n\nDas versteckte Zentrum der Skedar-Religion ist nunmehr entdeckt. Es handelt sich um einen von Wüsten bedeckten Planeten, der von drei Sonnen beschienen wird. Der Anführer der terroristischen Skedar-Fraktion hält sich in einem Schrein auf der Oberfläche des Planeten auf. Die Zerstörung des Schreins und der Tod ihres Anführers würde die Moral der Skedar untergraben.\n\n|Carrington - Nicht verfügbar.\n\n|Elvis - \n\nEs gilt, ein bisschen Vorarbeit zu leisten, Joanna. Einige Teile des Tempels müssen für die Bombardierung als Ziele markiert werden. Außerdem müssen wir absolut sichergehen, dass der Anführer der Skedar nicht mehr am Leben ist. Es ist anzunehmen, dass er über einen starken Schutzschild verfügt, der jeglichem Beschuss standhält. Das bedeutet, dass Sie wohl einen Teil des Schreins zerstören müssen, um den Anführer zu besiegen.\n\n|1. Ziel: - Identifizieren Sie die Ziele!\n\nBefestigen Sie Peilgeräte an jedem der drei Obelisken auf der Oberfläche. Sie sind Bestandteil eines beschädigten, aber immer noch funktionstüchtigen Schildgenerators. Wird dieser nicht außer Kraft gesetzt, könnten Teile des Schreins dem Bombenhagel entgehen. Setzen Sie den Tracker ein, um die Ziele zu identifizieren.\n\n|2. Ziel: - Aktivieren Sie die Brücke!\n\nSie müssen ein Loch in die Außenmauer sprengen, um in das Innere des Schreins zu gelangen. Ihr IR-Scanner sollte in der Lage sein, eine Schwachstelle ausfindig zu machen. Sobald Sie diese Aufgabe erfüllt haben, ergibt sich ein weiteres Problem. Durch eines der Erdbeben, von welchen der Planet ständig erschüttert wird, ist ein tiefer Graben entstanden. Dadurch wird der innere Bereich vom Rest des Schreins abgeschnitten. Die Skedar haben eine ausfahrbare Brücke errichtet, um die beiden Gebiete miteinander zu verbinden. Sie müssen aber davon ausgehen, dass die Brücke streng bewacht wird.\n\n|3. Ziel: - Gelangen Sie in den inneren Bereich!\n\nEin unterirdisches Labyrinth führt in den inneren Bereich. Rechnen Sie mit starkem, wenn nicht gar fanatischem Widerstand. Letztendlich handelt es sich um einen Kriegsschrein, und die Skedar sind ausgesprochen gläubig.\n\n|4. Ziel: - Vernichten Sie die geheime Skedar-Armee!\n\nDas Hohe Kommando der Maianer vermutet, dass eine große Anzahl von sich in Stasis befindlichen Skedar an geheimen Orten untergebracht ist. Der Schrein könnte einer dieser Orte sein. Wenn das der Fall ist, muss er zerstört werden. Das Letzte, was wir jetzt brauchen können, ist ein nicht enden wollender Strom von psychotischen Fanatikern.\n\n|5. Ziel: - Eliminieren Sie den Anführer der Skedar!\n\nDer Anführer der Skedar genießt bei seinen Gefolgsleuten großes Ansehen. Sein Tod ist gleichzeitig ein Schlag gegen ihre Moral. Der unaufhörliche Kriegszug durch die Galaxie könnte ein für allemal gestoppt werden!\n\nENDE\n",
        "es": "|Antecedentes - \n\nPor fin se ha descubierto el oculto corazón de la religión Skedar: un planeta desierto que arde bajo tres soles. El líder de la facción terrorista Skedar tiene su base en el Templo de Batalla, sito en la superficie del planeta. La destrucción del Templo y la muerte de su líder destrozaría la moral de los Skedar.\n\n|Carrington - No Disponible.\n\n|Elvis - \n\nTenemos trabajo de campo por hacer, Joanna. Necesito marcar como blancos ciertas partes del templo para el bombardeo. Y necesitamos tener la absoluta certeza de que el líder Skedar muere. Seguro que posee un poderoso escudo capaz de soportar tiroteos, así que necesitarás destruir parte del propio santuario para asestar el golpe final.\n\n|Objetivo Uno: - Posicionar Blancos en el Templo\n\nConecta dispositivos de control de blancos a cada uno de los tres obeliscos de la superficie. Forman parte de un dañado, pero todavía funcional, generador de escudo que puede evitar que parte del Templo escape al bombardeo. Usa el Rastreador-R para identificar los correctos.\n\n|Objetivo Dos: - Activar el Puente\n\nDeberás abrir un agujero en el muro exterior para acceder al interior del santuario: tu escáner de infrarrojos te ayudará a encontrar un punto débil en la estructura. Una vez dentro del perímetro, hay otro problema. Aparentemente producido hace muchos años por uno de los terremotos que asolan el planeta, un profundo barranco separa el Interior Sacro del resto del Templo. Los Skedar han construido un puente móvil para acceder al mismo, pero puedes estar segura de que estará bien protegido.\n\n|Objetivo Tres: - Acceder al Interior Sacro\n\nBusca a través del laberinto de corredores subterráneos para encontrar el Interior Sacro. Se espera una resistencia feroz, incluso fanática. Éste es un templo a la guerra, y son muy devotos con sus creencias.\n\n|Objetivo Cuatro: - Destruir el Ejército Secreto Skedar\n\nEl Alto Comando Maian sospecha que más guerreros Skedar están en estado de hibernación en lugares desconocidos. Éste puede ser uno de esos lugares. Si así es, destrúyelos. La última cosa que necesitamos es enfrentarnos a una oleada de refuerzos sicóticos.\n\n|Objetivo Cinco: - Eliminar al Líder Skedar\n\nEl líder es un guerrero reverenciado por los Skedar. Su muerte será un duro mazazo a su moral y marcará el fin de su guerra por toda la galaxia. O sea, paz para todos.\n\nFIN\n"
    },
    {
        "id": "L_SHO_001",
        "en": "SKEDAR BATTLE SHRINE\n",
        "gb": "SKEDAR BATTLE SHRINE\n",
        "jp": "スケダ\\h8284「\\h8291いの\\h8685\\h8686」\n",
        "it": "TEMPIO DI GUERRA SKEDAR\n",
        "fr": "AUTEL DE BATAILLE SKEDAR\n",
        "de": "SKEDAR KRIEGSSCHREIN\n",
        "es": "TEMPLO DE BATALLA SKEDAR\n"
    },
    {
        "id": "L_SHO_002",
        "en": "|Background - \n\nThe hidden heart of the Skedar religion is exposed at last - a desert planet burning under three suns. The leader of the Skedar terrorist faction is based at the Battle Shrine on the surface of the planet. The destruction of the Shrine and the death of their leader would break the morale of the Skedar.\n\n|Carrington - Not Available.\n\n|Elvis - \n\nThere's some groundwork to do, Joanna - I need parts of the temple marked as targets for bombardment. And we need to be absolutely certain that the Skedar leader is dead. He is sure to have powerful shielding capable of withstanding gunfire, so you may need to destroy part of the shrine itself to deal the final blow.\n\n|Objective One: - Identify Temple Targets\n\nAttach a targeting device to each of three obelisks on the surface. They form part of a damaged but still functional shield generator that might cause part of the Shrine to escape the bombardment. Use the R-Tracker to identify the correct ones.\n\n|Objective Two: - Activate Bridge\n\nYou may have to blow a hole in the outer wall just to gain access to the shrine interior - your IR scanner should help find a weak spot in the structure. Once inside the perimeter, there's another problem. Apparently caused many years ago by one of the earthquakes which plague the planet, a deep ravine cuts the Inner Sanctum area off from the rest of the Shrine. The Skedar have made a retractable bridge to provide access, but you can guarantee it will be well guarded.\n\n|Objective Three: - Gain Access to Inner Sanctum\n\nSearch through the maze of underground corridors to find the Inner Sanctum. Expect resistance to be fierce, fanatical even. This is a shrine to war, and they are very devout in their worship.\n\n|Objective Four: - Assassinate Skedar Leader\n\nThe leader is a warrior much revered by the Skedar. His death will be a hammer blow to their morale and will mark the end of their warpath throughout the galaxy. Peace for all.\n\nEND\n",
        "gb": "|Background - \n\nThe hidden heart of the Skedar religion is exposed at last - a desert planet burning under three suns. The leader of the Skedar terrorist faction is based at the Battle Shrine on the surface of the planet. The destruction of the Shrine and the death of their leader would break the morale of the Skedar.\n\n|Carrington - Not Available.\n\n|Elvis - \n\nThere's some groundwork to do, Joanna - I need parts of the temple marked as targets for bombardment. And we need to be absolutely certain that the Skedar leader is dead. He is sure to have powerful shielding capable of withstanding gunfire, so you may need to destroy part of the shrine itself to deal the final blow.\n\n|Objective One: - Identify Temple Targets\n\nAttach a targeting device to each of three obelisks on the surface. They form part of a damaged but still functional shield generator that might cause part of the Shrine to escape the bombardment. Use the R-Tracker to identify the correct ones.\n\n|Objective Two: - Activate Bridge\n\nYou may have to blow a hole in the outer wall just to gain access to the shrine interior - your IR scanner should help find a weak spot in the structure. Once inside the perimeter, there's another problem. Apparently caused many years ago by one of the earthquakes which plague the planet, a deep ravine cuts the Inner Sanctum area off from the rest of the Shrine. The Skedar have made a retractable bridge to provide access, but you can guarantee it will be well guarded.\n\n|Objective Three: - Gain Access to Inner Sanctum\n\nSearch through the maze of underground corridors to find the Inner Sanctum. Expect resistance to be fierce, fanatical even. This is a shrine to war, and they are very devout in their worship.\n\n|Objective Four: - Assassinate Skedar Leader\n\nThe leader is a warrior much revered by the Skedar. His death will be a hammer blow to their morale and will mark the end of their warpath throughout the galaxy. Peace for all.\n\nEND\n",
        "jp": "|ステ\\h8284ジ\\h8287工：\n\nスケダ\\h8284の\\h84b7\\h84e9\\h8298がついに\\h82c8\\h82c9された。３つの\\h84f4\\h8787を\\h82d5つ\\h87c9き\\h87b7の\\h8794\\h86f8だ。スケダ\\h8284のキングはこの\\h86f8にある「\\h8291いの\\h8685\\h8686」にいるようだ。この\\h8685\\h8686を\\h82ce\\h82cfしキングを\\h82d9せば、\\h85b9された\\h8385\\h86ea\\h86ebのスケダ\\h8284たちに、もはや\\h8486の\\h84e9り\\h83e7は\\h83bcくなるのだ。\n\n|キャリントン：\n\n\\h84e3\\h859c\\h82a0\\h82a2\n\n|エルビス：\n\nキングにいどむ\\h839dにまずは\\h8298\\h87cb\\h83db\\h8291がある。\\h85a0\\h82b9な\\h85a3\\h82d7のために\\h8790しい\\h85c8\\h8295\\h84ec\\h84edが千\\h8383なんだ。\\h83c9\\h8483マ\\h8284カを\\h82f9ってよね。キングが\\h82b9\\h8584に\\h82d9れたことを\\h82c9\\h85dcける千\\h8383もあって、\\h83bc\\h87b0\\h83ffに\\h85a3\\h82d7するわけにはいかないのさ。ジョアンナ、キングはユ\\h8284に\\h82b5せたよ。ヤツのパワフルなシ\\h8284ルドは、\\h82e0\\h86f2では\\h86ccち\\h82ceれないかもしれない。トドメをさすには、\\h8685\\h8686そのものを\\h82cfす千\\h8383もあるかもしれない。\n\n|\\h82b5\\h82b6１：\\h83c9\\h8483マ\\h8284カを\\h839bり\\h82bbけよ\n\n\\h8298\\h87cbにいくつかあるオベリスク（\\h87b8\\h87b9）の\\h828e、まだ\\h83c2\\h82a2している\\h83b0３つに\\h83c9\\h8483マ\\h8284カを\\h839bり\\h82bbけてくれ。これらをマイアン\\h84a6が\\h85a0\\h82b9に\\h85a3\\h82d7・\\h82ce\\h82cfすれば、\\h8685\\h8686のシ\\h8284ルドは\\h83bcくなるだろう。\\h83c2\\h82a2しているオベリスクを\\h82c9\\h8398けるには、Ｒトラッカを\\h82f9うのだ。\n\n|\\h82b5\\h82b6２：ブリッジを\\h82c3\\h82c4せよ\n\n\\h8685\\h8686エリアの\\h82f6り\\h8280が\\h82c9\\h82d3たらないので、\\h86a7の\\h85feい\\h828f\\h8398を\\h82cfすのがいいだろう。\\h82c9つけるにはIRスキャンが\\h83e1\\h83dcだ。\\h8685\\h8686エリア\\h828e\\h828fも\\h87bbによって\\h8398\\h86e1されておりさらに\\h85aeの\\h87baなるエリアへ\\h82b7むには、\\h87bbを\\h84fcる千\\h8383がある。おそらくスケダ\\h8284たちは、そこにブリッジを\\h83dbっているはずだ。もし、\\h82c9\\h82d3たらなければどこかにスイッチの\\h83fb\\h8497をするものがあるだろう。しかしそこは、きびしい\\h8289\\h838eがなされているに\\h82feいない。\n\n|\\h82b5\\h82b6３：\\h8685\\h8686の\\h87baなるエリアに\\h82b7\\h82f6\n\nスケダ\\h8284のキングは\\h8685\\h8686の\\h82adも\\h87baなるエリアにいるだろう。そこへの\\h82f6り\\h8280は\\h82aaか\\h84ad\\h83ffなロックがされているかもしれない。ここは「\\h8291いの\\h8685\\h8686」だ。\\h8297の\\h82ed\\h82d7はさらに\\h82dfしいものになるに\\h82feいない。\n\n|\\h82b5\\h82b6４：スケダ\\h8284のキングを\\h82d9せ\n\nキングとの\\h83bd\\h8291だ。キングはサイキックを\\h82f9ってスケダ\\h8284\\h8291\\h85fdを\\h83a8み\\h829fすことができ、ヤツのシ\\h8284ルドは\\h82e0\\h86f2では\\h86ccち\\h82ceれないであろう。ヤツを\\h82d9せば、\\h85b9された\\h8385\\h86ea\\h86ebのスケダ\\h8284への\\h83c7\\h85a5\\h8282も\\h83bcくなり、ヤツらの\\h8485\\h84afにピリオドが\\h86ccたれることになる。そして\\h8385てが\\h84f5\\h86b6になるのだ。\n\nEND\n",
        "it": "|Situazione:\n\nFinalmente è stato scoperto il fulcro della religione Skedar: un pianeta deserto, arso dal calore di tre soli. Il capo della fazione terroristica Skedar ha la sua roccaforte nel Tempio della Guerra sulla superficie del pianeta. La distruzione del tempio e la morte del loro capo implicherebbe la decadenza degli Skedar.\n\n|Carrington:\n\nIrreperibile.\n\n|Elvis:\n\nC'è da fare un po' di lavoro preliminare, Joanna! Bisogna contrassegnare vari settori del tempio come obiettivi per il bombardamento. Inoltre dobbiamo essere assolutamente sicuri che il capo degli Skedar sia morto stecchito! Sappiamo che dispone di uno scudo molto potente in grado di contrastare le armi da fuoco, quindi dovrai distruggere parte del tempio stesso in preparazione al colpo finale.\n\n|Obiettivo 1: - Identifica gli obiettivi nel tempio\n\nAttacca un bersaglio su ciascuno dei tre obelischi del tempio. Essi fanno parte del generatore degli scudi che è stato danneggiato, ma è ancora attivo e perciò in grado di proteggere parte del tempio dalla distruzione totale. Usa il puntatore-R per identificare gli obiettivi corretti.\n\n|Obiettivo 2: - Attiva il ponte retrattile\n\nPer riuscire ad accedere al tempio dovrai ricavare un passaggio nel muro esterno. Lo scanner a infrarossi ti aiuterà a scoprire un punto debole nella struttura muraria. All'interno ti attende un altro problema: la zona dove si erge il Santuario Interno è separata dal resto del tempio da un profondo abisso apparentemente causato molti secoli or sono da uno dei frequenti terremoti che affliggono il pianeta. Per raggiungere tale area gli Skedar hanno costruito un ponte retrattile, che sarà sicuramente sotto sorveglianza speciale.\n\n|Obiettivo 3: - Trova l'accesso al Santuario Interno\n\nInoltrati nel labirinto di corridoi sotterranei per trovare l'ingresso al Santuario Interno. Troverai una resistenza accanita e talvolta addirittura fanatica. Si tratta di un tempio dedicato alla guerra, costruito da creature estremamente devote al loro culto.\n\n|Obiettivo 4: - Elimina il capo degli Skedar\n\nIl capo è un guerriero particolarmente venerato dagli Skedar. La sua morte sarebbe un colpo fatale per questa civiltà e segnerebbe la fine del loro sentiero di guerra attraverso la galassia. Finalmente sarà la pace!\n\nFINE\n",
        "fr": "|Briefing - \n\nNous avons enfin découvert le sanctuaire de la religion skedar. Il se trouve sur une planète désertique. Le chef des terroristes skedars se cache dans un Temple de la guerre placé à la surface de la planète. La destruction du Temple et l'élimination de leur leur chef pourrait semer le trouble dans leurs rangs.\n\n|Carrington - Indisponible.\n\n|Elvis - \n\nIl va falloir faire dans l'infiltration, Joanna. Je veux que tu marques des parties du Temple pour guider un bombardement stratégique. De plus, je veux être sûr de l'élimination du chef des Skedars.\n\n|Objectif 1: - Identifier les cibles du Temple\n\nPlace une balise de guidage sur les trois obélisques à la surface. Ils forment une sorte de générateur de bouclier énergétique qui serait susceptible de protéger le Temple des bombardements. Utilise un Pisteur-R pour identifier les objectifs valides.\n\n|Objectif 2: - Activer le pont\n\nApparemment, un gigantesque tremblement de terre aurait créé une fissure qui sépare le saint des saints de ce sanctuaire du reste du Temple. Les Skedars ont installé un gigantesque pont escamotable qui permet d'y accéder, je peux seulement te garantir qu'il sera extrêmement bien gardé.\n\n|Objectif 3: - Accéder au centre du Sanctuaire\n\nTu dois parcourir et explorer le dédale de corridors pour trouver le Sanctuaire. Tu vas certainement te heurter à une résistance acharnée. Tu vas te déplacer dans le Temple de la guerre, et les Skedars sont des fanatiques. Ils ne se laisseront pas faire.\n\n|Objectif 4: - Assassiner le chef des Skedars\n\nLe chef est un puissant guerrier, vénéré par les Skedars. Sa mort perturbera leur moral et mettra certainement un terme à leur désir de conquête galactique. La paix pourra ainsi régner.\n\nFIN\n",
        "de": "|Hintergrund - \n\nDas versteckte Zentrum der Skedar-Religion ist nunmehr entdeckt. Es handelt sich um einen von Wüsten bedeckten Planeten, der von drei Sonnen beschienen wird. Der Anführer der terroristischen Skedar-Fraktion hält sich in einem Schrein auf der Oberfläche des Planeten auf. Die Zerstörung des Schreins und der Tod ihres Anführers würde die Moral der Skedar untergraben.\n\n|Carrington - Nicht verfügbar.\n\n|Elvis - \n\nEs gilt, ein bisschen Vorarbeit zu leisten, Joanna. Einige Teile des Tempels müssen für die Bombardierung als Ziele markiert werden. Außerdem müssen wir absolut sichergehen, dass der Anführer der Skedar nicht mehr am Leben ist. Es ist anzunehmen, dass er über einen starken Schutzschild verfügt, der jeglichem Beschuss standhält. Das bedeutet, dass Sie wohl einen Teil des Schreins zerstören müssen, um den Anführer zu besiegen.\n\n|1. Ziel: - Identifizieren Sie die Ziele!\n\nBefestigen Sie Peilgeräte an jedem der drei Obelisken auf der Oberfläche. Sie sind Bestandteil eines beschädigten, aber immer noch funktionstüchtigen Schildgenerators. Wird dieser nicht außer Kraft gesetzt, könnten Teile des Schreins dem Bombenhagel entgehen. Setzen Sie den Tracker ein, um die Ziele zu identifizieren.\n\n|2. Ziel: - Aktivieren Sie die Brücke!\n\nSie müssen ein Loch in die Außenmauer sprengen, um in das Innere des Schreins zu gelangen. Ihr IR-Scanner sollte in der Lage sein, eine Schwachstelle ausfindig zu machen. Sobald Sie diese Aufgabe erfüllt haben, ergibt sich ein weiteres Problem. Durch eines der Erdbeben, von welchen der Planet ständig erschüttert wird, ist ein tiefer Graben entstanden. Dadurch wird der innere Bereich vom Rest des Schreins abgeschnitten. Die Skedar haben eine ausfahrbare Brücke errichtet, um die beiden Gebiete miteinander zu verbinden. Sie müssen aber davon ausgehen, dass die Brücke streng bewacht wird.\n\n|3. Ziel: - Gelangen Sie in den inneren Bereich!\n\nEin unterirdisches Labyrinth führt in den inneren Bereich. Rechnen Sie mit starkem, wenn nicht gar fanatischem Widerstand. Letztendlich handelt es sich um einen Kriegsschrein, und die Skedar sind ausgesprochen gläubig.\n\n|4. Ziel: - Eliminieren Sie den Anführer der Skedar!\n\nDer Anführer der Skedar genießt bei seinen Gefolgsleuten großes Ansehen. Sein Tod ist gleichzeitig ein Schlag gegen ihre Moral. Der unaufhörliche Kriegszug durch die Galaxie könnte ein für allemal gestoppt werden!\n\nENDE\n",
        "es": "|Antecedentes - \n\nPor fin se ha descubierto el oculto corazón de la religión Skedar: un planeta desierto que arde bajo tres soles. El líder de la facción terrorista Skedar tiene su base en el Templo de Batalla, sito en la superficie del planeta. La destrucción del Templo y la muerte de su líder destrozaría la moral de los Skedar.\n\n|Carrington - No Disponible.\n\n|Elvis - \n\nTenemos trabajo de campo por hacer, Joanna. Necesito marcar como blancos ciertas partes del templo para el bombardeo. Y necesitamos tener la absoluta certeza de que el líder Skedar muere. Seguro que posee un poderoso escudo capaz de soportar tiroteos, así que necesitarás destruir parte del propio santuario para asestar el golpe final.\n\n|Objetivo Uno: - Posicionar Blancos del Templo\n\nConecta dispositivos de control de blancos a cada uno de los tres obeliscos de la superficie. Forman parte de un dañado, pero todavía funcional, generador de escudo que puede evitar que parte del Templo escape al bombardeo. Usa el Rastreador-R para identificar los correctos.\n\n|Objetivo Dos: - Activar el Puente\n\nDeberás abrir un agujero en el muro exterior para acceder al interior del santuario: tu escáner de infrarrojos te ayudará a encontrar un punto débil en la estructura. Una vez dentro del perímetro, hay otro problema. Aparentemente producido hace muchos años por uno de los terremotos que asolan el planeta, un profundo barranco separa el Interior Sacro del resto del Templo. Los Skedar han construido un puente móvil para acceder al mismo, pero puedes estar segura de que estará bien protegido.\n\n|Objetivo Tres: - Acceder al Interior Sacro\n\nBusca en el laberinto de corredores subterráneos para encontrar el Interior Sacro. Se espera una resistencia feroz, incluso fanática. Éste es un templo dedicado a la guerra, y son muy devotos con sus creencias.\n\n|Objetivo Cuatro: - Eliminar al Líder Skedar\n\nEl líder es un guerrero reverenciado por los Skedar. Su muerte será un duro mazazo a su moral y marcará el fin de su guerra por toda la galaxia. O sea, paz para todos.\n\nFIN\n"
    },
    {
        "id": "L_SHO_003",
        "en": "|Background - \n\nThe hidden heart of the Skedar religion is exposed at last - a desert planet burning under three suns. The leader of the Skedar terrorist faction is based at the Battle Shrine on the surface of the planet. The destruction of the Shrine and the death of their leader would break the morale of the Skedar.\n\n|Carrington - Not Available.\n\n|Elvis - \n\nThere's some groundwork to do, Joanna - I need parts of the temple marked as targets for bombardment. And we need to be absolutely certain that the Skedar leader is dead. He is sure to have powerful shielding capable of withstanding gunfire, so you may need to destroy part of the shrine itself to deal the final blow.\n\n|Objective One: - Identify Temple Targets\n\nAttach a targeting device to each of three obelisks on the surface. They form part of a damaged but still functional shield generator that might cause part of the Shrine to escape the bombardment. Use the R-Tracker to identify the correct ones.\n\n|Objective Two: - Activate Bridge\n\nYou may have to blow a hole in the outer wall just to gain access to the shrine interior - your IR scanner should help find a weak spot in the structure. Once inside the perimeter, there's another problem. Apparently caused many years ago by one of the earthquakes which plague the planet, a deep ravine cuts the Inner Sanctum area off from the rest of the Shrine. The Skedar have made a retractable bridge to provide access, but you can guarantee it will be well guarded.\n\n|Objective Three: - Assassinate Skedar Leader\n\nThe leader is a warrior much revered by the Skedar. His death will be a hammer blow to their morale and will mark the end of their warpath throughout the galaxy. Peace for all.\n\nEND\n",
        "gb": "|Background - \n\nThe hidden heart of the Skedar religion is exposed at last - a desert planet burning under three suns. The leader of the Skedar terrorist faction is based at the Battle Shrine on the surface of the planet. The destruction of the Shrine and the death of their leader would break the morale of the Skedar.\n\n|Carrington - Not Available.\n\n|Elvis - \n\nThere's some groundwork to do, Joanna - I need parts of the temple marked as targets for bombardment. And we need to be absolutely certain that the Skedar leader is dead. He is sure to have powerful shielding capable of withstanding gunfire, so you may need to destroy part of the shrine itself to deal the final blow.\n\n|Objective One: - Identify Temple Targets\n\nAttach a targeting device to each of three obelisks on the surface. They form part of a damaged but still functional shield generator that might cause part of the Shrine to escape the bombardment. Use the R-Tracker to identify the correct ones.\n\n|Objective Two: - Activate Bridge\n\nYou may have to blow a hole in the outer wall just to gain access to the shrine interior - your IR scanner should help find a weak spot in the structure. Once inside the perimeter, there's another problem. Apparently caused many years ago by one of the earthquakes which plague the planet, a deep ravine cuts the Inner Sanctum area off from the rest of the Shrine. The Skedar have made a retractable bridge to provide access, but you can guarantee it will be well guarded.\n\n|Objective Three: - Assassinate Skedar Leader\n\nThe leader is a warrior much revered by the Skedar. His death will be a hammer blow to their morale and will mark the end of their warpath throughout the galaxy. Peace for all.\n\nEND\n",
        "jp": "|ステ\\h8284ジ\\h8287工：\n\nスケダ\\h8284の\\h84b7\\h84e9\\h8298がついに\\h82c8\\h82c9された。３つの\\h84f4\\h8787を\\h82d5つ\\h87c9き\\h87b7の\\h8794\\h86f8だ。スケダ\\h8284のキングはこの\\h86f8にある「\\h8291いの\\h8685\\h8686」にいるようだ。この\\h8685\\h8686を\\h82ce\\h82cfしキングを\\h82d9せば、\\h85b9された\\h8385\\h86ea\\h86ebのスケダ\\h8284たちに、もはや\\h8486の\\h84e9り\\h83e7は\\h83bcくなるのだ。\n\n|キャリントン：\n\n\\h84e3\\h859c\\h82a0\\h82a2\n\n|エルビス：\n\nキングにいどむ\\h839dにまずは\\h8298\\h87cb\\h83db\\h8291がある。\\h85a0\\h82b9な\\h85a3\\h82d7のために\\h8790しい\\h85c8\\h8295\\h84ec\\h84edが千\\h8383なんだ。\\h83c9\\h8483マ\\h8284カを\\h82f9ってよね。キングが\\h82b9\\h8584に\\h82d9れたことを\\h82c9\\h85dcける千\\h8383もあって、\\h83bc\\h87b0\\h83ffに\\h85a3\\h82d7するわけにはいかないのさ。ジョアンナ、キングはユ\\h8284に\\h82b5せたよ。ヤツのパワフルなシ\\h8284ルドは、\\h82e0\\h86f2では\\h86ccち\\h82ceれないかもしれない。トドメをさすには、\\h8685\\h8686そのものを\\h82cfす千\\h8383もあるかもしれない。\n\n|\\h82b5\\h82b6１：\\h83c9\\h8483マ\\h8284カを\\h839bり\\h82bbけよ\n\n\\h8298\\h87cbにいくつかあるオベリスク（\\h87b8\\h87b9）の\\h828e、まだ\\h83c2\\h82a2している\\h83b0３つに\\h83c9\\h8483マ\\h8284カを\\h839bり\\h82bbけてくれ。これらをマイアン\\h84a6が\\h85a0\\h82b9に\\h85a3\\h82d7・\\h82ce\\h82cfすれば、\\h8685\\h8686のシ\\h8284ルドは\\h83bcくなるだろう。\\h83c2\\h82a2しているオベリスクを\\h82c9\\h8398けるには、Ｒトラッカを\\h82f9うのだ。\n\n|\\h82b5\\h82b6２：ブリッジを\\h82c3\\h82c4せよ\n\n\\h8685\\h8686エリアの\\h82f6り\\h8280が\\h82c9\\h82d3たらないので、\\h86a7の\\h85feい\\h828f\\h8398を\\h82cfすのがいいだろう。\\h82c9つけるにはIRスキャンが\\h83e1\\h83dcだ。\\h8685\\h8686エリア\\h828e\\h828fも\\h87bbによって\\h8398\\h86e1されておりさらに\\h85aeの\\h87baなるエリアへ\\h82b7むには、\\h87bbを\\h84fcる千\\h8383がある。おそらくスケダ\\h8284たちは、そこにブリッジを\\h83dbっているはずだ。もし、\\h82c9\\h82d3たらなければどこかにスイッチの\\h83fb\\h8497をするものがあるだろう。しかしそこは、きびしい\\h8289\\h838eがなされているに\\h82feいない。\n\n|\\h82b5\\h82b6３：スケダ\\h8284のキングを\\h82d9せ\n\nキングとの\\h83bd\\h8291だ。キングはサイキックを\\h82f9ってスケダ\\h8284\\h8291\\h85fdを\\h83a8み\\h829fすことができ、ヤツのシ\\h8284ルドは\\h82e0\\h86f2では\\h86ccち\\h82ceれないであろう。ヤツを\\h82d9せば、\\h85b9された\\h8385\\h86ea\\h86ebのスケダ\\h8284への\\h83c7\\h85a5\\h8282も\\h83bcくなり、ヤツらの\\h8485\\h84afにピリオドが\\h86ccたれることになる。そして\\h8385てが\\h84f5\\h86b6になるのだ。\n\nEND\n",
        "it": "|Situazione:\n\nFinalmente è stato scoperto il fulcro della religione Skedar: un pianeta deserto, arso dal calore di tre soli. Il capo della fazione terroristica Skedar ha la sua roccaforte nel Tempio della Guerra sulla superficie del pianeta. La distruzione del tempio e la morte del loro capo implicherebbe la decadenza degli Skedar.\n\n|Carrington:\n\nIrreperibile.\n\n|Elvis:\n\nC'è da fare un po' di lavoro preliminare, Joanna! Bisogna contrassegnare vari settori del tempio come obiettivi per il bombardamento. Inoltre dobbiamo essere assolutamente sicuri che il capo degli Skedar sia morto stecchito! Sappiamo che dispone di uno scudo molto potente in grado di contrastare le armi da fuoco, quindi dovrai distruggere parte del tempio stesso in preparazione al colpo finale.\n\n|Obiettivo 1: - Identifica gli obiettivi nel tempio\n\nAttacca un bersaglio su ciascuno dei tre obelischi del tempio. Essi fanno parte del generatore degli scudi che è stato danneggiato, ma è ancora attivo e perciò in grado di proteggere parte del tempio dalla distruzione totale. Usa il puntatore-R per identificare gli obiettivi corretti.\n\n|Obiettivo 2: - Attiva il ponte retrattile\n\nPer riuscire ad accedere al tempio dovrai ricavare un passaggio nel muro esterno. Lo scanner a infrarossi ti aiuterà a scoprire un punto debole nella struttura muraria. All'interno ti attende un altro problema: la zona dove si erge il Santuario Interno è separata dal resto del tempio da un profondo abisso apparentemente causato molti secoli or sono da uno dei frequenti terremoti che affliggono il pianeta. Per raggiungere tale area gli Skedar hanno costruito un ponte retrattile, che sarà sicuramente sotto sorveglianza speciale.\n\n|Obiettivo 3: - Elimina il capo degli Skedar\n\nIl capo è un guerriero particolarmente venerato dagli Skedar. La sua morte sarebbe un colpo fatale per questa civiltà e segnerebbe la fine del loro sentiero di guerra attraverso la galassia. Finalmente sarà la pace!\n\nFINE\n",
        "fr": "|Briefing - \n\nNous avons enfin découvert le sanctuaire de la religion skedar. Il se trouve sur une planète désertique. Le chef des terroristes skedars se cache dans un Temple de la guerre situé à la surface de la planète. La destruction du Temple et l'élimination de leur chef pourrait semer le trouble dans leurs rangs.\n\n|Carrington - Indisponible.\n\n|Elvis - \n\nIl va falloir faire dans l'infiltration, Joanna. Je veux que tu marques des parties du Temple pour guider un bombardement stratégique. De plus, je veux être sûr de l'élimination du chef des Skedars.\n\n|Objectif 1: - Identifier les cibles du Temple\n\nPlace une balise de guidage sur les trois obélisques à la surface. Ils forment une sorte de générateur de bouclier énergétique qui serait susceptible de protéger le Temple des bombardements. Utilise un Pisteur-R pour identifier les objectifs valides.\n\n|Objectif 2: - Activer le pont\n\nApparemment, un gigantesque tremblement de terre aurait créé une fissure qui sépare le saint des saints de ce sanctuaire du reste du Temple. Les Skedars ont installé un gigantesque pont escamotable qui permet d'y accéder, je peux seulement te garantir qu'il sera extrêmement bien gardé.\n\n|Objectif 3: - Assassiner le chef des Skedars\n\nLe chef est un puissant guerrier, vénéré par les Skedars. Sa mort perturbera leur moral et mettra certainement un terme à leur désir de conquête galactique. La paix pourra ainsi régner.\n\nFIN\n",
        "de": "|Hintergrund - \n\nDas versteckte Zentrum der Skedar-Religion ist nunmehr entdeckt. Es handelt sich um einen von Wüsten bedeckten Planeten, der von drei Sonnen beschienen wird. Der Anführer der terroristischen Skedar-Fraktion hält sich in einem Schrein auf der Oberfläche des Planeten auf. Die Zerstörung des Schreins und der Tod ihres Anführers würde die Moral der Skedar untergraben.\n\n|Carrington - Nicht verfügbar.\n\n|Elvis - \n\nEs gilt, ein bisschen Vorarbeit zu leisten, Joanna. Einige Teile des Tempels müssen für die Bombardierung als Ziele markiert werden. Außerdem müssen wir absolut sichergehen, dass der Anführer der Skedar nicht mehr am Leben ist. Es ist anzunehmen, dass er über einen starken Schutzschild verfügt, der jeglichem Beschuss standhält. Das bedeutet, dass Sie wohl einen Teil des Schreins zerstören müssen, um den Anführer zu besiegen.\n\n|1. Ziel: - Identifizieren Sie die Ziele!\n\nBefestigen Sie Peilgeräte an jedem der drei Obelisken auf der Oberfläche. Sie sind Bestandteil eines beschädigten, aber immer noch funktionstüchtigen Schildgenerators. Wird dieser nicht außer Kraft gesetzt, könnten Teile des Schreins dem Bombenhagel entgehen. Setzen Sie den Tracker ein, um die Ziele zu identifizieren.\n\n|2. Ziel: - Aktivieren Sie die Brücke!\n\nSie müssen ein Loch in die Außenmauer sprengen, um in das Innere des Schreins zu gelangen. Ihr IR-Scanner sollte in der Lage sein, eine Schwachstelle ausfindig zu machen. Sobald Sie diese Aufgabe erfüllt haben, ergibt sich ein weiteres Problem. Durch eines der Erdbeben, von welchen der Planet ständig erschüttert wird, ist ein tiefer Graben entstanden. Dadurch wird der innere Bereich vom Rest des Schreins abgeschnitten. Die Skedar haben eine ausfahrbare Brücke errichtet, um die beiden Gebiete miteinander zu verbinden. Sie müssen aber davon ausgehen, dass die Brücke streng bewacht wird.\n\n|3. Ziel: - Eliminieren Sie den Anführer der Skedar!\n\nDer Anführer der Skedar genießt bei seinen Gefolgsleuten großes Ansehen. Sein Tod ist gleichzeitig ein Schlag gegen ihre Moral. Der unaufhörliche Kriegszug durch die Galaxie könnte ein für allemal gestoppt werden!\n\nENDE\n",
        "es": "|Antecedentes - \n\nPor fin se ha descubierto el oculto corazón de la religión Skedar: un planeta desierto que arde bajo tres soles. El líder de la facción terrorista Skedar tiene su base en el Templo de Batalla, sito en la superficie del planeta. La destrucción del Templo y la muerte de su líder destrozaría la moral de los Skedar.\n\n|Carrington - No Disponible.\n\n|Elvis - \n\nTenemos trabajo de campo por hacer, Joanna. Necesito marcar como blancos ciertas partes del templo para el bombardeo. Y necesitamos tener la absoluta certeza de que el líder Skedar muere. Seguro que posee un poderoso escudo capaz de soportar tiroteos, así que necesitarás destruir parte del propio santuario para asestar el golpe final.\n\n|Objetivo Uno: - Posicionar Blancos del Templo\n\nConecta dispositivos de control de blancos a cada uno de los tres obeliscos de la superficie. Forman parte de un dañado, pero todavía funcional, generador de escudo que puede evitar que parte del Templo escape al bombardeo. Usa el Rastreador-R para identificar los correctos.\n\n|Objetivo Dos: - Activar el Puente\n\nDeberás abrir un agujero en el muro exterior para acceder al interior del santuario: tu escáner de infrarrojos te ayudará a encontrar un punto débil en la estructura. Una vez dentro del perímetro, hay otro problema. Aparentemente producido hace muchos años por uno de los terremotos que asolan el planeta, un profundo barranco separa el Interior Sacro del resto del Templo. Los Skedar han construido un puente móvil para acceder al mismo, pero puedes estar segura de que estará bien protegido.\n\n|Objetivo Tres: - Eliminar al Líder Skedar\n\nEl líder es un guerrero reverenciado por los Skedar. Su muerte será un duro mazazo a su moral y marcará el fin de su guerra por toda la galaxia. O sea, paz para todos.\n\nFIN\n"
    },
    {
        "id": "L_SHO_004",
        "en": "\n",
        "gb": "\n",
        "jp": "\n",
        "it": "\n",
        "fr": "\n",
        "de": "\n",
        "es": "\n"
    },
    {
        "id": "L_SHO_005",
        "en": "Identify temple targets\n",
        "gb": "Identify temple targets\n",
        "jp": "\\h83c9\\h8483マ\\h8284カを\\h839bり\\h82bbけよ\n",
        "it": "Identifica gli obiettivi nel tempio\n",
        "fr": "Identifier les cibles du Temple\n",
        "de": "Identifizieren Sie die Ziele!\n",
        "es": "Posicionar blancos en el templo\n"
    },
    {
        "id": "L_SHO_006",
        "en": "Activate bridge\n",
        "gb": "Activate bridge\n",
        "jp": "ブリッジを\\h82c3\\h82c4せよ\n",
        "it": "Attiva il ponte retrattile\n",
        "fr": "Activer le pont\n",
        "de": "Aktivieren Sie die Brücke!\n",
        "es": "Activar el puente\n"
    },
    {
        "id": "L_SHO_007",
        "en": "Gain access to Inner Sanctum\n",
        "gb": "Gain access to Inner Sanctum\n",
        "jp": "\\h8685\\h8686の\\h87baなるエリアに\\h82b7\\h82f6\n",
        "it": "Trova l'accesso al Santuario Interno\n",
        "fr": "Accéder au centre du sanctuaire\n",
        "de": "Gelangen Sie in den inneren Bereich!\n",
        "es": "Acceder al Interior Sacro\n"
    },
    {
        "id": "L_SHO_008",
        "en": "Destroy secret Skedar army\n",
        "gb": "Destroy secret Skedar army\n",
        "jp": "エリ\\h8284ト\\h8291\\h85fdを\\h8385て\\h82d9せ\n",
        "it": "Distruggi l'esercito segreto Skedar\n",
        "fr": "Détruire l'armée secrète Skedar\n",
        "de": "Vernichten Sie die geheime Armee!\n",
        "es": "Destruir ejército secreto Skedar\n"
    },
    {
        "id": "L_SHO_009",
        "en": "Assassinate Skedar leader\n",
        "gb": "Assassinate Skedar leader\n",
        "jp": "スケダ\\h8284のキングを\\h82d9せ\n",
        "it": "Elimina il capo degli Skedar\n",
        "fr": "Assassiner le chef des Skedars\n",
        "de": "Eliminieren Sie den Anführer!\n",
        "es": "Eliminar al líder Skedar\n"
    },
    {
        "id": "L_SHO_010",
        "en": "Obtain Night Vision.\n",
        "gb": "Obtain Night Vision.\n",
        "jp": "Obtain Night Vision.\n",
        "it": "Procurati Vista Notturna.\n",
        "fr": "Obtenir Vue nocturne.\n",
        "de": "Erlangen Sie das Nachtsichtgerät!\n",
        "es": "Obtén la Visión Nocturna.\n"
    },
    {
        "id": "L_SHO_011",
        "en": "\n",
        "gb": "\n",
        "jp": "\n",
        "it": "\n",
        "fr": "\n",
        "de": "\n",
        "es": "\n"
    },
    {
        "id": "L_SHO_012",
        "en": "Night Vision\n",
        "gb": "Night Vision\n",
        "jp": "ナイトアイ\n",
        "it": "Vista Notturna\n",
        "fr": "Vue nocturne\n",
        "de": "Nachtsichtgerät\n",
        "es": "V. Nocturna\n"
    },
    {
        "id": "L_SHO_013",
        "en": "Night Vision\n",
        "gb": "Night Vision\n",
        "jp": "ナイトアイ\n",
        "it": "Vista Notturna\n",
        "fr": "Vue nocturne\n",
        "de": "Nachtsichtgerät\n",
        "es": "Visión Nocturna\n"
    },
    {
        "id": "L_SHO_014",
        "en": "Picked up Night Vision.\n",
        "gb": "Picked up Night Vision.\n",
        "jp": "ナイトアイを\\h82ddに\\h82f6れた\n",
        "it": "Presa Vista Notturna.\n",
        "fr": "Vue nocturne obtenue.\n",
        "de": "Nachtsichtgerät aufgenommen\n",
        "es": "Visión Nocturna obtenida.\n"
    },
    {
        "id": "L_SHO_015",
        "en": "Obtain Scanner.\n",
        "gb": "Obtain Scanner.\n",
        "jp": "Obtain Scanner.\n",
        "it": "Procurati scanner.\n",
        "fr": "Obtenir scanner.\n",
        "de": "Erlangen Sie den Scanner!\n",
        "es": "Obtén el Escáner.\n"
    },
    {
        "id": "L_SHO_016",
        "en": "\n",
        "gb": "\n",
        "jp": "\n",
        "it": "\n",
        "fr": "\n",
        "de": "\n",
        "es": "\n"
    },
    {
        "id": "L_SHO_017",
        "en": "Scanner\n",
        "gb": "Scanner\n",
        "jp": "Scanner\n",
        "it": "Scanner\n",
        "fr": "Scanner\n",
        "de": "Scanner\n",
        "es": "Escáner\n"
    },
    {
        "id": "L_SHO_018",
        "en": "Scanner\n",
        "gb": "Scanner\n",
        "jp": "Scanner\n",
        "it": "Scanner\n",
        "fr": "Scanner\n",
        "de": "Scanner\n",
        "es": "Escáner\n"
    },
    {
        "id": "L_SHO_019",
        "en": "Picked up Scanner.\n",
        "gb": "Picked up Scanner.\n",
        "jp": "Picked up Scanner.\n",
        "it": "Preso scanner.\n",
        "fr": "Scanner obtenu.\n",
        "de": "Scanner aufgenommen\n",
        "es": "Escáner obtenido.\n"
    },
    {
        "id": "L_SHO_020",
        "en": "Obtain Target Amplifier.\n",
        "gb": "Obtain Target Amplifier.\n",
        "jp": "Obtain Target Amplifier.\n",
        "it": "Procurati bersaglio.\n",
        "fr": "Obtenir Ampli cible.\n",
        "de": "Erlangen Sie das Peilgerät!\n",
        "es": "Obtén el Amplificador de Blancos.\n"
    },
    {
        "id": "L_SHO_021",
        "en": "\n",
        "gb": "\n",
        "jp": "\n",
        "it": "\n",
        "fr": "\n",
        "de": "\n",
        "es": "\n"
    },
    {
        "id": "L_SHO_022",
        "en": "Target Amplifier\n",
        "gb": "Target Amplifier\n",
        "jp": "\\h83c9\\h8483マ\\h8284カ\n",
        "it": "Bersaglio\n",
        "fr": "Ampli cible\n",
        "de": "Peilgerät\n",
        "es": "Amplificador\n"
    },
    {
        "id": "L_SHO_023",
        "en": "Target Amplifier\n",
        "gb": "Target Amplifier\n",
        "jp": "\\h83c9\\h8483マ\\h8284カ\n",
        "it": "Bersaglio\n",
        "fr": "Ampli cible\n",
        "de": "Peilgerät\n",
        "es": "Amplificador\n"
    },
    {
        "id": "L_SHO_024",
        "en": "Picked up Target Amplifier.\n",
        "gb": "Picked up Target Amplifier.\n",
        "jp": "Picked up Target Amplifier.\n",
        "it": "Preso bersaglio.\n",
        "fr": "Ampli cible obtenu.\n",
        "de": "Peilgerät aufgenommen\n",
        "es": "Amplificador de Blancos obtenido.\n"
    },
    {
        "id": "L_SHO_025",
        "en": "Target Amplifier placed correctly.\n",
        "gb": "Target Amplifier placed correctly.\n",
        "jp": "\\h83c9\\h8483マ\\h8284カの\\h839bり\\h82bbけＯＫ\n",
        "it": "Bersaglio piazzato correttamente.\n",
        "fr": "Ampli cible positionné correctement.\n",
        "de": "Peilgerät wurde korrekt platziert.\n",
        "es": "Amplificador colocado correctamente.\n"
    },
    {
        "id": "L_SHO_026",
        "en": "Target Amplifier placed incorrectly.\n",
        "gb": "Target Amplifier placed incorrectly.\n",
        "jp": "\\h83c9\\h8483マ\\h8284カの\\h839bり\\h82bbけ\\h85c8\\h8295が\\h82feいます\n",
        "it": "Bersaglio in posizione errata.\n",
        "fr": "Ampli cible mal positionné.\n",
        "de": "Peilgerät wurde nicht korrekt platziert.\n",
        "es": "Amplificador colocado incorrectamente.\n"
    },
    {
        "id": "L_SHO_027",
        "en": "Generator has been reactivated.\n",
        "gb": "Generator has been reactivated.\n",
        "jp": "\\h87ba\\h8298への\\h82b7\\h82f6が\\h85a9手された\n",
        "it": "Il generatore è stato riattivato.\n",
        "fr": "Générateur activé.\n",
        "de": "Generator wurde reaktiviert.\n",
        "es": "El Generador ha sido reactivado.\n"
    },
    {
        "id": "L_SHO_028",
        "en": "Skedar Inner Sanctum has been reached.\n",
        "gb": "Skedar Inner Sanctum has been reached.\n",
        "jp": "スケダ\\h8284の\\h87ba\\h8298に\\h82b7\\h82f6した\n",
        "it": "Raggiunto Santuario Interno Skedar.\n",
        "fr": "Centre du sanctuaire Skedar atteint.\n",
        "de": "Der innere Bereich des Schreins wurde erreicht.\n",
        "es": "El Interior Sacro Skedar ha sido alcanzado.\n"
    },
    {
        "id": "L_SHO_029",
        "en": "Skedar secret army has been defeated.\n",
        "gb": "Skedar secret army has been defeated.\n",
        "jp": "スケダ\\h8284のエリ\\h8284ト\\h8291\\h85fdを\\h8385て\\h82d9した\n",
        "it": "Distrutto esercito segreto Skedar.\n",
        "fr": "Armée secrète Skedar détruite.\n",
        "de": "Die geheime Skedar-Armee wurde vernichtet.\n",
        "es": "El ejército secreto Skedar ha sido derrotado.\n"
    },
    {
        "id": "L_SHO_030",
        "en": "This seems to be one of the special pillars.\n",
        "gb": "This seems to be one of the special pillars.\n",
        "jp": "これは、\\h878eの\\h84ad\\h83ffなオベリスクに\\h82feいないわ。\n",
        "it": "Questo sembra uno degli obelischi.\n",
        "fr": "Ca ressemble à un des piliers que je suis censée trouver.\n",
        "de": "Das scheint eine der drei Säulen zu sein.\n",
        "es": "Éste parece ser uno de los pilares especiales.\n"
    },
    {
        "id": "L_SHO_031",
        "en": "The power's more constant in this area. \nThe Inner Sanctum can't be far away.\n",
        "gb": "The power's more constant in this area. \nThe Inner Sanctum can't be far away.\n",
        "jp": "このエリアは\\h82aaか\\h84ad\\h83ffなパワ\\h8284を\\h85c1じるわ。\n\\h87ba\\h8298は\\h82bcくにありそうね。\n",
        "it": "Qui il campo energetico sembra più costante. \nIl Santuario Interno non può essere lontano.\n",
        "fr": "Cette zone est plus stable. \nLe sanctuaire doit être proche.\n",
        "de": "Die Stromversorgung in diesem Bereich wird immer konstanter. \nDer innere Bereich kann nicht weit entfernt sein.\n",
        "es": "La energía es más constante en este área. \nEl Interior Sacro no puede estar muy lejos.\n"
    },
    {
        "id": "L_SHO_032",
        "en": "OH, NO!!! A Skedar army in suspended animation!\n",
        "gb": "OH, NO!!! A Skedar army in suspended animation!\n",
        "jp": "\\h82aaこれ！スケダ\\h8284の\\h8798\\h8799カプセル？？\n",
        "it": "OH, NO!!! Un esercito Skedar in stato di morte apparente!\n",
        "fr": "OH, NON!!! Une armée skedar en animation suspendue!\n",
        "de": "OH NEIN!!! Die geheime Armee befindet sich tatsächlich in dem Schrein!\n",
        "es": "¡¡¡OH, NO!!! ¡Un ejército Skedar en animación suspendida!\n"
    },
    {
        "id": "L_SHO_033",
        "en": "Okay, this is it... Cut off the head and the \nbody will perish.\n",
        "gb": "Okay, this is it... Cut off the head and the \nbody will perish.\n",
        "jp": "ＯＫ！　こいつをブッとばせばいいわけね。\n",
        "it": "Benissimo, ecco fatto! Mozzandogli il capo \nil corpo morirà!\n",
        "fr": "Très bien, il faut trancher la tête...le reste périra lentement.\n",
        "de": "Okay, es muss sein... Wenn der Kopf abgeschnitten wird, \nstirbt auch der Körper.\n",
        "es": "Vale, entonces... Cortémosle la cabeza y el \ncuerpo perecerá.\n"
    },
    {
        "id": "L_SHO_034",
        "en": "This is the Skedar fanatics' most holy place. They believe this planet is sacred ground. The Battle Shrine is located at the most holy part of this holy planet.\n",
        "gb": "This is the Skedar fanatics' most holy place. They believe this planet is sacred ground. The Battle Shrine is located at the most holy part of this holy planet.\n",
        "jp": "ここはスケダ\\h8284の\\h87baなる\\h8794\\h86f8。\nヤツらにとって\\h83c6\\h8496なところ。\npこの\\h8794\\h86f8の\\h82adも\\h8685\\h87baな\\h838a\\h83e7には\n「\\h8291いの\\h8685\\h8686」があるんだ。\n",
        "it": "Questo è il luogo più SACRO per quei fanatici degli Skedar! Credono che questo pianeta sia SACRO ed inviolabile. Il Tempio di Guerra si trova nella parte più SACRA di questo pianeta SACRO!\n",
        "fr": "Voici le saint des saints des fanatiques skedars. Ils pensent que cette planète est sacrée. L'Autel de Bataille est le lieu le plus vénéré de cette planète.\n",
        "de": "Dies ist der heiligste Ort der Skedar. Der Planet scheint ihr heiliges Land zu sein. Der Schrein befindet sich am heiligsten Ort dieses heiligen Planeten.\n",
        "es": "Éste es el lugar más sagrado de los fanáticos Skedar. Ellos creen que este planeta es tierra sagrada. El Templo de Batalla está situado en la parte más sagrada de este 'santo' planeta.\n"
    },
    {
        "id": "L_SHO_035",
        "en": "So let me get this straight - it's holy. But there's more to it than that, isn't there?\n",
        "gb": "So let me get this straight - it's holy. But there's more to it than that, isn't there?\n",
        "jp": "で、その\\h87ba\\h8298に\\h82aaか\\h83d4\\h8383な\\h83b4\\h84b3があるの？\n",
        "it": "Fammi capire bene... Ma, allora è SACRO! Però c'è anche dell'altro, vero?\n",
        "fr": "Je vois. Cet endroit est sacré pour eux. Mais ce n'est pas tout, il y a autre chose, n'est-ce pas?",
        "de": "Lass mich mal resümieren: Hier ist es heilig. Aber das kann noch nicht alles sein, oder?\n",
        "es": "A ver si me aclaro. Es sagrado, ¿no? Pero hay bastante más que eso, ¿no es así?\n"
    },
    {
        "id": "L_SHO_036",
        "en": "Yes. In all of the time that we Maians fought the Skedar, we never found this place. We knew that until it was destroyed, the war would never be over. We fought the Skedar to a standstill, we earned a ceasefire - but we always had to be on our guard. The destruction of this place would mean a chance at true peace.\n",
        "gb": "Yes. In all of the time that we Maians fought the Skedar, we never found this place. We knew that until it was destroyed, the war would never be over. We fought the Skedar to a standstill, we earned a ceasefire - but we always had to be on our guard. The destruction of this place would mean a chance at true peace.\n",
        "jp": "ミ\\h8284たちはスケダ\\h8284との\\h8291\\h87c2\\h828d\nずっとここを\\h8480していたんだ。\np「\\h8291いの\\h8685\\h8686」が\\h83bcくなれば\nスケダ\\h8284は\\h8291う\\h83b5\\h8282を\\h83bcくす。\npだからどうしてもここを\nブッつぶしたかったんだ。\npそうすれば、\\h8385\\h86ea\\h86ebに\\h84b7\\h82d3の\n\\h84f5\\h86b6が\\h84a3れるはずなんだ！\n",
        "it": "Sì! In tutto il tempo che noi Maian abbiamo lottato contro gli Skedar non siamo mai riusciti a scoprire questo posto. Sapevamo che la guerra non sarebbe mai finita finché non fosse stato distrutto: abbiamo costretto gli Skedar a una tregua, li abbiamo piegati a cessare il fuoco, ma comunque non potevamo mai abbassare la guardia. La distruzione di questo posto implicherà una pace vera! \n",
        "fr": "En effet. Depuis le temps que les Maians se battent contre les Skedars, nous n'avons jamais pu trouver cet endroit. Sa destruction est la clé de la victoire. Nous avons combattu jusqu'à obtenir un cessez-le-feu, mais nous avons toujours été sur nos gardes. La destruction de cet endroit pourra enfin donner une chance à la paix.\n",
        "de": "Stimmt. In all der Zeit, in der die Maianer gegen die Skedar gekämpft haben, konnten wir diesen Ort nicht ausfindig machen. Wir wussten, dass, solange dieser Ort besteht, der Krieg niemals enden würde. Zwar konnten wir einen Waffenstillstand erzielen, mussten aber trotzdem stets wachsam sein. Die Zerstörung des Schreins wäre eine Chance, wieder Frieden zu erlangen.\n",
        "es": "Sí. En todo el tiempo que los Maian hemos luchado contra los Skedar, no encontramos este lugar. Sabíamos que hasta que no fuera destruido, la guerra no terminaría. Luchamos con los Skedar hasta llegar a un punto muerto donde obtuvimos un alto el fuego, pero hay que estar en guardia. La destrucción de este lugar puede significar una paz verdadera.\n"
    },
    {
        "id": "L_SHO_037",
        "en": "Then we have to be certain that no fanatics survive. I'll go in and take out the leader. You'll have to summon the Maian fleet to level the Shrine.\n",
        "gb": "Then we have to be certain that no fanatics survive. I'll go in and take out the leader. You'll have to summon the Maian fleet to level the Shrine.\n",
        "jp": "じゃあ、ここのボスは\\h8394に\\h82b5せて！\npあなたは、マイアン\\h84a6を\\h84d5んで\n\\h8385\\h828fここを\\h83c3\\h85a3してちょうだい。\n",
        "it": "Allora dobbiamo accertarci che non ci sfugga nessun fanatico: io entro e porto fuori il capo; tu chiami a raccolta la flotta Maian per radere al suolo il tempio!\n",
        "fr": "Nous devons être certains qu'aucun fanatique ne survivra. Je vais m'occuper du chef. Il faudra que tu prépares l'armada maian pour pulvériser ce satané temple.\n",
        "de": "Also müssen wir dafür sorgen, dass kein Skedar überlebt. Ich gehe rein und kümmere mich um den Anführer, und du koordinierst inzwischen den Angriff der Maianischen Flotte.\n",
        "es": "Así que tenemos que asegurarnos de que ningún fanático sobreviva. Entraré a por el líder. Tu tienes que traer a la flota Maian para derribar el Templo.\n"
    },
    {
        "id": "L_SHO_038",
        "en": "If you're caught on the ground when the fleet gets here, you won't stand a chance.\n",
        "gb": "If you're caught on the ground when the fleet gets here, you won't stand a chance.\n",
        "jp": "でもマイアン\\h84a6が\\h83f3いた\\h8393\nユ\\h8284が\\h85dbまっていたら～\n",
        "it": "Se ti trovi ancora in giro quando fa irruzione la flotta, non avrai più possibilità di salvezza!\n",
        "fr": "Il faudra que tu t'enfuies avant les bombardements, nous n'allons pas faire dans le détail.\n",
        "de": "Aber wenn du nicht rechtzeitig von dort verschwindest, hast du keine Chance.\n",
        "es": "Si estás en tierra cuando la flota llegue aquí, no tendrás ninguna oportunidad.\n"
    },
    {
        "id": "L_SHO_039",
        "en": "That's a mistake I don't intend to make.\n",
        "gb": "That's a mistake I don't intend to make.\n",
        "jp": "そんなミスは\\h868bさないわ。\n",
        "it": "È un errore che intendo evitare!\n",
        "fr": "Je ne compte pas vraiment m'éterniser.\n",
        "de": "Das ist ein Fehler, den ich nicht begehen werde.\n",
        "es": "Ése es un error que no pienso cometer.\n"
    },
    {
        "id": "L_SHO_040",
        "en": "Yesss...\n",
        "gb": "Yesss...\n",
        "jp": "やった～\n",
        "it": "Proprio così...\n",
        "fr": "Ouiii...\n",
        "de": "Jaaa...\n",
        "es": "Siiií...\n"
    },
    {
        "id": "L_SHO_041",
        "en": "Joanna! Joanna! \n",
        "gb": "Joanna! Joanna! \n",
        "jp": "ジョアンナ！　ジョアンナ！\n",
        "it": "Joanna! Joanna!\n",
        "fr": "Joanna! Joanna!\n",
        "de": "Joanna! Joanna!\n",
        "es": "¡Joanna! ¡Joanna! \n"
    },
    {
        "id": "L_SHO_042",
        "en": "Elvis! Elvis! Over here.\n",
        "gb": "Elvis! Elvis! Over here.\n",
        "jp": "エルビス！　エルビス！　こっちよ！\n",
        "it": "Elvis! Elvis! Da questa parte!\n",
        "fr": "Elvis! Elvis! Par ici.\n",
        "de": "Elvis! Elvis! Hier drüben!\n",
        "es": "¡Elvis! ¡Elvis! Aquí.\n"
    },
    {
        "id": "L_SHO_043",
        "en": "No problem. Grab my arms - we'll get you out in no time.\n",
        "gb": "No problem. Grab my arms - we'll get you out in no time.\n",
        "jp": "もう\\h83c6\\h84d3\\h84d4さ。さあ\\h82ddを。\n\\h85a3\\h82d7が\\h84d8まる。\\h829e\\h829fしよう。\n",
        "it": "Nessun problema! Afferra il mio braccio! Ti tireremo fuori in un batter d'occhio!\n",
        "fr": "Pas de problème. Attrape mon bras. On va te sortir de là.\n",
        "de": "OK! Halt dich an mir fest! Wir bringen dich sofort hier raus.\n",
        "es": "Ningún problema. Agárrate a mis brazos. Te sacaré enseguida.\n"
    },
    {
        "id": "L_SHO_044",
        "en": "No, quick! Give me your gun!\n",
        "gb": "No, quick! Give me your gun!\n",
        "jp": "\\h82e7って！　\\h82e0をちょうだい！\n",
        "it": "No, presto! Dammi la pistola!\n",
        "fr": "Non, vite! Donne-moi ton arme!\n",
        "de": "Nein! Rasch! Gib mir eine Waffe!\n",
        "es": "¡No, rápido! ¡Dame tu arma!\n"
    },
    {
        "id": "L_SHO_045",
        "en": "Will! You! Just! Let! Go!\n",
        "gb": "Will! You! Just! Let! Go!\n",
        "jp": "は、な、し、・・・てよ！！\n",
        "it": "VUOI LASCIARMI ANDARE?! PER LA MISERIA?!!\n",
        "fr": "Fous le camp!\n",
        "de": "Lass! Mich! Endlich! In! Frieden!!!\n",
        "es": "¡Quieres! ¡Soltarme! ¡De! ¡Una! ¡Vez!\n"
    },
    {
        "id": "L_SHO_046",
        "en": "I managed to get the fleet to stop the bombardment while I looked for you. They'll start as soon as we're clear.\n",
        "gb": "I managed to get the fleet to stop the bombardment while I looked for you. They'll start as soon as we're clear.\n",
        "jp": "ユ\\h8284を\\h82c9つけるまで、\\h85a3\\h82d7を\n\\h82e7っていたんだ。さあ、\\h82daこう。\n",
        "it": "La flotta ha interrotto il bombardamento per darmi il tempo di trovarti. Andranno avanti non appena saremo fuori di qui!\n",
        "fr": "J'ai réussi à retarder le bombardement, la flotte est en attente. Ils vont commencer dès que nous serons partis.\n",
        "de": "Ich konnte das Bombardement der Flotte einstellen, um nach dir zu suchen. Der Angriff geht weiter, wenn wir hier raus sind.\n",
        "es": "He podido detener el bombardeo de la flota mientras te buscaba. Empezarán de nuevo cuando estemos a salvo.\n"
    },
    {
        "id": "L_SHO_047",
        "en": "I'd have got out in time if that one hadn't grabbed my foot.\n",
        "gb": "I'd have got out in time if that one hadn't grabbed my foot.\n",
        "jp": "\\h86daをつかまれなかったら\n\\h8393\\h82fd\\h83cfりに\\h829e\\h829fしてたわ。\n",
        "it": "Sarei riuscita a svignarmela in tempo, se quello non mi si fosse aggrappato al piede!\n",
        "fr": "Je m'en serais tirée si ce gros lourdaud ne m'avait pas attrapé le pied.\n",
        "de": "Ich hätte es rechtzeitig geschafft, wenn mich der Kerl hier nicht erwischt hätte.\n",
        "es": "Hubiera salido a tiempo si ese m... no me hubiera cogido del pie.\n"
    },
    {
        "id": "L_SHO_048",
        "en": "Of course, Joanna, of course.\n",
        "gb": "Of course, Joanna, of course.\n",
        "jp": "もちろんさ、ジョアンナ。\n",
        "it": "Ma certo, Joanna, naturalmente!\n",
        "fr": "J'en suis sûr, Joanna, j'en suis sûr.\n",
        "de": "Natürlich, Joanna, natürlich.\n",
        "es": "Por supuesto, Joanna, por supuesto.\n"
    },
    {
        "id": "L_SHO_049",
        "en": "No, I would have.\n",
        "gb": "No, I would have.\n",
        "jp": "ちょっと￥、ホントよ！\n",
        "it": "No, veramente!!!\n",
        "fr": "Non, je te dis que je l'aurais fait.\n",
        "de": "Ich hätte es geschafft!\n",
        "es": "No, de verdad.\n"
    },
    {
        "id": "L_SHO_050",
        "en": "I believe you.\n",
        "gb": "I believe you.\n",
        "jp": "～\\h83a4じるよ。\n",
        "it": "Sì, sì, ti credo!\n",
        "fr": "Mais je te crois.\n",
        "de": "Ich glaube dir.\n",
        "es": "Te creo.\n"
    },
    {
        "id": "L_SHO_051",
        "en": "Make your sacrifice to the God of War.\n",
        "gb": "Make your sacrifice to the God of War.\n",
        "jp": "「\\h8291いの\\h8685」に\\h82aaかささげよ\n",
        "it": "Compi il tuo sacrificio in onore del Dio della Guerra.\n",
        "fr": "Fais tes prières au dieu de la guerre.\n",
        "de": "Bring dem Gott des Krieges dein Opfer dar!\n",
        "es": "Haz tu sacrificio al Dios de la Guerra.\n"
    },
    {
        "id": "L_SHO_052",
        "en": "Grenade ammo used up - can't enter Shrine.\n",
        "gb": "Grenade ammo used up - can't enter Shrine.\n",
        "jp": "\\h85a3\\h82c8\\h83b0が\\h85a4\\h8496れです　\\h8685\\h8686に\\h84d1\\h82f6できません\n",
        "it": "Granate esaurite - Impossibile entrare nel tempio.\n",
        "fr": "Plus de grenades - Impossible d'entrer dans le Temple.\n",
        "de": "Granaten verbraucht - Zutritt unmöglich.\n",
        "es": "Granadas utilizadas. No puedes entrar al Templo.\n"
    },
    {
        "id": "L_SHO_053",
        "en": "Alternative entrance to Shrine created.\n",
        "gb": "Alternative entrance to Shrine created.\n",
        "jp": "\\h8685\\h8686へ\\h84d1\\h82f6するために、もう１つの\\h82d4\\h84cfを\\h82c8\\h82c9\n",
        "it": "Creata entrata alternativa al tempio.\n",
        "fr": "Autre accès au Temple créé.\n",
        "de": "Es wurde ein alternativer Eingang erschaffen.\n",
        "es": "Creada entrada alternativa al Templo.\n"
    },
    {
        "id": "L_SHO_054",
        "en": "Where are you? Are you hurt?\n",
        "gb": "Where are you? Are you hurt?\n",
        "jp": "どこだ￥い、\\h83c6\\h84d3\\h84d4か￥い？\n",
        "it": "Dove sei? Sei ferita?\n",
        "fr": "Où es-tu? Tout va bien?\n",
        "de": "Wo bist du? Bist du verletzt?\n",
        "es": "¿Dónde estás? ¿Estás herida?\n"
    },
    {
        "id": "L_SHO_055",
        "en": null,
        "gb": null,
        "jp": null,
        "it": null,
        "fr": null,
        "de": null,
        "es": null
    }
]
