#include <ultra64.h>
#include "types.h"

struct g_vars {
	// Known member names based on debug strings:
	//g_Vars.PaksNeedsReInit
	//g_Vars.FourMeg2Player
	//g_Vars.playersperm[0]
	//g_Vars.playersperm[1]
	//g_Vars.PropState.propznum
	//g_Vars.PropState
	//g_Vars.antiplayernum
	//g_Vars.antiradaron
	//g_Vars.antibodynum
	//g_Vars.antiheadnum
	//g_Vars.coopfriendlyfire
	//g_Vars.coopradaron

	/*000000*/ u32 unk000000;
	/*000004*/ u32 unk000004;
	/*000008*/ u32 unk000008;
	/*00000c*/ u32 unk00000c;
	/*000010*/ u32 unk000010;
	/*000014*/ u32 unk000014;
	/*000018*/ u32 unk000018;
	/*00001c*/ u32 unk00001c;
	/*000020*/ u32 unk000020;
	/*000024*/ u32 unk000024;
	/*000028*/ u32 unk000028;
	/*00002c*/ u32 unk00002c;
	/*000030*/ u32 unk000030;
	/*000034*/ u32 unk000034;
	/*000038*/ u32 unk000038;
	/*00003c*/ u32 unk00003c;
	/*000040*/ u32 unk000040;
	/*000044*/ u32 unk000044;
	/*000048*/ u32 unk000048;
	/*00004c*/ u32 unk00004c;
	/*000050*/ u32 unk000050;
	/*000054*/ u32 unk000054;
	/*000058*/ u32 unk000058;
	/*00005c*/ u32 unk00005c;
	/*000060*/ u32 unk000060;
	/*000064*/ u32 unk000064;
	/*000068*/ u32 unk000068;
	/*00006c*/ u32 unk00006c;
	/*000070*/ u32 unk000070;
	/*000074*/ u32 unk000074;
	/*000078*/ u32 unk000078;
	/*00007c*/ u32 unk00007c;
	/*000080*/ u32 unk000080;
	/*000084*/ u32 unk000084;
	/*000088*/ u32 unk000088;
	/*00008c*/ u32 unk00008c;
	/*000090*/ u32 unk000090;
	/*000094*/ u32 unk000094;
	/*000098*/ u32 unk000098;
	/*00009c*/ u32 unk00009c;
	/*0000a0*/ u32 unk0000a0;
	/*0000a4*/ u32 unk0000a4;
	/*0000a8*/ u32 unk0000a8;
	/*0000ac*/ u32 unk0000ac;
	/*0000b0*/ u32 unk0000b0;
	/*0000b4*/ u32 unk0000b4;
	/*0000b8*/ u32 unk0000b8;
	/*0000bc*/ u32 unk0000bc;
	/*0000c0*/ u32 unk0000c0;
	/*0000c4*/ u32 unk0000c4;
	/*0000c8*/ u32 unk0000c8;
	/*0000cc*/ u32 unk0000cc;
	/*0000d0*/ u32 unk0000d0;
	/*0000d4*/ u32 unk0000d4;
	/*0000d8*/ u32 unk0000d8;
	/*0000dc*/ u32 unk0000dc;
	/*0000e0*/ u32 unk0000e0;
	/*0000e4*/ u32 unk0000e4;
	/*0000e8*/ u32 unk0000e8;
	/*0000ec*/ u32 unk0000ec;
	/*0000f0*/ u32 unk0000f0;
	/*0000f4*/ u32 unk0000f4;
	/*0000f8*/ u32 unk0000f8;
	/*0000fc*/ u32 unk0000fc;
	/*000100*/ u32 unk000100;
	/*000104*/ u32 unk000104;
	/*000108*/ u32 unk000108;
	/*00010c*/ u32 unk00010c;
	/*000110*/ u32 unk000110;
	/*000114*/ u32 unk000114;
	/*000118*/ u32 unk000118;
	/*00011c*/ u32 unk00011c;
	/*000120*/ u32 unk000120;
	/*000124*/ u32 unk000124;
	/*000128*/ u32 unk000128;
	/*00012c*/ u32 unk00012c;
	/*000130*/ u32 unk000130;
	/*000134*/ u32 unk000134;
	/*000138*/ u32 unk000138;
	/*00013c*/ u32 unk00013c;
	/*000140*/ u32 unk000140;
	/*000144*/ u32 unk000144;
	/*000148*/ u32 unk000148;
	/*00014c*/ u32 unk00014c;
	/*000150*/ u32 unk000150;
	/*000154*/ u32 unk000154;
	/*000158*/ u32 unk000158;
	/*00015c*/ u32 unk00015c;
	/*000160*/ u32 unk000160;
	/*000164*/ u32 unk000164;
	/*000168*/ u32 unk000168;
	/*00016c*/ u32 unk00016c;
	/*000170*/ u32 unk000170;
	/*000174*/ u32 unk000174;
	/*000178*/ u32 unk000178;
	/*00017c*/ u32 unk00017c;
	/*000180*/ u32 unk000180;
	/*000184*/ u32 unk000184;
	/*000188*/ u32 unk000188;
	/*00018c*/ u32 unk00018c;
	/*000190*/ u32 unk000190;
	/*000194*/ u32 unk000194;
	/*000198*/ u32 unk000198;
	/*00019c*/ u32 unk00019c;
	/*0001a0*/ u32 unk0001a0;
	/*0001a4*/ u32 unk0001a4;
	/*0001a8*/ u32 unk0001a8;
	/*0001ac*/ u32 unk0001ac;
	/*0001b0*/ u32 unk0001b0;
	/*0001b4*/ u32 unk0001b4;
	/*0001b8*/ u32 unk0001b8;
	/*0001bc*/ u32 unk0001bc;
	/*0001c0*/ u32 unk0001c0;
	/*0001c4*/ u32 unk0001c4;
	/*0001c8*/ u32 unk0001c8;
	/*0001cc*/ u32 unk0001cc;
	/*0001d0*/ u32 unk0001d0;
	/*0001d4*/ u32 unk0001d4;
	/*0001d8*/ u32 unk0001d8;
	/*0001dc*/ u32 unk0001dc;
	/*0001e0*/ u32 unk0001e0;
	/*0001e4*/ u32 unk0001e4;
	/*0001e8*/ u32 unk0001e8;
	/*0001ec*/ u32 unk0001ec;
	/*0001f0*/ u32 unk0001f0;
	/*0001f4*/ u32 unk0001f4;
	/*0001f8*/ u32 unk0001f8;
	/*0001fc*/ u32 unk0001fc;
	/*000200*/ u32 unk000200;
	/*000204*/ u32 unk000204;
	/*000208*/ u32 unk000208;
	/*00020c*/ u32 unk00020c;
	/*000210*/ u32 unk000210;
	/*000214*/ u32 unk000214;
	/*000218*/ u32 unk000218;
	/*00021c*/ u32 unk00021c;
	/*000220*/ u32 unk000220;
	/*000224*/ u32 unk000224;
	/*000228*/ u32 unk000228;
	/*00022c*/ u32 unk00022c;
	/*000230*/ u32 unk000230;
	/*000234*/ u32 unk000234;
	/*000238*/ u32 unk000238;
	/*00023c*/ u32 unk00023c;
	/*000240*/ u32 unk000240;
	/*000244*/ u32 unk000244;
	/*000248*/ u32 unk000248;
	/*00024c*/ u32 unk00024c;
	/*000250*/ u32 unk000250;
	/*000254*/ u32 unk000254;
	/*000258*/ u32 unk000258;
	/*00025c*/ u32 unk00025c;
	/*000260*/ u32 unk000260;
	/*000264*/ u32 unk000264;
	/*000268*/ u32 unk000268;
	/*00026c*/ u32 unk00026c;
	/*000270*/ u32 unk000270;
	/*000274*/ u32 unk000274;
	/*000278*/ u32 unk000278;
	/*00027c*/ u32 unk00027c;
	/*000280*/ u32 unk000280;
	/*000284*/ u32 unk000284;
	/*000288*/ u32 unk000288;
	/*00028c*/ u32 unk00028c;
	/*000290*/ u32 unk000290;
	/*000294*/ u32 unk000294;
	/*000298*/ u32 unk000298;
	/*00029c*/ u32 unk00029c;
	/*0002a0*/ u32 unk0002a0;
	/*0002a4*/ u32 unk0002a4;
	/*0002a8*/ u32 unk0002a8;
	/*0002ac*/ u32 unk0002ac;
	/*0002b0*/ u32 unk0002b0;
	/*0002b4*/ u32 unk0002b4;
	/*0002b8*/ u32 unk0002b8;
	/*0002bc*/ u32 unk0002bc;
	/*0002c0*/ u32 unk0002c0;
	/*0002c4*/ u32 unk0002c4;
	/*0002c8*/ u32 unk0002c8;
	/*0002cc*/ u32 unk0002cc;
	/*0002d0*/ u32 unk0002d0;
	/*0002d4*/ u32 unk0002d4;
	/*0002d8*/ u32 unk0002d8;
	/*0002dc*/ u32 unk0002dc;
	/*0002e0*/ u32 unk0002e0;
	/*0002e4*/ u32 unk0002e4;
	/*0002e8*/ u32 unk0002e8;
	/*0002ec*/ u32 unk0002ec;
	/*0002f0*/ u32 unk0002f0;
	/*0002f4*/ u32 unk0002f4;
	/*0002f8*/ u32 unk0002f8;
	/*0002fc*/ u32 unk0002fc;
	/*000300*/ u32 unk000300;
	/*000304*/ u32 unk000304;
	/*000308*/ u32 unk000308;
	/*00030c*/ u32 unk00030c;
	/*000310*/ u32 unk000310;
	/*000314*/ u32 unk000314;
	/*000318*/ u32 unk000318;
	/*00031c*/ u32 unk00031c;
	/*000320*/ u32 unk000320;
	/*000324*/ u32 unk000324;
	/*000328*/ u32 unk000328;
	/*00032c*/ u32 unk00032c;
	/*000330*/ u32 unk000330;
	/*000334*/ u32 unk000334;
	/*000338*/ u32 unk000338;
	/*00033c*/ u32 unk00033c;
	/*000340*/ u32 unk000340;
	/*000344*/ u32 unk000344;
	/*000348*/ u32 unk000348;
	/*00034c*/ u32 unk00034c;
	/*000350*/ u32 unk000350;
	/*000354*/ u32 unk000354;
	/*000358*/ u32 unk000358;
	/*00035c*/ u32 unk00035c;
	/*000360*/ u32 unk000360;
	/*000364*/ u32 unk000364;
	/*000368*/ u32 unk000368;
	/*00036c*/ u32 unk00036c;
	/*000370*/ u32 unk000370;
	/*000374*/ u32 unk000374;
	/*000378*/ u32 unk000378;
	/*00037c*/ u32 unk00037c;
	/*000380*/ u32 unk000380;
	/*000384*/ u32 unk000384;
	/*000388*/ u32 unk000388;
	/*00038c*/ u32 unk00038c;
	/*000390*/ u32 unk000390;
	/*000394*/ u32 unk000394;
	/*000398*/ u32 unk000398;
	/*00039c*/ u32 unk00039c;
	/*0003a0*/ u32 unk0003a0;
	/*0003a4*/ u32 unk0003a4;
	/*0003a8*/ u32 unk0003a8;
	/*0003ac*/ u32 unk0003ac;
	/*0003b0*/ u32 unk0003b0;
	/*0003b4*/ u32 unk0003b4;
	/*0003b8*/ u32 unk0003b8;
	/*0003bc*/ u32 unk0003bc;
	/*0003c0*/ u32 unk0003c0;
	/*0003c4*/ u32 unk0003c4;
	/*0003c8*/ u32 unk0003c8;
	/*0003cc*/ u32 unk0003cc;
	/*0003d0*/ u32 unk0003d0;
	/*0003d4*/ u32 unk0003d4;
	/*0003d8*/ u32 unk0003d8;
	/*0003dc*/ u32 unk0003dc;
	/*0003e0*/ u32 unk0003e0;
	/*0003e4*/ u32 unk0003e4;
	/*0003e8*/ u32 unk0003e8;
	/*0003ec*/ u32 unk0003ec;
	/*0003f0*/ u32 unk0003f0;
	/*0003f4*/ u32 unk0003f4;
	/*0003f8*/ u32 unk0003f8;
	/*0003fc*/ u32 unk0003fc;
	/*000400*/ u32 unk000400;
	/*000404*/ u32 unk000404;
	/*000408*/ u32 unk000408;
	/*00040c*/ u32 unk00040c;
	/*000410*/ u32 unk000410;
	/*000414*/ u32 unk000414;
	/*000418*/ u32 unk000418;
	/*00041c*/ u32 unk00041c;
	/*000420*/ u32 unk000420;
	/*000424*/ struct chrdata *chrdata;
	/*000428*/ struct defaultobj *objdata;
	/*00042c*/ struct otheraidata *aicdata;
	/*000430*/ struct otheraidata *aiddata;
	/*000434*/ u8 *ailist;
	/*000438*/ u32 aioffset;
	/*00043c*/ u32 unk00043c;
	/*000440*/ u32 unk000440;
	/*000444*/ u32 unk000444;
	/*000448*/ u32 unk000448;
	/*00044c*/ u32 unk00044c;
	/*000450*/ u32 unk000450;
	/*000454*/ u32 unk000454;
	/*000458*/ u32 unk000458;
	/*00045c*/ u32 unk00045c;
	/*000460*/ u32 unk000460;
	/*000464*/ u32 unk000464;
	/*000468*/ u32 unk000468;
	/*00046c*/ u32 unk00046c;
	/*000470*/ u32 unk000470;
	/*000474*/ u32 unk000474;
	/*000478*/ u32 unk000478;
	/*00047c*/ u32 unk00047c;
	/*000480*/ u32 unk000480;
	/*000484*/ u32 unk000484;
	/*000488*/ u32 unk000488;
	/*00048c*/ u32 unk00048c;
	/*000490*/ u32 unk000490;
	/*000494*/ u32 unk000494;
	/*000498*/ u32 unk000498;
	/*00049c*/ u32 unk00049c;
	/*0004a0*/ u32 unk0004a0;
	/*0004a4*/ u32 unk0004a4;
	/*0004a8*/ u32 unk0004a8;
	/*0004ac*/ u32 unk0004ac;
	/*0004b0*/ u32 unk0004b0;
	/*0004b4*/ u32 unk0004b4;
	/*0004b8*/ u32 unk0004b8;
	/*0004bc*/ u32 unk0004bc;
	/*0004c0*/ u32 unk0004c0;
	/*0004c4*/ u32 unk0004c4;
	/*0004c8*/ u32 unk0004c8;
	/*0004cc*/ u32 unk0004cc;
	/*0004d0*/ u32 unk0004d0;
	/*0004d4*/ u32 unk0004d4;
	/*0004d8*/ u32 unk0004d8;
	/*0004dc*/ u32 unk0004dc;
	/*0004e0*/ u32 unk0004e0;
	/*0004e4*/ u32 unk0004e4;
	/*0004e8*/ u32 unk0004e8;
	/*0004ec*/ u32 unk0004ec;
	/*0004f0*/ u32 unk0004f0;
	/*0004f4*/ u32 unk0004f4;
	/*0004f8*/ u32 unk0004f8;
	/*0004fc*/ u32 unk0004fc;
	/*000500*/ u32 unk000500;
	/*000504*/ u32 unk000504;
	/*000508*/ u32 unk000508;
	/*00050c*/ u32 unk00050c;
	/*000510*/ u32 unk000510;
	/*000514*/ u32 unk000514;
	/*000518*/ u32 unk000518;
	/*00051c*/ u32 unk00051c;
	/*000520*/ u32 unk000520;
	/*000524*/ u32 unk000524;
	/*000528*/ u32 unk000528;
	/*00052c*/ u32 unk00052c;
	/*000530*/ u32 unk000530;
	/*000534*/ u32 unk000534;
	/*000538*/ u32 unk000538;
	/*00053c*/ u32 unk00053c;
	/*000540*/ u32 unk000540;
	/*000544*/ u32 unk000544;
	/*000548*/ u32 unk000548;
	/*00054c*/ u32 unk00054c;
	/*000550*/ u32 unk000550;
	/*000554*/ u32 unk000554;
	/*000558*/ u32 unk000558;
	/*00055c*/ u32 unk00055c;
	/*000560*/ u32 unk000560;
	/*000564*/ u32 unk000564;
	/*000568*/ u32 unk000568;
	/*00056c*/ u32 unk00056c;
	/*000570*/ u32 unk000570;
	/*000574*/ u32 unk000574;
	/*000578*/ u32 unk000578;
	/*00057c*/ u32 unk00057c;
	/*000580*/ u32 unk000580;
	/*000584*/ u32 unk000584;
	/*000588*/ u32 unk000588;
	/*00058c*/ u32 unk00058c;
	/*000590*/ u32 unk000590;
	/*000594*/ u32 unk000594;
	/*000598*/ u32 unk000598;
	/*00059c*/ u32 unk00059c;
	/*0005a0*/ u32 unk0005a0;
	/*0005a4*/ u32 unk0005a4;
	/*0005a8*/ u32 unk0005a8;
	/*0005ac*/ u32 unk0005ac;
	/*0005b0*/ u32 unk0005b0;
	/*0005b4*/ u32 unk0005b4;
	/*0005b8*/ u32 unk0005b8;
	/*0005bc*/ u32 unk0005bc;
	/*0005c0*/ u32 unk0005c0;
	/*0005c4*/ u32 unk0005c4;
	/*0005c8*/ u32 unk0005c8;
	/*0005cc*/ u32 unk0005cc;
	/*0005d0*/ u32 unk0005d0;
	/*0005d4*/ u32 unk0005d4;
	/*0005d8*/ u32 unk0005d8;
	/*0005dc*/ u32 unk0005dc;
	/*0005e0*/ u32 unk0005e0;
	/*0005e4*/ u32 unk0005e4;
	/*0005e8*/ u32 unk0005e8;
	/*0005ec*/ u32 unk0005ec;
	/*0005f0*/ u32 unk0005f0;
	/*0005f4*/ u32 unk0005f4;
	/*0005f8*/ u32 unk0005f8;
	/*0005fc*/ u32 unk0005fc;
	/*000600*/ u32 unk000600;
	/*000604*/ u32 unk000604;
	/*000608*/ u32 unk000608;
	/*00060c*/ u32 unk00060c;
	/*000610*/ u32 unk000610;
	/*000614*/ u32 unk000614;
	/*000618*/ u32 unk000618;
	/*00061c*/ u32 unk00061c;
	/*000620*/ u32 unk000620;
	/*000624*/ u32 unk000624;
	/*000628*/ u32 unk000628;
	/*00062c*/ u32 unk00062c;
	/*000630*/ u32 unk000630;
	/*000634*/ u32 unk000634;
	/*000638*/ u32 unk000638;
	/*00063c*/ u32 unk00063c;
	/*000640*/ u32 unk000640;
	/*000644*/ u32 unk000644;
	/*000648*/ u32 unk000648;
	/*00064c*/ u32 unk00064c;
	/*000650*/ u32 unk000650;
	/*000654*/ u32 unk000654;
	/*000658*/ u32 unk000658;
	/*00065c*/ u32 unk00065c;
	/*000660*/ u32 unk000660;
	/*000664*/ u32 unk000664;
	/*000668*/ u32 unk000668;
	/*00066c*/ u32 unk00066c;
	/*000670*/ u32 unk000670;
	/*000674*/ u32 unk000674;
	/*000678*/ u32 unk000678;
	/*00067c*/ u32 unk00067c;
	/*000680*/ u32 unk000680;
	/*000684*/ u32 unk000684;
	/*000688*/ u32 unk000688;
	/*00068c*/ u32 unk00068c;
	/*000690*/ u32 unk000690;
	/*000694*/ u32 unk000694;
	/*000698*/ u32 unk000698;
	/*00069c*/ u32 unk00069c;
	/*0006a0*/ u32 unk0006a0;
	/*0006a4*/ u32 unk0006a4;
	/*0006a8*/ u32 unk0006a8;
	/*0006ac*/ u32 unk0006ac;
	/*0006b0*/ u32 unk0006b0;
	/*0006b4*/ u32 unk0006b4;
	/*0006b8*/ u32 unk0006b8;
	/*0006bc*/ u32 unk0006bc;
	/*0006c0*/ u32 unk0006c0;
	/*0006c4*/ u32 unk0006c4;
	/*0006c8*/ u32 unk0006c8;
	/*0006cc*/ u32 unk0006cc;
	/*0006d0*/ u32 unk0006d0;
	/*0006d4*/ u32 unk0006d4;
	/*0006d8*/ u32 unk0006d8;
	/*0006dc*/ u32 unk0006dc;
	/*0006e0*/ u32 unk0006e0;
	/*0006e4*/ u32 unk0006e4;
	/*0006e8*/ u32 unk0006e8;
	/*0006ec*/ u32 unk0006ec;
	/*0006f0*/ u32 unk0006f0;
	/*0006f4*/ u32 unk0006f4;
	/*0006f8*/ u32 unk0006f8;
	/*0006fc*/ u32 unk0006fc;
	/*000700*/ u32 unk000700;
	/*000704*/ u32 unk000704;
	/*000708*/ u32 unk000708;
	/*00070c*/ u32 unk00070c;
	/*000710*/ u32 unk000710;
	/*000714*/ u32 unk000714;
	/*000718*/ u32 unk000718;
	/*00071c*/ u32 unk00071c;
	/*000720*/ u32 unk000720;
	/*000724*/ u32 unk000724;
	/*000728*/ u32 unk000728;
	/*00072c*/ u32 unk00072c;
	/*000730*/ u32 unk000730;
	/*000734*/ u32 unk000734;
	/*000738*/ u32 unk000738;
	/*00073c*/ u32 unk00073c;
	/*000740*/ u32 unk000740;
	/*000744*/ u32 unk000744;
	/*000748*/ u32 unk000748;
	/*00074c*/ u32 unk00074c;
	/*000750*/ u32 unk000750;
	/*000754*/ u32 unk000754;
	/*000758*/ u32 unk000758;
	/*00075c*/ u32 unk00075c;
	/*000760*/ u32 unk000760;
	/*000764*/ u32 unk000764;
	/*000768*/ u32 unk000768;
	/*00076c*/ u32 unk00076c;
	/*000770*/ u32 unk000770;
	/*000774*/ u32 unk000774;
	/*000778*/ u32 unk000778;
	/*00077c*/ u32 unk00077c;
	/*000780*/ u32 unk000780;
	/*000784*/ u32 unk000784;
	/*000788*/ u32 unk000788;
	/*00078c*/ u32 unk00078c;
	/*000790*/ u32 unk000790;
	/*000794*/ u32 unk000794;
	/*000798*/ u32 unk000798;
	/*00079c*/ u32 unk00079c;
	/*0007a0*/ u32 unk0007a0;
	/*0007a4*/ u32 unk0007a4;
	/*0007a8*/ u32 unk0007a8;
	/*0007ac*/ u32 unk0007ac;
	/*0007b0*/ u32 unk0007b0;
	/*0007b4*/ u32 unk0007b4;
	/*0007b8*/ u32 unk0007b8;
	/*0007bc*/ u32 unk0007bc;
	/*0007c0*/ u32 unk0007c0;
	/*0007c4*/ u32 unk0007c4;
	/*0007c8*/ u32 unk0007c8;
	/*0007cc*/ u32 unk0007cc;
	/*0007d0*/ u32 unk0007d0;
	/*0007d4*/ u32 unk0007d4;
	/*0007d8*/ u32 unk0007d8;
	/*0007dc*/ u32 unk0007dc;
	/*0007e0*/ u32 unk0007e0;
	/*0007e4*/ u32 unk0007e4;
	/*0007e8*/ u32 unk0007e8;
	/*0007ec*/ u32 unk0007ec;
	/*0007f0*/ u32 unk0007f0;
	/*0007f4*/ u32 unk0007f4;
	/*0007f8*/ u32 unk0007f8;
	/*0007fc*/ u32 unk0007fc;
	/*000800*/ u32 unk000800;
	/*000804*/ u32 unk000804;
	/*000808*/ u32 unk000808;
	/*00080c*/ u32 unk00080c;
	/*000810*/ u32 unk000810;
	/*000814*/ u32 unk000814;
	/*000818*/ u32 unk000818;
	/*00081c*/ u32 unk00081c;
	/*000820*/ u32 unk000820;
	/*000824*/ u32 unk000824;
	/*000828*/ u32 unk000828;
	/*00082c*/ u32 unk00082c;
	/*000830*/ u32 unk000830;
	/*000834*/ u32 unk000834;
	/*000838*/ u32 unk000838;
	/*00083c*/ u32 unk00083c;
	/*000840*/ u32 unk000840;
	/*000844*/ u32 unk000844;
	/*000848*/ u32 unk000848;
	/*00084c*/ u32 unk00084c;
	/*000850*/ u32 unk000850;
	/*000854*/ u32 unk000854;
	/*000858*/ u32 unk000858;
	/*00085c*/ u32 unk00085c;
	/*000860*/ u32 unk000860;
	/*000864*/ u32 unk000864;
	/*000868*/ u32 unk000868;
	/*00086c*/ u32 unk00086c;
	/*000870*/ u32 unk000870;
	/*000874*/ u32 unk000874;
	/*000878*/ u32 unk000878;
	/*00087c*/ u32 unk00087c;
	/*000880*/ u32 unk000880;
	/*000884*/ u32 unk000884;
	/*000888*/ u32 unk000888;
	/*00088c*/ u32 unk00088c;
	/*000890*/ u32 unk000890;
	/*000894*/ u32 unk000894;
	/*000898*/ u32 unk000898;
	/*00089c*/ u32 unk00089c;
	/*0008a0*/ u32 unk0008a0;
	/*0008a4*/ u32 unk0008a4;
	/*0008a8*/ u32 unk0008a8;
	/*0008ac*/ u32 unk0008ac;
	/*0008b0*/ u32 unk0008b0;
	/*0008b4*/ u32 unk0008b4;
	/*0008b8*/ u32 unk0008b8;
	/*0008bc*/ u32 unk0008bc;
	/*0008c0*/ u32 unk0008c0;
	/*0008c4*/ u32 unk0008c4;
	/*0008c8*/ u32 unk0008c8;
	/*0008cc*/ u32 unk0008cc;
	/*0008d0*/ u32 unk0008d0;
	/*0008d4*/ u32 unk0008d4;
	/*0008d8*/ u32 unk0008d8;
	/*0008dc*/ u32 unk0008dc;
	/*0008e0*/ u32 unk0008e0;
	/*0008e4*/ u32 unk0008e4;
	/*0008e8*/ u32 unk0008e8;
	/*0008ec*/ u32 unk0008ec;
	/*0008f0*/ u32 unk0008f0;
	/*0008f4*/ u32 unk0008f4;
	/*0008f8*/ u32 unk0008f8;
	/*0008fc*/ u32 unk0008fc;
	/*000900*/ u32 unk000900;
	/*000904*/ u32 unk000904;
	/*000908*/ u32 unk000908;
	/*00090c*/ u32 unk00090c;
	/*000910*/ u32 unk000910;
	/*000914*/ u32 unk000914;
	/*000918*/ u32 unk000918;
	/*00091c*/ u32 unk00091c;
	/*000920*/ u32 unk000920;
	/*000924*/ u32 unk000924;
	/*000928*/ u32 unk000928;
	/*00092c*/ u32 unk00092c;
	/*000930*/ u32 unk000930;
	/*000934*/ u32 unk000934;
	/*000938*/ u32 unk000938;
	/*00093c*/ u32 unk00093c;
	/*000940*/ u32 unk000940;
	/*000944*/ u32 unk000944;
	/*000948*/ u32 unk000948;
	/*00094c*/ u32 unk00094c;
	/*000950*/ u32 unk000950;
	/*000954*/ u32 unk000954;
	/*000958*/ u32 unk000958;
	/*00095c*/ u32 unk00095c;
	/*000960*/ u32 unk000960;
	/*000964*/ u32 unk000964;
	/*000968*/ u32 unk000968;
	/*00096c*/ u32 unk00096c;
	/*000970*/ u32 unk000970;
	/*000974*/ u32 unk000974;
	/*000978*/ u32 unk000978;
	/*00097c*/ u32 unk00097c;
	/*000980*/ u32 unk000980;
	/*000984*/ u32 unk000984;
	/*000988*/ u32 unk000988;
	/*00098c*/ u32 unk00098c;
	/*000990*/ u32 unk000990;
	/*000994*/ u32 unk000994;
	/*000998*/ u32 unk000998;
	/*00099c*/ u32 unk00099c;
	/*0009a0*/ u32 unk0009a0;
	/*0009a4*/ u32 unk0009a4;
	/*0009a8*/ u32 unk0009a8;
	/*0009ac*/ u32 unk0009ac;
	/*0009b0*/ u32 unk0009b0;
	/*0009b4*/ u32 unk0009b4;
	/*0009b8*/ u32 unk0009b8;
	/*0009bc*/ u32 unk0009bc;
	/*0009c0*/ u32 unk0009c0;
	/*0009c4*/ u32 unk0009c4;
	/*0009c8*/ u32 unk0009c8;
	/*0009cc*/ u32 unk0009cc;
	/*0009d0*/ u32 unk0009d0;
	/*0009d4*/ u32 unk0009d4;
	/*0009d8*/ u32 unk0009d8;
	/*0009dc*/ u32 unk0009dc;
	/*0009e0*/ u32 unk0009e0;
	/*0009e4*/ u32 unk0009e4;
	/*0009e8*/ u32 unk0009e8;
	/*0009ec*/ u32 unk0009ec;
	/*0009f0*/ u32 unk0009f0;
	/*0009f4*/ u32 unk0009f4;
	/*0009f8*/ u32 unk0009f8;
	/*0009fc*/ u32 unk0009fc;
	/*000a00*/ u32 unk000a00;
	/*000a04*/ u32 unk000a04;
	/*000a08*/ u32 unk000a08;
	/*000a0c*/ u32 unk000a0c;
	/*000a10*/ u32 unk000a10;
	/*000a14*/ u32 unk000a14;
	/*000a18*/ u32 unk000a18;
	/*000a1c*/ u32 unk000a1c;
	/*000a20*/ u32 unk000a20;
	/*000a24*/ u32 unk000a24;
	/*000a28*/ u32 unk000a28;
	/*000a2c*/ u32 unk000a2c;
	/*000a30*/ u32 unk000a30;
	/*000a34*/ u32 unk000a34;
	/*000a38*/ u32 unk000a38;
	/*000a3c*/ u32 unk000a3c;
	/*000a40*/ u32 unk000a40;
	/*000a44*/ u32 unk000a44;
	/*000a48*/ u32 unk000a48;
	/*000a4c*/ u32 unk000a4c;
	/*000a50*/ u32 unk000a50;
	/*000a54*/ u32 unk000a54;
	/*000a58*/ u32 unk000a58;
	/*000a5c*/ u32 unk000a5c;
	/*000a60*/ u32 unk000a60;
	/*000a64*/ u32 unk000a64;
	/*000a68*/ u32 unk000a68;
	/*000a6c*/ u32 unk000a6c;
	/*000a70*/ u32 unk000a70;
	/*000a74*/ u32 unk000a74;
	/*000a78*/ u32 unk000a78;
	/*000a7c*/ u32 unk000a7c;
	/*000a80*/ u32 unk000a80;
	/*000a84*/ u32 unk000a84;
	/*000a88*/ u32 unk000a88;
	/*000a8c*/ u32 unk000a8c;
	/*000a90*/ u32 unk000a90;
	/*000a94*/ u32 unk000a94;
	/*000a98*/ u32 unk000a98;
	/*000a9c*/ u32 unk000a9c;
	/*000aa0*/ u32 unk000aa0;
	/*000aa4*/ u32 unk000aa4;
	/*000aa8*/ u32 unk000aa8;
	/*000aac*/ u32 unk000aac;
	/*000ab0*/ u32 unk000ab0;
	/*000ab4*/ u32 unk000ab4;
	/*000ab8*/ u32 unk000ab8;
	/*000abc*/ u32 unk000abc;
	/*000ac0*/ u32 unk000ac0;
	/*000ac4*/ u32 unk000ac4;
	/*000ac8*/ u32 unk000ac8;
	/*000acc*/ u32 unk000acc;
	/*000ad0*/ u32 unk000ad0;
	/*000ad4*/ u32 unk000ad4;
	/*000ad8*/ u32 unk000ad8;
	/*000adc*/ u32 unk000adc;
	/*000ae0*/ u32 unk000ae0;
	/*000ae4*/ u32 unk000ae4;
	/*000ae8*/ u32 unk000ae8;
	/*000aec*/ u32 unk000aec;
	/*000af0*/ u32 unk000af0;
	/*000af4*/ u32 unk000af4;
	/*000af8*/ u32 unk000af8;
	/*000afc*/ u32 unk000afc;
	/*000b00*/ u32 unk000b00;
	/*000b04*/ u32 unk000b04;
	/*000b08*/ u32 unk000b08;
	/*000b0c*/ u32 unk000b0c;
	/*000b10*/ u32 unk000b10;
	/*000b14*/ u32 unk000b14;
	/*000b18*/ u32 unk000b18;
	/*000b1c*/ u32 unk000b1c;
	/*000b20*/ u32 unk000b20;
	/*000b24*/ u32 unk000b24;
	/*000b28*/ u32 unk000b28;
	/*000b2c*/ u32 unk000b2c;
	/*000b30*/ u32 unk000b30;
	/*000b34*/ u32 unk000b34;
	/*000b38*/ u32 unk000b38;
	/*000b3c*/ u32 unk000b3c;
	/*000b40*/ u32 unk000b40;
	/*000b44*/ u32 unk000b44;
	/*000b48*/ u32 unk000b48;
	/*000b4c*/ u32 unk000b4c;
	/*000b50*/ u32 unk000b50;
	/*000b54*/ u32 unk000b54;
	/*000b58*/ u32 unk000b58;
	/*000b5c*/ u32 unk000b5c;
	/*000b60*/ u32 unk000b60;
	/*000b64*/ u32 unk000b64;
	/*000b68*/ u32 unk000b68;
	/*000b6c*/ u32 unk000b6c;
	/*000b70*/ u32 unk000b70;
	/*000b74*/ u32 unk000b74;
	/*000b78*/ u32 unk000b78;
	/*000b7c*/ u32 unk000b7c;
	/*000b80*/ u32 unk000b80;
	/*000b84*/ u32 unk000b84;
	/*000b88*/ u32 unk000b88;
	/*000b8c*/ u32 unk000b8c;
	/*000b90*/ u32 unk000b90;
	/*000b94*/ u32 unk000b94;
	/*000b98*/ u32 unk000b98;
	/*000b9c*/ u32 unk000b9c;
	/*000ba0*/ u32 unk000ba0;
	/*000ba4*/ u32 unk000ba4;
	/*000ba8*/ u32 unk000ba8;
	/*000bac*/ u32 unk000bac;
	/*000bb0*/ u32 unk000bb0;
	/*000bb4*/ u32 unk000bb4;
	/*000bb8*/ u32 unk000bb8;
	/*000bbc*/ u32 unk000bbc;
	/*000bc0*/ u32 unk000bc0;
	/*000bc4*/ u32 unk000bc4;
	/*000bc8*/ u32 unk000bc8;
	/*000bcc*/ u32 unk000bcc;
	/*000bd0*/ u32 unk000bd0;
	/*000bd4*/ u32 unk000bd4;
	/*000bd8*/ u32 unk000bd8;
	/*000bdc*/ u32 unk000bdc;
	/*000be0*/ u32 unk000be0;
	/*000be4*/ u32 unk000be4;
	/*000be8*/ u32 unk000be8;
	/*000bec*/ u32 unk000bec;
	/*000bf0*/ u32 unk000bf0;
	/*000bf4*/ u32 unk000bf4;
	/*000bf8*/ u32 unk000bf8;
	/*000bfc*/ u32 unk000bfc;
	/*000c00*/ u32 unk000c00;
	/*000c04*/ u32 unk000c04;
	/*000c08*/ u32 unk000c08;
	/*000c0c*/ u32 unk000c0c;
	/*000c10*/ u32 unk000c10;
	/*000c14*/ u32 unk000c14;
	/*000c18*/ u32 unk000c18;
	/*000c1c*/ u32 unk000c1c;
	/*000c20*/ u32 unk000c20;
	/*000c24*/ u32 unk000c24;
	/*000c28*/ u32 unk000c28;
	/*000c2c*/ u32 unk000c2c;
	/*000c30*/ u32 unk000c30;
	/*000c34*/ u32 unk000c34;
	/*000c38*/ u32 unk000c38;
	/*000c3c*/ u32 unk000c3c;
	/*000c40*/ u32 unk000c40;
	/*000c44*/ u32 unk000c44;
	/*000c48*/ u32 unk000c48;
	/*000c4c*/ u32 unk000c4c;
	/*000c50*/ u32 unk000c50;
	/*000c54*/ u32 unk000c54;
	/*000c58*/ u32 unk000c58;
	/*000c5c*/ u32 unk000c5c;
	/*000c60*/ u32 unk000c60;
	/*000c64*/ u32 unk000c64;
	/*000c68*/ u32 unk000c68;
	/*000c6c*/ u32 unk000c6c;
	/*000c70*/ u32 unk000c70;
	/*000c74*/ u32 unk000c74;
	/*000c78*/ u32 unk000c78;
	/*000c7c*/ u32 unk000c7c;
	/*000c80*/ u32 unk000c80;
	/*000c84*/ u32 unk000c84;
	/*000c88*/ u32 unk000c88;
	/*000c8c*/ u32 unk000c8c;
	/*000c90*/ u32 unk000c90;
	/*000c94*/ u32 unk000c94;
	/*000c98*/ u32 unk000c98;
	/*000c9c*/ u32 unk000c9c;
	/*000ca0*/ u32 unk000ca0;
	/*000ca4*/ u32 unk000ca4;
	/*000ca8*/ u32 unk000ca8;
	/*000cac*/ u32 unk000cac;
	/*000cb0*/ u32 unk000cb0;
	/*000cb4*/ u32 unk000cb4;
	/*000cb8*/ u32 unk000cb8;
	/*000cbc*/ u32 unk000cbc;
	/*000cc0*/ u32 unk000cc0;
	/*000cc4*/ u32 unk000cc4;
	/*000cc8*/ u32 unk000cc8;
	/*000ccc*/ u32 unk000ccc;
	/*000cd0*/ u32 unk000cd0;
	/*000cd4*/ u32 unk000cd4;
	/*000cd8*/ u32 unk000cd8;
	/*000cdc*/ u32 unk000cdc;
	/*000ce0*/ u32 unk000ce0;
	/*000ce4*/ u32 unk000ce4;
	/*000ce8*/ u32 unk000ce8;
	/*000cec*/ u32 unk000cec;
	/*000cf0*/ u32 unk000cf0;
	/*000cf4*/ u32 unk000cf4;
	/*000cf8*/ u32 unk000cf8;
	/*000cfc*/ u32 unk000cfc;
	/*000d00*/ u32 unk000d00;
	/*000d04*/ u32 unk000d04;
	/*000d08*/ u32 unk000d08;
	/*000d0c*/ u32 unk000d0c;
	/*000d10*/ u32 unk000d10;
	/*000d14*/ u32 unk000d14;
	/*000d18*/ u32 unk000d18;
	/*000d1c*/ u32 unk000d1c;
	/*000d20*/ u32 unk000d20;
	/*000d24*/ u32 unk000d24;
	/*000d28*/ u32 unk000d28;
	/*000d2c*/ u32 unk000d2c;
	/*000d30*/ u32 unk000d30;
	/*000d34*/ u32 unk000d34;
	/*000d38*/ u32 unk000d38;
	/*000d3c*/ u32 unk000d3c;
	/*000d40*/ u32 unk000d40;
	/*000d44*/ u32 unk000d44;
	/*000d48*/ u32 unk000d48;
	/*000d4c*/ u32 unk000d4c;
	/*000d50*/ u32 unk000d50;
	/*000d54*/ u32 unk000d54;
	/*000d58*/ u32 unk000d58;
	/*000d5c*/ u32 unk000d5c;
	/*000d60*/ u32 unk000d60;
	/*000d64*/ u32 unk000d64;
	/*000d68*/ u32 unk000d68;
	/*000d6c*/ u32 unk000d6c;
	/*000d70*/ u32 unk000d70;
	/*000d74*/ u32 unk000d74;
	/*000d78*/ u32 unk000d78;
	/*000d7c*/ u32 unk000d7c;
	/*000d80*/ u32 unk000d80;
	/*000d84*/ u32 unk000d84;
	/*000d88*/ u32 unk000d88;
	/*000d8c*/ u32 unk000d8c;
	/*000d90*/ u32 unk000d90;
	/*000d94*/ u32 unk000d94;
	/*000d98*/ u32 unk000d98;
	/*000d9c*/ u32 unk000d9c;
	/*000da0*/ u32 unk000da0;
	/*000da4*/ u32 unk000da4;
	/*000da8*/ u32 unk000da8;
	/*000dac*/ u32 unk000dac;
	/*000db0*/ u32 unk000db0;
	/*000db4*/ u32 unk000db4;
	/*000db8*/ u32 unk000db8;
	/*000dbc*/ u32 unk000dbc;
	/*000dc0*/ u32 unk000dc0;
	/*000dc4*/ u32 unk000dc4;
	/*000dc8*/ u32 unk000dc8;
	/*000dcc*/ u32 unk000dcc;
	/*000dd0*/ u32 unk000dd0;
	/*000dd4*/ u32 unk000dd4;
	/*000dd8*/ u32 unk000dd8;
	/*000ddc*/ u32 unk000ddc;
	/*000de0*/ u32 unk000de0;
	/*000de4*/ u32 unk000de4;
	/*000de8*/ u32 unk000de8;
	/*000dec*/ u32 unk000dec;
	/*000df0*/ u32 unk000df0;
	/*000df4*/ u32 unk000df4;
	/*000df8*/ u32 unk000df8;
	/*000dfc*/ u32 unk000dfc;
	/*000e00*/ u32 unk000e00;
	/*000e04*/ u32 unk000e04;
	/*000e08*/ u32 unk000e08;
	/*000e0c*/ u32 unk000e0c;
	/*000e10*/ u32 unk000e10;
	/*000e14*/ u32 unk000e14;
	/*000e18*/ u32 unk000e18;
	/*000e1c*/ u32 unk000e1c;
	/*000e20*/ u32 unk000e20;
	/*000e24*/ u32 unk000e24;
	/*000e28*/ u32 unk000e28;
	/*000e2c*/ u32 unk000e2c;
	/*000e30*/ u32 unk000e30;
	/*000e34*/ u32 unk000e34;
	/*000e38*/ u32 unk000e38;
	/*000e3c*/ u32 unk000e3c;
	/*000e40*/ u32 unk000e40;
	/*000e44*/ u32 unk000e44;
	/*000e48*/ u32 unk000e48;
	/*000e4c*/ u32 unk000e4c;
	/*000e50*/ u32 unk000e50;
	/*000e54*/ u32 unk000e54;
	/*000e58*/ u32 unk000e58;
	/*000e5c*/ u32 unk000e5c;
	/*000e60*/ u32 unk000e60;
	/*000e64*/ u32 unk000e64;
	/*000e68*/ u32 unk000e68;
	/*000e6c*/ u32 unk000e6c;
	/*000e70*/ u32 unk000e70;
	/*000e74*/ u32 unk000e74;
	/*000e78*/ u32 unk000e78;
	/*000e7c*/ u32 unk000e7c;
	/*000e80*/ u32 unk000e80;
	/*000e84*/ u32 unk000e84;
	/*000e88*/ u32 unk000e88;
	/*000e8c*/ u32 unk000e8c;
	/*000e90*/ u32 unk000e90;
	/*000e94*/ u32 unk000e94;
	/*000e98*/ u32 unk000e98;
	/*000e9c*/ u32 unk000e9c;
	/*000ea0*/ u32 unk000ea0;
	/*000ea4*/ u32 unk000ea4;
	/*000ea8*/ u32 unk000ea8;
	/*000eac*/ u32 unk000eac;
	/*000eb0*/ u32 unk000eb0;
	/*000eb4*/ u32 unk000eb4;
	/*000eb8*/ u32 unk000eb8;
	/*000ebc*/ u32 unk000ebc;
	/*000ec0*/ u32 unk000ec0;
	/*000ec4*/ u32 unk000ec4;
	/*000ec8*/ u32 unk000ec8;
	/*000ecc*/ u32 unk000ecc;
	/*000ed0*/ u32 unk000ed0;
	/*000ed4*/ u32 unk000ed4;
	/*000ed8*/ u32 unk000ed8;
	/*000edc*/ u32 unk000edc;
	/*000ee0*/ u32 unk000ee0;
	/*000ee4*/ u32 unk000ee4;
	/*000ee8*/ u32 unk000ee8;
	/*000eec*/ u32 unk000eec;
	/*000ef0*/ u32 unk000ef0;
	/*000ef4*/ u32 unk000ef4;
	/*000ef8*/ u32 unk000ef8;
	/*000efc*/ u32 unk000efc;
	/*000f00*/ u32 unk000f00;
	/*000f04*/ u32 unk000f04;
	/*000f08*/ u32 unk000f08;
	/*000f0c*/ u32 unk000f0c;
	/*000f10*/ u32 unk000f10;
	/*000f14*/ u32 unk000f14;
	/*000f18*/ u32 unk000f18;
	/*000f1c*/ u32 unk000f1c;
	/*000f20*/ u32 unk000f20;
	/*000f24*/ u32 unk000f24;
	/*000f28*/ u32 unk000f28;
	/*000f2c*/ u32 unk000f2c;
	/*000f30*/ u32 unk000f30;
	/*000f34*/ u32 unk000f34;
	/*000f38*/ u32 unk000f38;
	/*000f3c*/ u32 unk000f3c;
	/*000f40*/ u32 unk000f40;
	/*000f44*/ u32 unk000f44;
	/*000f48*/ u32 unk000f48;
	/*000f4c*/ u32 unk000f4c;
	/*000f50*/ u32 unk000f50;
	/*000f54*/ u32 unk000f54;
	/*000f58*/ u32 unk000f58;
	/*000f5c*/ u32 unk000f5c;
	/*000f60*/ u32 unk000f60;
	/*000f64*/ u32 unk000f64;
	/*000f68*/ u32 unk000f68;
	/*000f6c*/ u32 unk000f6c;
	/*000f70*/ u32 unk000f70;
	/*000f74*/ u32 unk000f74;
	/*000f78*/ u32 unk000f78;
	/*000f7c*/ u32 unk000f7c;
	/*000f80*/ u32 unk000f80;
	/*000f84*/ u32 unk000f84;
	/*000f88*/ u32 unk000f88;
	/*000f8c*/ u32 unk000f8c;
	/*000f90*/ u32 unk000f90;
	/*000f94*/ u32 unk000f94;
	/*000f98*/ u32 unk000f98;
	/*000f9c*/ u32 unk000f9c;
	/*000fa0*/ u32 unk000fa0;
	/*000fa4*/ u32 unk000fa4;
	/*000fa8*/ u32 unk000fa8;
	/*000fac*/ u32 unk000fac;
	/*000fb0*/ u32 unk000fb0;
	/*000fb4*/ u32 unk000fb4;
	/*000fb8*/ u32 unk000fb8;
	/*000fbc*/ u32 unk000fbc;
	/*000fc0*/ u32 unk000fc0;
	/*000fc4*/ u32 unk000fc4;
	/*000fc8*/ u32 unk000fc8;
	/*000fcc*/ u32 unk000fcc;
	/*000fd0*/ u32 unk000fd0;
	/*000fd4*/ u32 unk000fd4;
	/*000fd8*/ u32 unk000fd8;
	/*000fdc*/ u32 unk000fdc;
	/*000fe0*/ u32 unk000fe0;
	/*000fe4*/ u32 unk000fe4;
	/*000fe8*/ u32 unk000fe8;
	/*000fec*/ u32 unk000fec;
	/*000ff0*/ u32 unk000ff0;
	/*000ff4*/ u32 unk000ff4;
	/*000ff8*/ u32 unk000ff8;
	/*000ffc*/ u32 unk000ffc;
	/*001000*/ u32 unk001000;
	/*001004*/ u32 unk001004;
	/*001008*/ u32 unk001008;
	/*00100c*/ u32 unk00100c;
	/*001010*/ u32 unk001010;
	/*001014*/ u32 unk001014;
	/*001018*/ u32 unk001018;
	/*00101c*/ u32 unk00101c;
	/*001020*/ u32 unk001020;
	/*001024*/ u32 unk001024;
	/*001028*/ u32 unk001028;
	/*00102c*/ u32 unk00102c;
	/*001030*/ u32 unk001030;
	/*001034*/ u32 unk001034;
	/*001038*/ u32 unk001038;
	/*00103c*/ u32 unk00103c;
	/*001040*/ u32 unk001040;
	/*001044*/ u32 unk001044;
	/*001048*/ u32 unk001048;
	/*00104c*/ u32 unk00104c;
	/*001050*/ u32 unk001050;
	/*001054*/ u32 unk001054;
	/*001058*/ u32 unk001058;
	/*00105c*/ u32 unk00105c;
	/*001060*/ u32 unk001060;
	/*001064*/ u32 unk001064;
	/*001068*/ u32 unk001068;
	/*00106c*/ u32 unk00106c;
	/*001070*/ u32 unk001070;
	/*001074*/ u32 unk001074;
	/*001078*/ u32 unk001078;
	/*00107c*/ u32 unk00107c;
	/*001080*/ u32 unk001080;
	/*001084*/ u32 unk001084;
	/*001088*/ u32 unk001088;
	/*00108c*/ u32 unk00108c;
	/*001090*/ u32 unk001090;
	/*001094*/ u32 unk001094;
	/*001098*/ u32 unk001098;
	/*00109c*/ u32 unk00109c;
	/*0010a0*/ u32 unk0010a0;
	/*0010a4*/ u32 unk0010a4;
	/*0010a8*/ u32 unk0010a8;
	/*0010ac*/ u32 unk0010ac;
	/*0010b0*/ u32 unk0010b0;
	/*0010b4*/ u32 unk0010b4;
	/*0010b8*/ u32 unk0010b8;
	/*0010bc*/ u32 unk0010bc;
	/*0010c0*/ u32 unk0010c0;
	/*0010c4*/ u32 unk0010c4;
	/*0010c8*/ u32 unk0010c8;
	/*0010cc*/ u32 unk0010cc;
	/*0010d0*/ u32 unk0010d0;
	/*0010d4*/ u32 unk0010d4;
	/*0010d8*/ u32 unk0010d8;
	/*0010dc*/ u32 unk0010dc;
	/*0010e0*/ u32 unk0010e0;
	/*0010e4*/ u32 unk0010e4;
	/*0010e8*/ u32 unk0010e8;
	/*0010ec*/ u32 unk0010ec;
	/*0010f0*/ u32 unk0010f0;
	/*0010f4*/ u32 unk0010f4;
	/*0010f8*/ u32 unk0010f8;
	/*0010fc*/ u32 unk0010fc;
	/*001100*/ u32 unk001100;
	/*001104*/ u32 unk001104;
	/*001108*/ u32 unk001108;
	/*00110c*/ u32 unk00110c;
	/*001110*/ u32 unk001110;
	/*001114*/ u32 unk001114;
	/*001118*/ u32 unk001118;
	/*00111c*/ u32 unk00111c;
	/*001120*/ u32 unk001120;
	/*001124*/ u32 unk001124;
	/*001128*/ u32 unk001128;
	/*00112c*/ u32 unk00112c;
	/*001130*/ u32 unk001130;
	/*001134*/ u32 unk001134;
	/*001138*/ u32 unk001138;
	/*00113c*/ u32 unk00113c;
	/*001140*/ u32 unk001140;
	/*001144*/ u32 unk001144;
	/*001148*/ u32 unk001148;
	/*00114c*/ u32 unk00114c;
	/*001150*/ u32 unk001150;
	/*001154*/ u32 unk001154;
	/*001158*/ u32 unk001158;
	/*00115c*/ u32 unk00115c;
	/*001160*/ u32 unk001160;
	/*001164*/ u32 unk001164;
	/*001168*/ u32 unk001168;
	/*00116c*/ u32 unk00116c;
	/*001170*/ u32 unk001170;
	/*001174*/ u32 unk001174;
	/*001178*/ u32 unk001178;
	/*00117c*/ u32 unk00117c;
	/*001180*/ u32 unk001180;
	/*001184*/ u32 unk001184;
	/*001188*/ u32 unk001188;
	/*00118c*/ u32 unk00118c;
	/*001190*/ u32 unk001190;
	/*001194*/ u32 unk001194;
	/*001198*/ u32 unk001198;
	/*00119c*/ u32 unk00119c;
	/*0011a0*/ u32 unk0011a0;
	/*0011a4*/ u32 unk0011a4;
	/*0011a8*/ u32 unk0011a8;
	/*0011ac*/ u32 unk0011ac;
	/*0011b0*/ u32 unk0011b0;
	/*0011b4*/ u32 unk0011b4;
	/*0011b8*/ u32 unk0011b8;
	/*0011bc*/ u32 unk0011bc;
	/*0011c0*/ u32 unk0011c0;
	/*0011c4*/ u32 unk0011c4;
	/*0011c8*/ u32 unk0011c8;
	/*0011cc*/ u32 unk0011cc;
	/*0011d0*/ u32 unk0011d0;
	/*0011d4*/ u32 unk0011d4;
	/*0011d8*/ u32 unk0011d8;
	/*0011dc*/ u32 unk0011dc;
	/*0011e0*/ u32 unk0011e0;
	/*0011e4*/ u32 unk0011e4;
	/*0011e8*/ u32 unk0011e8;
	/*0011ec*/ u32 unk0011ec;
	/*0011f0*/ u32 unk0011f0;
	/*0011f4*/ u32 unk0011f4;
	/*0011f8*/ u32 unk0011f8;
	/*0011fc*/ u32 unk0011fc;
	/*001200*/ u32 unk001200;
	/*001204*/ u32 unk001204;
	/*001208*/ u32 unk001208;
	/*00120c*/ u32 unk00120c;
	/*001210*/ u32 unk001210;
	/*001214*/ u32 unk001214;
	/*001218*/ u32 unk001218;
	/*00121c*/ u32 unk00121c;
	/*001220*/ u32 unk001220;
	/*001224*/ u32 unk001224;
	/*001228*/ u32 unk001228;
	/*00122c*/ u32 unk00122c;
	/*001230*/ u32 unk001230;
	/*001234*/ u32 unk001234;
	/*001238*/ u32 unk001238;
	/*00123c*/ u32 unk00123c;
	/*001240*/ u32 unk001240;
	/*001244*/ u32 unk001244;
	/*001248*/ u32 unk001248;
	/*00124c*/ u32 unk00124c;
	/*001250*/ u32 unk001250;
	/*001254*/ u32 unk001254;
	/*001258*/ u32 unk001258;
	/*00125c*/ u32 unk00125c;
	/*001260*/ u32 unk001260;
	/*001264*/ u32 unk001264;
	/*001268*/ u32 unk001268;
	/*00126c*/ u32 unk00126c;
	/*001270*/ u32 unk001270;
	/*001274*/ u32 unk001274;
	/*001278*/ u32 unk001278;
	/*00127c*/ u32 unk00127c;
	/*001280*/ u32 unk001280;
	/*001284*/ u32 unk001284;
	/*001288*/ u32 unk001288;
	/*00128c*/ u32 unk00128c;
	/*001290*/ u32 unk001290;
	/*001294*/ u32 unk001294;
	/*001298*/ u32 unk001298;
	/*00129c*/ u32 unk00129c;
	/*0012a0*/ u32 unk0012a0;
	/*0012a4*/ u32 unk0012a4;
	/*0012a8*/ u32 unk0012a8;
	/*0012ac*/ u32 unk0012ac;
	/*0012b0*/ u32 unk0012b0;
	/*0012b4*/ u32 unk0012b4;
	/*0012b8*/ u32 unk0012b8;
	/*0012bc*/ u32 unk0012bc;
	/*0012c0*/ u32 unk0012c0;
	/*0012c4*/ u32 unk0012c4;
	/*0012c8*/ u32 unk0012c8;
	/*0012cc*/ u32 unk0012cc;
	/*0012d0*/ u32 unk0012d0;
	/*0012d4*/ u32 unk0012d4;
	/*0012d8*/ u32 unk0012d8;
	/*0012dc*/ u32 unk0012dc;
	/*0012e0*/ u32 unk0012e0;
	/*0012e4*/ u32 unk0012e4;
	/*0012e8*/ u32 unk0012e8;
	/*0012ec*/ u32 unk0012ec;
	/*0012f0*/ u32 unk0012f0;
	/*0012f4*/ u32 unk0012f4;
	/*0012f8*/ u32 unk0012f8;
	/*0012fc*/ u32 unk0012fc;
	/*001300*/ u32 unk001300;
	/*001304*/ u32 unk001304;
	/*001308*/ u32 unk001308;
	/*00130c*/ u32 unk00130c;
	/*001310*/ u32 unk001310;
	/*001314*/ u32 unk001314;
	/*001318*/ u32 unk001318;
	/*00131c*/ u32 unk00131c;
	/*001320*/ u32 unk001320;
	/*001324*/ u32 unk001324;
	/*001328*/ u32 unk001328;
	/*00132c*/ u32 unk00132c;
	/*001330*/ u32 unk001330;
	/*001334*/ u32 unk001334;
	/*001338*/ u32 unk001338;
	/*00133c*/ u32 unk00133c;
	/*001340*/ u32 unk001340;
	/*001344*/ u32 unk001344;
	/*001348*/ u32 unk001348;
	/*00134c*/ u32 unk00134c;
	/*001350*/ u32 unk001350;
	/*001354*/ u32 unk001354;
	/*001358*/ u32 unk001358;
	/*00135c*/ u32 unk00135c;
	/*001360*/ u32 unk001360;
	/*001364*/ u32 unk001364;
	/*001368*/ u32 unk001368;
	/*00136c*/ u32 unk00136c;
	/*001370*/ u32 unk001370;
	/*001374*/ u32 unk001374;
	/*001378*/ u32 unk001378;
	/*00137c*/ u32 unk00137c;
	/*001380*/ u32 unk001380;
	/*001384*/ u32 unk001384;
	/*001388*/ u32 unk001388;
	/*00138c*/ u32 unk00138c;
	/*001390*/ u32 unk001390;
	/*001394*/ u32 unk001394;
	/*001398*/ u32 unk001398;
	/*00139c*/ u32 unk00139c;
	/*0013a0*/ u32 unk0013a0;
	/*0013a4*/ u32 unk0013a4;
	/*0013a8*/ u32 unk0013a8;
	/*0013ac*/ u32 unk0013ac;
	/*0013b0*/ u32 unk0013b0;
	/*0013b4*/ u32 unk0013b4;
	/*0013b8*/ u32 unk0013b8;
	/*0013bc*/ u32 unk0013bc;
	/*0013c0*/ u32 unk0013c0;
	/*0013c4*/ u32 unk0013c4;
	/*0013c8*/ u32 unk0013c8;
	/*0013cc*/ u32 unk0013cc;
	/*0013d0*/ u32 unk0013d0;
	/*0013d4*/ u32 unk0013d4;
	/*0013d8*/ u32 unk0013d8;
	/*0013dc*/ u32 unk0013dc;
	/*0013e0*/ u32 unk0013e0;
	/*0013e4*/ u32 unk0013e4;
	/*0013e8*/ u32 unk0013e8;
	/*0013ec*/ u32 unk0013ec;
	/*0013f0*/ u32 unk0013f0;
	/*0013f4*/ u32 unk0013f4;
	/*0013f8*/ u32 unk0013f8;
	/*0013fc*/ u32 unk0013fc;
	/*001400*/ u32 unk001400;
	/*001404*/ u32 unk001404;
	/*001408*/ u32 unk001408;
	/*00140c*/ u32 unk00140c;
	/*001410*/ u32 unk001410;
	/*001414*/ u32 unk001414;
	/*001418*/ u32 unk001418;
	/*00141c*/ u32 unk00141c;
	/*001420*/ u32 unk001420;
	/*001424*/ u32 unk001424;
	/*001428*/ u32 unk001428;
	/*00142c*/ u32 unk00142c;
	/*001430*/ u32 unk001430;
	/*001434*/ u32 unk001434;
	/*001438*/ u32 unk001438;
	/*00143c*/ u32 unk00143c;
	/*001440*/ u32 unk001440;
	/*001444*/ u32 unk001444;
	/*001448*/ u32 unk001448;
	/*00144c*/ u32 unk00144c;
	/*001450*/ u32 unk001450;
	/*001454*/ u32 unk001454;
	/*001458*/ u32 unk001458;
	/*00145c*/ u32 unk00145c;
	/*001460*/ u32 unk001460;
	/*001464*/ u32 unk001464;
	/*001468*/ u32 unk001468;
	/*00146c*/ u32 unk00146c;
	/*001470*/ u32 unk001470;
	/*001474*/ u32 unk001474;
	/*001478*/ u32 unk001478;
	/*00147c*/ u32 unk00147c;
	/*001480*/ u32 unk001480;
	/*001484*/ u32 unk001484;
	/*001488*/ u32 unk001488;
	/*00148c*/ u32 unk00148c;
	/*001490*/ u32 unk001490;
	/*001494*/ u32 unk001494;
	/*001498*/ u32 unk001498;
	/*00149c*/ u32 unk00149c;
	/*0014a0*/ u32 unk0014a0;
	/*0014a4*/ u32 unk0014a4;
	/*0014a8*/ u32 unk0014a8;
	/*0014ac*/ u32 unk0014ac;
	/*0014b0*/ u32 unk0014b0;
	/*0014b4*/ u32 unk0014b4;
	/*0014b8*/ u32 unk0014b8;
	/*0014bc*/ u32 unk0014bc;
	/*0014c0*/ u32 unk0014c0;
	/*0014c4*/ u32 unk0014c4;
	/*0014c8*/ u32 unk0014c8;
	/*0014cc*/ u32 unk0014cc;
	/*0014d0*/ u32 unk0014d0;
	/*0014d4*/ u32 unk0014d4;
	/*0014d8*/ u32 unk0014d8;
	/*0014dc*/ u32 unk0014dc;
	/*0014e0*/ u32 unk0014e0;
	/*0014e4*/ u32 unk0014e4;
	/*0014e8*/ u32 unk0014e8;
	/*0014ec*/ u32 unk0014ec;
	/*0014f0*/ u32 unk0014f0;
	/*0014f4*/ u32 unk0014f4;
	/*0014f8*/ u32 unk0014f8;
	/*0014fc*/ u32 unk0014fc;
	/*001500*/ u32 unk001500;
	/*001504*/ u32 unk001504;
	/*001508*/ u32 unk001508;
	/*00150c*/ u32 unk00150c;
	/*001510*/ u32 unk001510;
	/*001514*/ u32 unk001514;
	/*001518*/ u32 unk001518;
	/*00151c*/ u32 unk00151c;
	/*001520*/ u32 unk001520;
	/*001524*/ u32 unk001524;
	/*001528*/ u32 unk001528;
	/*00152c*/ u32 unk00152c;
	/*001530*/ u32 unk001530;
	/*001534*/ u32 unk001534;
	/*001538*/ u32 unk001538;
	/*00153c*/ u32 unk00153c;
	/*001540*/ u32 unk001540;
	/*001544*/ u32 unk001544;
	/*001548*/ u32 unk001548;
	/*00154c*/ u32 unk00154c;
	/*001550*/ u32 unk001550;
	/*001554*/ u32 unk001554;
	/*001558*/ u32 unk001558;
	/*00155c*/ u32 unk00155c;
	/*001560*/ u32 unk001560;
	/*001564*/ u32 unk001564;
	/*001568*/ u32 unk001568;
	/*00156c*/ u32 unk00156c;
	/*001570*/ u32 unk001570;
	/*001574*/ u32 unk001574;
	/*001578*/ u32 unk001578;
	/*00157c*/ u32 unk00157c;
	/*001580*/ u32 unk001580;
	/*001584*/ u32 unk001584;
	/*001588*/ u32 unk001588;
	/*00158c*/ u32 unk00158c;
	/*001590*/ u32 unk001590;
	/*001594*/ u32 unk001594;
	/*001598*/ u32 unk001598;
	/*00159c*/ u32 unk00159c;
	/*0015a0*/ u32 unk0015a0;
	/*0015a4*/ u32 unk0015a4;
	/*0015a8*/ u32 unk0015a8;
	/*0015ac*/ u32 unk0015ac;
	/*0015b0*/ u32 unk0015b0;
	/*0015b4*/ u32 unk0015b4;
	/*0015b8*/ u32 unk0015b8;
	/*0015bc*/ u32 unk0015bc;
	/*0015c0*/ u32 unk0015c0;
	/*0015c4*/ u32 unk0015c4;
	/*0015c8*/ u32 unk0015c8;
	/*0015cc*/ u32 unk0015cc;
	/*0015d0*/ u32 unk0015d0;
	/*0015d4*/ u32 unk0015d4;
	/*0015d8*/ u32 unk0015d8;
	/*0015dc*/ u32 unk0015dc;
	/*0015e0*/ u32 unk0015e0;
	/*0015e4*/ u32 unk0015e4;
	/*0015e8*/ u32 unk0015e8;
	/*0015ec*/ u32 unk0015ec;
	/*0015f0*/ u32 unk0015f0;
	/*0015f4*/ u32 unk0015f4;
	/*0015f8*/ u32 unk0015f8;
	/*0015fc*/ u32 unk0015fc;
	/*001600*/ u32 unk001600;
	/*001604*/ u32 unk001604;
	/*001608*/ u32 unk001608;
	/*00160c*/ u32 unk00160c;
	/*001610*/ u32 unk001610;
	/*001614*/ u32 unk001614;
	/*001618*/ u32 unk001618;
	/*00161c*/ u32 unk00161c;
	/*001620*/ u32 unk001620;
	/*001624*/ u32 unk001624;
	/*001628*/ u32 unk001628;
	/*00162c*/ u32 unk00162c;
	/*001630*/ u32 unk001630;
	/*001634*/ u32 unk001634;
	/*001638*/ u32 unk001638;
	/*00163c*/ u32 unk00163c;
	/*001640*/ u32 unk001640;
	/*001644*/ u32 unk001644;
	/*001648*/ u32 unk001648;
	/*00164c*/ u32 unk00164c;
	/*001650*/ u32 unk001650;
	/*001654*/ u32 unk001654;
	/*001658*/ u32 unk001658;
	/*00165c*/ u32 unk00165c;
	/*001660*/ u32 unk001660;
	/*001664*/ u32 unk001664;
	/*001668*/ u32 unk001668;
	/*00166c*/ u32 unk00166c;
	/*001670*/ u32 unk001670;
	/*001674*/ u32 unk001674;
	/*001678*/ u32 unk001678;
	/*00167c*/ u32 unk00167c;
	/*001680*/ u32 unk001680;
	/*001684*/ u32 unk001684;
	/*001688*/ u32 unk001688;
	/*00168c*/ u32 unk00168c;
	/*001690*/ u32 unk001690;
	/*001694*/ u32 unk001694;
	/*001698*/ u32 unk001698;
	/*00169c*/ u32 unk00169c;
	/*0016a0*/ u32 unk0016a0;
	/*0016a4*/ u32 unk0016a4;
	/*0016a8*/ u32 unk0016a8;
	/*0016ac*/ u32 unk0016ac;
	/*0016b0*/ u32 unk0016b0;
	/*0016b4*/ u32 unk0016b4;
	/*0016b8*/ u32 unk0016b8;
	/*0016bc*/ u32 unk0016bc;
	/*0016c0*/ u32 unk0016c0;
	/*0016c4*/ u32 unk0016c4;
	/*0016c8*/ u32 unk0016c8;
	/*0016cc*/ u32 unk0016cc;
	/*0016d0*/ u32 unk0016d0;
	/*0016d4*/ u32 unk0016d4;
	/*0016d8*/ u32 unk0016d8;
	/*0016dc*/ u32 unk0016dc;
	/*0016e0*/ u32 unk0016e0;
	/*0016e4*/ u32 unk0016e4;
	/*0016e8*/ u32 unk0016e8;
	/*0016ec*/ u32 unk0016ec;
	/*0016f0*/ u32 unk0016f0;
	/*0016f4*/ u32 unk0016f4;
	/*0016f8*/ u32 unk0016f8;
	/*0016fc*/ u32 unk0016fc;
	/*001700*/ u32 unk001700;
	/*001704*/ u32 unk001704;
	/*001708*/ u32 unk001708;
	/*00170c*/ u32 unk00170c;
	/*001710*/ u32 unk001710;
	/*001714*/ u32 unk001714;
	/*001718*/ u32 unk001718;
	/*00171c*/ u32 unk00171c;
	/*001720*/ u32 unk001720;
	/*001724*/ u32 unk001724;
	/*001728*/ u32 unk001728;
	/*00172c*/ u32 unk00172c;
	/*001730*/ u32 unk001730;
	/*001734*/ u32 unk001734;
	/*001738*/ u32 unk001738;
	/*00173c*/ u32 unk00173c;
	/*001740*/ u32 unk001740;
	/*001744*/ u32 unk001744;
	/*001748*/ u32 unk001748;
	/*00174c*/ u32 unk00174c;
	/*001750*/ u32 unk001750;
	/*001754*/ u32 unk001754;
	/*001758*/ u32 unk001758;
	/*00175c*/ u32 unk00175c;
	/*001760*/ u32 unk001760;
	/*001764*/ u32 unk001764;
	/*001768*/ u32 unk001768;
	/*00176c*/ u32 unk00176c;
	/*001770*/ u32 unk001770;
	/*001774*/ u32 unk001774;
	/*001778*/ u32 unk001778;
	/*00177c*/ u32 unk00177c;
	/*001780*/ u32 unk001780;
	/*001784*/ u32 unk001784;
	/*001788*/ u32 unk001788;
	/*00178c*/ u32 unk00178c;
	/*001790*/ u32 unk001790;
	/*001794*/ u32 unk001794;
	/*001798*/ u32 unk001798;
	/*00179c*/ u32 unk00179c;
	/*0017a0*/ u32 unk0017a0;
	/*0017a4*/ u32 unk0017a4;
	/*0017a8*/ u32 unk0017a8;
	/*0017ac*/ u32 unk0017ac;
	/*0017b0*/ u32 unk0017b0;
	/*0017b4*/ u32 unk0017b4;
	/*0017b8*/ u32 unk0017b8;
	/*0017bc*/ u32 unk0017bc;
	/*0017c0*/ u32 unk0017c0;
	/*0017c4*/ u32 unk0017c4;
	/*0017c8*/ u32 unk0017c8;
	/*0017cc*/ u32 unk0017cc;
	/*0017d0*/ u32 unk0017d0;
	/*0017d4*/ u32 unk0017d4;
	/*0017d8*/ u32 unk0017d8;
	/*0017dc*/ u32 unk0017dc;
	/*0017e0*/ u32 unk0017e0;
	/*0017e4*/ u32 unk0017e4;
	/*0017e8*/ u32 unk0017e8;
	/*0017ec*/ u32 unk0017ec;
	/*0017f0*/ u32 unk0017f0;
	/*0017f4*/ u32 unk0017f4;
	/*0017f8*/ u32 unk0017f8;
	/*0017fc*/ u32 unk0017fc;
	/*001800*/ u32 unk001800;
	/*001804*/ u32 unk001804;
	/*001808*/ u32 unk001808;
	/*00180c*/ u32 unk00180c;
	/*001810*/ u32 unk001810;
	/*001814*/ u32 unk001814;
	/*001818*/ u32 unk001818;
	/*00181c*/ u32 unk00181c;
	/*001820*/ u32 unk001820;
	/*001824*/ u32 unk001824;
	/*001828*/ u32 unk001828;
	/*00182c*/ u32 unk00182c;
	/*001830*/ u32 unk001830;
	/*001834*/ u32 unk001834;
	/*001838*/ u32 unk001838;
	/*00183c*/ u32 unk00183c;
	/*001840*/ u32 unk001840;
	/*001844*/ u32 unk001844;
	/*001848*/ u32 unk001848;
	/*00184c*/ u32 unk00184c;
	/*001850*/ u32 unk001850;
	/*001854*/ u32 unk001854;
	/*001858*/ u32 unk001858;
	/*00185c*/ u32 unk00185c;
	/*001860*/ u32 unk001860;
	/*001864*/ u32 unk001864;
	/*001868*/ u32 unk001868;
	/*00186c*/ u32 unk00186c;
	/*001870*/ u32 unk001870;
	/*001874*/ u32 unk001874;
	/*001878*/ u32 unk001878;
	/*00187c*/ u32 unk00187c;
	/*001880*/ u32 unk001880;
	/*001884*/ u32 unk001884;
	/*001888*/ u32 unk001888;
	/*00188c*/ u32 unk00188c;
	/*001890*/ u32 unk001890;
	/*001894*/ u32 unk001894;
	/*001898*/ u32 unk001898;
	/*00189c*/ u32 unk00189c;
	/*0018a0*/ u32 unk0018a0;
	/*0018a4*/ u32 unk0018a4;
	/*0018a8*/ u32 unk0018a8;
	/*0018ac*/ u32 unk0018ac;
	/*0018b0*/ u32 unk0018b0;
	/*0018b4*/ u32 unk0018b4;
	/*0018b8*/ u32 unk0018b8;
	/*0018bc*/ u32 unk0018bc;
	/*0018c0*/ u32 unk0018c0;
	/*0018c4*/ u32 unk0018c4;
	/*0018c8*/ u32 unk0018c8;
	/*0018cc*/ u32 unk0018cc;
	/*0018d0*/ u32 unk0018d0;
	/*0018d4*/ u32 unk0018d4;
	/*0018d8*/ u32 unk0018d8;
	/*0018dc*/ u32 unk0018dc;
	/*0018e0*/ u32 unk0018e0;
	/*0018e4*/ u32 unk0018e4;
	/*0018e8*/ u32 unk0018e8;
	/*0018ec*/ u32 unk0018ec;
	/*0018f0*/ u32 unk0018f0;
	/*0018f4*/ u32 unk0018f4;
	/*0018f8*/ u32 unk0018f8;
	/*0018fc*/ u32 unk0018fc;
	/*001900*/ u32 unk001900;
	/*001904*/ u32 unk001904;
	/*001908*/ u32 unk001908;
	/*00190c*/ u32 unk00190c;
	/*001910*/ u32 unk001910;
	/*001914*/ u32 unk001914;
	/*001918*/ u32 unk001918;
	/*00191c*/ u32 unk00191c;
	/*001920*/ u32 unk001920;
	/*001924*/ u32 unk001924;
	/*001928*/ u32 unk001928;
	/*00192c*/ u32 unk00192c;
	/*001930*/ u32 unk001930;
	/*001934*/ u32 unk001934;
	/*001938*/ u32 unk001938;
	/*00193c*/ u32 unk00193c;
	/*001940*/ u32 unk001940;
	/*001944*/ u32 unk001944;
	/*001948*/ u32 unk001948;
	/*00194c*/ u32 unk00194c;
	/*001950*/ u32 unk001950;
	/*001954*/ u32 unk001954;
	/*001958*/ u32 unk001958;
	/*00195c*/ u32 unk00195c;
	/*001960*/ u32 unk001960;
	/*001964*/ u32 unk001964;
	/*001968*/ u32 unk001968;
	/*00196c*/ u32 unk00196c;
	/*001970*/ u32 unk001970;
	/*001974*/ u32 unk001974;
	/*001978*/ u32 unk001978;
	/*00197c*/ u32 unk00197c;
	/*001980*/ u32 unk001980;
	/*001984*/ u32 unk001984;
	/*001988*/ u32 unk001988;
	/*00198c*/ u32 unk00198c;
	/*001990*/ u32 unk001990;
	/*001994*/ u32 unk001994;
	/*001998*/ u32 unk001998;
	/*00199c*/ u32 unk00199c;
	/*0019a0*/ u32 unk0019a0;
	/*0019a4*/ u32 unk0019a4;
	/*0019a8*/ u32 unk0019a8;
	/*0019ac*/ u32 unk0019ac;
	/*0019b0*/ u32 unk0019b0;
	/*0019b4*/ u32 unk0019b4;
	/*0019b8*/ u32 unk0019b8;
	/*0019bc*/ u32 unk0019bc;
	/*0019c0*/ u32 unk0019c0;
	/*0019c4*/ u32 unk0019c4;
	/*0019c8*/ u32 unk0019c8;
	/*0019cc*/ u32 unk0019cc;
	/*0019d0*/ u32 unk0019d0;
	/*0019d4*/ u32 unk0019d4;
	/*0019d8*/ u32 unk0019d8;
	/*0019dc*/ u32 unk0019dc;
	/*0019e0*/ u32 unk0019e0;
	/*0019e4*/ u32 unk0019e4;
	/*0019e8*/ u32 unk0019e8;
	/*0019ec*/ u32 unk0019ec;
	/*0019f0*/ u32 unk0019f0;
	/*0019f4*/ u32 unk0019f4;
	/*0019f8*/ u32 unk0019f8;
	/*0019fc*/ u32 unk0019fc;
	/*001a00*/ u32 unk001a00;
	/*001a04*/ u32 unk001a04;
	/*001a08*/ u32 unk001a08;
	/*001a0c*/ u32 unk001a0c;
	/*001a10*/ u32 unk001a10;
	/*001a14*/ u32 unk001a14;
	/*001a18*/ u32 unk001a18;
	/*001a1c*/ u32 unk001a1c;
	/*001a20*/ u32 unk001a20;
	/*001a24*/ u32 unk001a24;
	/*001a28*/ u32 unk001a28;
	/*001a2c*/ u32 unk001a2c;
	/*001a30*/ u32 unk001a30;
	/*001a34*/ u32 unk001a34;
	/*001a38*/ u32 unk001a38;
	/*001a3c*/ u32 unk001a3c;
	/*001a40*/ u32 unk001a40;
	/*001a44*/ u32 unk001a44;
	/*001a48*/ u32 unk001a48;
	/*001a4c*/ u32 unk001a4c;
	/*001a50*/ u32 unk001a50;
	/*001a54*/ u32 unk001a54;
	/*001a58*/ u32 unk001a58;
	/*001a5c*/ u32 unk001a5c;
	/*001a60*/ u32 unk001a60;
	/*001a64*/ u32 unk001a64;
	/*001a68*/ u32 unk001a68;
	/*001a6c*/ u32 unk001a6c;
	/*001a70*/ u32 unk001a70;
	/*001a74*/ u32 unk001a74;
	/*001a78*/ u32 unk001a78;
	/*001a7c*/ u32 unk001a7c;
	/*001a80*/ u32 unk001a80;
	/*001a84*/ u32 unk001a84;
	/*001a88*/ u32 unk001a88;
	/*001a8c*/ u32 unk001a8c;
	/*001a90*/ u32 unk001a90;
	/*001a94*/ u32 unk001a94;
	/*001a98*/ u32 unk001a98;
	/*001a9c*/ u32 unk001a9c;
	/*001aa0*/ u32 unk001aa0;
	/*001aa4*/ u32 unk001aa4;
	/*001aa8*/ u32 unk001aa8;
	/*001aac*/ u32 unk001aac;
	/*001ab0*/ u32 unk001ab0;
	/*001ab4*/ u32 unk001ab4;
	/*001ab8*/ u32 unk001ab8;
	/*001abc*/ u32 unk001abc;
	/*001ac0*/ u32 unk001ac0;
	/*001ac4*/ u32 unk001ac4;
	/*001ac8*/ u32 unk001ac8;
	/*001acc*/ u32 unk001acc;
	/*001ad0*/ u32 unk001ad0;
	/*001ad4*/ u32 unk001ad4;
	/*001ad8*/ u32 unk001ad8;
	/*001adc*/ u32 unk001adc;
	/*001ae0*/ u32 unk001ae0;
	/*001ae4*/ u32 unk001ae4;
	/*001ae8*/ u32 unk001ae8;
	/*001aec*/ u32 unk001aec;
	/*001af0*/ u32 unk001af0;
	/*001af4*/ u32 unk001af4;
	/*001af8*/ u32 unk001af8;
	/*001afc*/ u32 unk001afc;
	/*001b00*/ u32 unk001b00;
	/*001b04*/ u32 unk001b04;
	/*001b08*/ u32 unk001b08;
	/*001b0c*/ u32 unk001b0c;
	/*001b10*/ u32 unk001b10;
	/*001b14*/ u32 unk001b14;
	/*001b18*/ u32 unk001b18;
	/*001b1c*/ u32 unk001b1c;
	/*001b20*/ u32 unk001b20;
	/*001b24*/ u32 unk001b24;
	/*001b28*/ u32 unk001b28;
	/*001b2c*/ u32 unk001b2c;
	/*001b30*/ u32 unk001b30;
	/*001b34*/ u32 unk001b34;
	/*001b38*/ u32 unk001b38;
	/*001b3c*/ u32 unk001b3c;
	/*001b40*/ u32 unk001b40;
	/*001b44*/ u32 unk001b44;
	/*001b48*/ u32 unk001b48;
	/*001b4c*/ u32 unk001b4c;
	/*001b50*/ u32 unk001b50;
	/*001b54*/ u32 unk001b54;
	/*001b58*/ u32 unk001b58;
	/*001b5c*/ u32 unk001b5c;
	/*001b60*/ u32 unk001b60;
	/*001b64*/ u32 unk001b64;
	/*001b68*/ u32 unk001b68;
	/*001b6c*/ u32 unk001b6c;
	/*001b70*/ u32 unk001b70;
	/*001b74*/ u32 unk001b74;
	/*001b78*/ u32 unk001b78;
	/*001b7c*/ u32 unk001b7c;
	/*001b80*/ u32 unk001b80;
	/*001b84*/ u32 unk001b84;
	/*001b88*/ u32 unk001b88;
	/*001b8c*/ u32 unk001b8c;
	/*001b90*/ u32 unk001b90;
	/*001b94*/ u32 unk001b94;
	/*001b98*/ u32 unk001b98;
	/*001b9c*/ u32 unk001b9c;
	/*001ba0*/ u32 unk001ba0;
	/*001ba4*/ u32 unk001ba4;
	/*001ba8*/ u32 unk001ba8;
	/*001bac*/ u32 unk001bac;
	/*001bb0*/ u32 unk001bb0;
	/*001bb4*/ u32 unk001bb4;
	/*001bb8*/ u32 unk001bb8;
	/*001bbc*/ u32 unk001bbc;
	/*001bc0*/ u32 unk001bc0;
	/*001bc4*/ u32 unk001bc4;
	/*001bc8*/ u32 unk001bc8;
	/*001bcc*/ u32 unk001bcc;
	/*001bd0*/ u32 unk001bd0;
	/*001bd4*/ u32 unk001bd4;
	/*001bd8*/ u32 unk001bd8;
	/*001bdc*/ u32 unk001bdc;
	/*001be0*/ u32 unk001be0;
	/*001be4*/ u32 unk001be4;
	/*001be8*/ u32 unk001be8;
	/*001bec*/ u32 unk001bec;
	/*001bf0*/ u32 unk001bf0;
	/*001bf4*/ u32 unk001bf4;
	/*001bf8*/ u32 unk001bf8;
	/*001bfc*/ u32 unk001bfc;
	/*001c00*/ u32 unk001c00;
	/*001c04*/ u32 unk001c04;
	/*001c08*/ u32 unk001c08;
	/*001c0c*/ u32 unk001c0c;
	/*001c10*/ u32 unk001c10;
	/*001c14*/ u32 unk001c14;
	/*001c18*/ u32 unk001c18;
	/*001c1c*/ u32 unk001c1c;
	/*001c20*/ u32 unk001c20;
	/*001c24*/ u32 unk001c24;
	/*001c28*/ u32 unk001c28;
	/*001c2c*/ u32 unk001c2c;
	/*001c30*/ u32 unk001c30;
	/*001c34*/ u32 unk001c34;
	/*001c38*/ u32 unk001c38;
	/*001c3c*/ u32 unk001c3c;
	/*001c40*/ u32 unk001c40;
	/*001c44*/ u32 unk001c44;
	/*001c48*/ u32 unk001c48;
	/*001c4c*/ u32 unk001c4c;
	/*001c50*/ u32 unk001c50;
	/*001c54*/ u32 unk001c54;
	/*001c58*/ u32 unk001c58;
	/*001c5c*/ u32 unk001c5c;
	/*001c60*/ u32 unk001c60;
	/*001c64*/ u32 unk001c64;
	/*001c68*/ u32 unk001c68;
	/*001c6c*/ u32 unk001c6c;
	/*001c70*/ u32 unk001c70;
	/*001c74*/ u32 unk001c74;
	/*001c78*/ u32 unk001c78;
	/*001c7c*/ u32 unk001c7c;
	/*001c80*/ u32 unk001c80;
	/*001c84*/ u32 unk001c84;
	/*001c88*/ u32 unk001c88;
	/*001c8c*/ u32 unk001c8c;
	/*001c90*/ u32 unk001c90;
	/*001c94*/ u32 unk001c94;
	/*001c98*/ u32 unk001c98;
	/*001c9c*/ u32 unk001c9c;
	/*001ca0*/ u32 unk001ca0;
	/*001ca4*/ u32 unk001ca4;
	/*001ca8*/ u32 unk001ca8;
	/*001cac*/ u32 unk001cac;
	/*001cb0*/ u32 unk001cb0;
	/*001cb4*/ u32 unk001cb4;
	/*001cb8*/ u32 unk001cb8;
	/*001cbc*/ u32 unk001cbc;
	/*001cc0*/ u32 unk001cc0;
	/*001cc4*/ u32 unk001cc4;
	/*001cc8*/ u32 unk001cc8;
	/*001ccc*/ u32 unk001ccc;
	/*001cd0*/ u32 unk001cd0;
	/*001cd4*/ u32 unk001cd4;
	/*001cd8*/ u32 unk001cd8;
	/*001cdc*/ u32 unk001cdc;
	/*001ce0*/ u32 unk001ce0;
	/*001ce4*/ u32 unk001ce4;
	/*001ce8*/ u32 unk001ce8;
	/*001cec*/ u32 unk001cec;
	/*001cf0*/ u32 unk001cf0;
	/*001cf4*/ u32 unk001cf4;
	/*001cf8*/ u32 unk001cf8;
	/*001cfc*/ u32 unk001cfc;
	/*001d00*/ u32 unk001d00;
	/*001d04*/ u32 unk001d04;
	/*001d08*/ u32 unk001d08;
	/*001d0c*/ u32 unk001d0c;
	/*001d10*/ u32 unk001d10;
	/*001d14*/ u32 unk001d14;
	/*001d18*/ u32 unk001d18;
	/*001d1c*/ u32 unk001d1c;
	/*001d20*/ u32 unk001d20;
	/*001d24*/ u32 unk001d24;
	/*001d28*/ u32 unk001d28;
	/*001d2c*/ u32 unk001d2c;
	/*001d30*/ u32 unk001d30;
	/*001d34*/ u32 unk001d34;
	/*001d38*/ u32 unk001d38;
	/*001d3c*/ u32 unk001d3c;
	/*001d40*/ u32 unk001d40;
	/*001d44*/ u32 unk001d44;
	/*001d48*/ u32 unk001d48;
	/*001d4c*/ u32 unk001d4c;
	/*001d50*/ u32 unk001d50;
	/*001d54*/ u32 unk001d54;
	/*001d58*/ u32 unk001d58;
	/*001d5c*/ u32 unk001d5c;
	/*001d60*/ u32 unk001d60;
	/*001d64*/ u32 unk001d64;
	/*001d68*/ u32 unk001d68;
	/*001d6c*/ u32 unk001d6c;
	/*001d70*/ u32 unk001d70;
	/*001d74*/ u32 unk001d74;
	/*001d78*/ u32 unk001d78;
	/*001d7c*/ u32 unk001d7c;
	/*001d80*/ u32 unk001d80;
	/*001d84*/ u32 unk001d84;
	/*001d88*/ u32 unk001d88;
	/*001d8c*/ u32 unk001d8c;
	/*001d90*/ u32 unk001d90;
	/*001d94*/ u32 unk001d94;
	/*001d98*/ u32 unk001d98;
	/*001d9c*/ u32 unk001d9c;
	/*001da0*/ u32 unk001da0;
	/*001da4*/ u32 unk001da4;
	/*001da8*/ u32 unk001da8;
	/*001dac*/ u32 unk001dac;
	/*001db0*/ u32 unk001db0;
	/*001db4*/ u32 unk001db4;
	/*001db8*/ u32 unk001db8;
	/*001dbc*/ u32 unk001dbc;
	/*001dc0*/ u32 unk001dc0;
	/*001dc4*/ u32 unk001dc4;
	/*001dc8*/ u32 unk001dc8;
	/*001dcc*/ u32 unk001dcc;
	/*001dd0*/ u32 unk001dd0;
	/*001dd4*/ u32 unk001dd4;
	/*001dd8*/ u32 unk001dd8;
	/*001ddc*/ u32 unk001ddc;
	/*001de0*/ u32 unk001de0;
	/*001de4*/ u32 unk001de4;
	/*001de8*/ u32 unk001de8;
	/*001dec*/ u32 unk001dec;
	/*001df0*/ u32 unk001df0;
	/*001df4*/ u32 unk001df4;
	/*001df8*/ u32 unk001df8;
	/*001dfc*/ u32 unk001dfc;
	/*001e00*/ u32 unk001e00;
	/*001e04*/ u32 unk001e04;
	/*001e08*/ u32 unk001e08;
	/*001e0c*/ u32 unk001e0c;
	/*001e10*/ u32 unk001e10;
	/*001e14*/ u32 unk001e14;
	/*001e18*/ u32 unk001e18;
	/*001e1c*/ u32 unk001e1c;
	/*001e20*/ u32 unk001e20;
	/*001e24*/ u32 unk001e24;
	/*001e28*/ u32 unk001e28;
	/*001e2c*/ u32 unk001e2c;
	/*001e30*/ u32 unk001e30;
	/*001e34*/ u32 unk001e34;
	/*001e38*/ u32 unk001e38;
	/*001e3c*/ u32 unk001e3c;
	/*001e40*/ u32 unk001e40;
	/*001e44*/ u32 unk001e44;
	/*001e48*/ u32 unk001e48;
	/*001e4c*/ u32 unk001e4c;
	/*001e50*/ u32 unk001e50;
	/*001e54*/ u32 unk001e54;
	/*001e58*/ u32 unk001e58;
	/*001e5c*/ u32 unk001e5c;
	/*001e60*/ u32 unk001e60;
	/*001e64*/ u32 unk001e64;
	/*001e68*/ u32 unk001e68;
	/*001e6c*/ u32 unk001e6c;
	/*001e70*/ u32 unk001e70;
	/*001e74*/ u32 unk001e74;
	/*001e78*/ u32 unk001e78;
	/*001e7c*/ u32 unk001e7c;
	/*001e80*/ u32 unk001e80;
	/*001e84*/ u32 unk001e84;
	/*001e88*/ u32 unk001e88;
	/*001e8c*/ u32 unk001e8c;
	/*001e90*/ u32 unk001e90;
	/*001e94*/ u32 unk001e94;
	/*001e98*/ u32 unk001e98;
	/*001e9c*/ u32 unk001e9c;
	/*001ea0*/ u32 unk001ea0;
	/*001ea4*/ u32 unk001ea4;
	/*001ea8*/ u32 unk001ea8;
	/*001eac*/ u32 unk001eac;
	/*001eb0*/ u32 unk001eb0;
	/*001eb4*/ u32 unk001eb4;
	/*001eb8*/ u32 unk001eb8;
	/*001ebc*/ u32 unk001ebc;
	/*001ec0*/ u32 unk001ec0;
	/*001ec4*/ u32 unk001ec4;
	/*001ec8*/ u32 unk001ec8;
	/*001ecc*/ u32 unk001ecc;
	/*001ed0*/ u32 unk001ed0;
	/*001ed4*/ u32 unk001ed4;
	/*001ed8*/ u32 unk001ed8;
	/*001edc*/ u32 unk001edc;
	/*001ee0*/ u32 unk001ee0;
	/*001ee4*/ u32 unk001ee4;
	/*001ee8*/ u32 unk001ee8;
	/*001eec*/ u32 unk001eec;
	/*001ef0*/ u32 unk001ef0;
	/*001ef4*/ u32 unk001ef4;
	/*001ef8*/ u32 unk001ef8;
	/*001efc*/ u32 unk001efc;
	/*001f00*/ u32 unk001f00;
	/*001f04*/ u32 unk001f04;
	/*001f08*/ u32 unk001f08;
	/*001f0c*/ u32 unk001f0c;
	/*001f10*/ u32 unk001f10;
	/*001f14*/ u32 unk001f14;
	/*001f18*/ u32 unk001f18;
	/*001f1c*/ u32 unk001f1c;
	/*001f20*/ u32 unk001f20;
	/*001f24*/ u32 unk001f24;
	/*001f28*/ u32 unk001f28;
	/*001f2c*/ u32 unk001f2c;
	/*001f30*/ u32 unk001f30;
	/*001f34*/ u32 unk001f34;
	/*001f38*/ u32 unk001f38;
	/*001f3c*/ u32 unk001f3c;
	/*001f40*/ u32 unk001f40;
	/*001f44*/ u32 unk001f44;
	/*001f48*/ u32 unk001f48;
	/*001f4c*/ u32 unk001f4c;
	/*001f50*/ u32 unk001f50;
	/*001f54*/ u32 unk001f54;
	/*001f58*/ u32 unk001f58;
	/*001f5c*/ u32 unk001f5c;
	/*001f60*/ u32 unk001f60;
	/*001f64*/ u32 unk001f64;
	/*001f68*/ u32 unk001f68;
	/*001f6c*/ u32 unk001f6c;
	/*001f70*/ u32 unk001f70;
	/*001f74*/ u32 unk001f74;
	/*001f78*/ u32 unk001f78;
	/*001f7c*/ u32 unk001f7c;
	/*001f80*/ u32 unk001f80;
	/*001f84*/ u32 unk001f84;
	/*001f88*/ u32 unk001f88;
	/*001f8c*/ u32 unk001f8c;
	/*001f90*/ u32 unk001f90;
	/*001f94*/ u32 unk001f94;
	/*001f98*/ u32 unk001f98;
	/*001f9c*/ u32 unk001f9c;
	/*001fa0*/ u32 unk001fa0;
	/*001fa4*/ u32 unk001fa4;
	/*001fa8*/ u32 unk001fa8;
	/*001fac*/ u32 unk001fac;
	/*001fb0*/ u32 unk001fb0;
	/*001fb4*/ u32 unk001fb4;
	/*001fb8*/ u32 unk001fb8;
	/*001fbc*/ u32 unk001fbc;
	/*001fc0*/ u32 unk001fc0;
	/*001fc4*/ u32 unk001fc4;
	/*001fc8*/ u32 unk001fc8;
	/*001fcc*/ u32 unk001fcc;
	/*001fd0*/ u32 unk001fd0;
	/*001fd4*/ u32 unk001fd4;
	/*001fd8*/ u32 unk001fd8;
	/*001fdc*/ u32 unk001fdc;
	/*001fe0*/ u32 unk001fe0;
	/*001fe4*/ u32 unk001fe4;
	/*001fe8*/ u32 unk001fe8;
	/*001fec*/ u32 unk001fec;
	/*001ff0*/ u32 unk001ff0;
	/*001ff4*/ u32 unk001ff4;
	/*001ff8*/ u32 unk001ff8;
	/*001ffc*/ u32 unk001ffc;
	/*002000*/ u32 unk002000;
	/*002004*/ u32 unk002004;
	/*002008*/ u32 unk002008;
	/*00200c*/ u32 unk00200c;
	/*002010*/ u32 unk002010;
	/*002014*/ u32 unk002014;
	/*002018*/ u32 unk002018;
	/*00201c*/ u32 unk00201c;
	/*002020*/ u32 unk002020;
	/*002024*/ u32 unk002024;
	/*002028*/ u32 unk002028;
	/*00202c*/ u32 unk00202c;
	/*002030*/ u32 unk002030;
	/*002034*/ u32 unk002034;
	/*002038*/ u32 unk002038;
	/*00203c*/ u32 unk00203c;
	/*002040*/ u32 unk002040;
	/*002044*/ u32 unk002044;
	/*002048*/ u32 unk002048;
	/*00204c*/ u32 unk00204c;
	/*002050*/ u32 unk002050;
	/*002054*/ u32 unk002054;
	/*002058*/ u32 unk002058;
	/*00205c*/ u32 unk00205c;
	/*002060*/ u32 unk002060;
	/*002064*/ u32 unk002064;
	/*002068*/ u32 unk002068;
	/*00206c*/ u32 unk00206c;
	/*002070*/ u32 unk002070;
	/*002074*/ u32 unk002074;
	/*002078*/ u32 unk002078;
	/*00207c*/ u32 unk00207c;
	/*002080*/ u32 unk002080;
	/*002084*/ u32 unk002084;
	/*002088*/ u32 unk002088;
	/*00208c*/ u32 unk00208c;
	/*002090*/ u32 unk002090;
	/*002094*/ u32 unk002094;
	/*002098*/ u32 unk002098;
	/*00209c*/ u32 unk00209c;
	/*0020a0*/ u32 unk0020a0;
	/*0020a4*/ u32 unk0020a4;
	/*0020a8*/ u32 unk0020a8;
	/*0020ac*/ u32 unk0020ac;
	/*0020b0*/ u32 unk0020b0;
	/*0020b4*/ u32 unk0020b4;
	/*0020b8*/ u32 unk0020b8;
	/*0020bc*/ u32 unk0020bc;
	/*0020c0*/ u32 unk0020c0;
	/*0020c4*/ u32 unk0020c4;
	/*0020c8*/ u32 unk0020c8;
	/*0020cc*/ u32 unk0020cc;
	/*0020d0*/ u32 unk0020d0;
	/*0020d4*/ u32 unk0020d4;
	/*0020d8*/ u32 unk0020d8;
	/*0020dc*/ u32 unk0020dc;
	/*0020e0*/ u32 unk0020e0;
	/*0020e4*/ u32 unk0020e4;
	/*0020e8*/ u32 unk0020e8;
	/*0020ec*/ u32 unk0020ec;
	/*0020f0*/ u32 unk0020f0;
	/*0020f4*/ u32 unk0020f4;
	/*0020f8*/ u32 unk0020f8;
	/*0020fc*/ u32 unk0020fc;
	/*002100*/ u32 unk002100;
	/*002104*/ u32 unk002104;
	/*002108*/ u32 unk002108;
	/*00210c*/ u32 unk00210c;
	/*002110*/ u32 unk002110;
	/*002114*/ u32 unk002114;
	/*002118*/ u32 unk002118;
	/*00211c*/ u32 unk00211c;
	/*002120*/ u32 unk002120;
	/*002124*/ u32 unk002124;
	/*002128*/ u32 unk002128;
	/*00212c*/ u32 unk00212c;
	/*002130*/ u32 unk002130;
	/*002134*/ u32 unk002134;
	/*002138*/ u32 unk002138;
	/*00213c*/ u32 unk00213c;
	/*002140*/ u32 unk002140;
	/*002144*/ u32 unk002144;
	/*002148*/ u32 unk002148;
	/*00214c*/ u32 unk00214c;
	/*002150*/ u32 unk002150;
	/*002154*/ u32 unk002154;
	/*002158*/ u32 unk002158;
	/*00215c*/ u32 unk00215c;
	/*002160*/ u32 unk002160;
	/*002164*/ u32 unk002164;
	/*002168*/ u32 unk002168;
	/*00216c*/ u32 unk00216c;
	/*002170*/ u32 unk002170;
	/*002174*/ u32 unk002174;
	/*002178*/ u32 unk002178;
	/*00217c*/ u32 unk00217c;
	/*002180*/ u32 unk002180;
	/*002184*/ u32 unk002184;
	/*002188*/ u32 unk002188;
	/*00218c*/ u32 unk00218c;
	/*002190*/ u32 unk002190;
	/*002194*/ u32 unk002194;
	/*002198*/ u32 unk002198;
	/*00219c*/ u32 unk00219c;
	/*0021a0*/ u32 unk0021a0;
	/*0021a4*/ u32 unk0021a4;
	/*0021a8*/ u32 unk0021a8;
	/*0021ac*/ u32 unk0021ac;
	/*0021b0*/ u32 unk0021b0;
	/*0021b4*/ u32 unk0021b4;
	/*0021b8*/ u32 unk0021b8;
	/*0021bc*/ u32 unk0021bc;
	/*0021c0*/ u32 unk0021c0;
	/*0021c4*/ u32 unk0021c4;
	/*0021c8*/ u32 unk0021c8;
	/*0021cc*/ u32 unk0021cc;
	/*0021d0*/ u32 unk0021d0;
	/*0021d4*/ u32 unk0021d4;
	/*0021d8*/ u32 unk0021d8;
	/*0021dc*/ u32 unk0021dc;
	/*0021e0*/ u32 unk0021e0;
	/*0021e4*/ u32 unk0021e4;
	/*0021e8*/ u32 unk0021e8;
	/*0021ec*/ u32 unk0021ec;
	/*0021f0*/ u32 unk0021f0;
	/*0021f4*/ u32 unk0021f4;
	/*0021f8*/ u32 unk0021f8;
	/*0021fc*/ u32 unk0021fc;
	/*002200*/ u32 unk002200;
	/*002204*/ u32 unk002204;
	/*002208*/ u32 unk002208;
	/*00220c*/ u32 unk00220c;
	/*002210*/ u32 unk002210;
	/*002214*/ u32 unk002214;
	/*002218*/ u32 unk002218;
	/*00221c*/ u32 unk00221c;
	/*002220*/ u32 unk002220;
	/*002224*/ u32 unk002224;
	/*002228*/ u32 unk002228;
	/*00222c*/ u32 unk00222c;
	/*002230*/ u32 unk002230;
	/*002234*/ u32 unk002234;
	/*002238*/ u32 unk002238;
	/*00223c*/ u32 unk00223c;
	/*002240*/ u32 unk002240;
	/*002244*/ u32 unk002244;
	/*002248*/ u32 unk002248;
	/*00224c*/ u32 unk00224c;
	/*002250*/ u32 unk002250;
	/*002254*/ u32 unk002254;
	/*002258*/ u32 unk002258;
	/*00225c*/ u32 unk00225c;
	/*002260*/ u32 unk002260;
	/*002264*/ u32 unk002264;
	/*002268*/ u32 unk002268;
	/*00226c*/ u32 unk00226c;
	/*002270*/ u32 unk002270;
	/*002274*/ u32 unk002274;
	/*002278*/ u32 unk002278;
	/*00227c*/ u32 unk00227c;
	/*002280*/ u32 unk002280;
	/*002284*/ u32 unk002284;
	/*002288*/ u32 unk002288;
	/*00228c*/ u32 unk00228c;
	/*002290*/ u32 unk002290;
	/*002294*/ u32 unk002294;
	/*002298*/ u32 unk002298;
	/*00229c*/ u32 unk00229c;
	/*0022a0*/ u32 unk0022a0;
	/*0022a4*/ u32 unk0022a4;
	/*0022a8*/ u32 unk0022a8;
	/*0022ac*/ u32 unk0022ac;
	/*0022b0*/ u32 unk0022b0;
	/*0022b4*/ u32 unk0022b4;
	/*0022b8*/ u32 unk0022b8;
	/*0022bc*/ u32 unk0022bc;
	/*0022c0*/ u32 unk0022c0;
	/*0022c4*/ u32 unk0022c4;
	/*0022c8*/ u32 unk0022c8;
	/*0022cc*/ u32 unk0022cc;
	/*0022d0*/ u32 unk0022d0;
	/*0022d4*/ u32 unk0022d4;
	/*0022d8*/ u32 unk0022d8;
	/*0022dc*/ u32 unk0022dc;
	/*0022e0*/ u32 unk0022e0;
	/*0022e4*/ u32 unk0022e4;
	/*0022e8*/ u32 unk0022e8;
	/*0022ec*/ u32 unk0022ec;
	/*0022f0*/ u32 unk0022f0;
	/*0022f4*/ u32 unk0022f4;
	/*0022f8*/ u32 unk0022f8;
	/*0022fc*/ u32 unk0022fc;
	/*002300*/ u32 unk002300;
	/*002304*/ u32 unk002304;
	/*002308*/ u32 unk002308;
	/*00230c*/ u32 unk00230c;
	/*002310*/ u32 unk002310;
	/*002314*/ u32 unk002314;
	/*002318*/ u32 unk002318;
	/*00231c*/ u32 unk00231c;
	/*002320*/ u32 unk002320;
	/*002324*/ u32 unk002324;
	/*002328*/ u32 unk002328;
	/*00232c*/ u32 unk00232c;
	/*002330*/ u32 unk002330;
	/*002334*/ u32 unk002334;
	/*002338*/ u32 unk002338;
	/*00233c*/ u32 unk00233c;
	/*002340*/ u32 unk002340;
	/*002344*/ u32 unk002344;
	/*002348*/ u32 unk002348;
	/*00234c*/ u32 unk00234c;
	/*002350*/ u32 unk002350;
	/*002354*/ u32 unk002354;
	/*002358*/ u32 unk002358;
	/*00235c*/ u32 unk00235c;
	/*002360*/ u32 unk002360;
	/*002364*/ u32 unk002364;
	/*002368*/ u32 unk002368;
	/*00236c*/ u32 unk00236c;
	/*002370*/ u32 unk002370;
	/*002374*/ u32 unk002374;
	/*002378*/ u32 unk002378;
	/*00237c*/ u32 unk00237c;
	/*002380*/ u32 unk002380;
	/*002384*/ u32 unk002384;
	/*002388*/ u32 unk002388;
	/*00238c*/ u32 unk00238c;
	/*002390*/ u32 unk002390;
	/*002394*/ u32 unk002394;
	/*002398*/ u32 unk002398;
	/*00239c*/ u32 unk00239c;
	/*0023a0*/ u32 unk0023a0;
	/*0023a4*/ u32 unk0023a4;
	/*0023a8*/ u32 unk0023a8;
	/*0023ac*/ u32 unk0023ac;
	/*0023b0*/ u32 unk0023b0;
	/*0023b4*/ u32 unk0023b4;
	/*0023b8*/ u32 unk0023b8;
	/*0023bc*/ u32 unk0023bc;
	/*0023c0*/ u32 unk0023c0;
	/*0023c4*/ u32 unk0023c4;
	/*0023c8*/ u32 unk0023c8;
	/*0023cc*/ u32 unk0023cc;
	/*0023d0*/ u32 unk0023d0;
	/*0023d4*/ u32 unk0023d4;
	/*0023d8*/ u32 unk0023d8;
	/*0023dc*/ u32 unk0023dc;
	/*0023e0*/ u32 unk0023e0;
	/*0023e4*/ u32 unk0023e4;
	/*0023e8*/ u32 unk0023e8;
	/*0023ec*/ u32 unk0023ec;
	/*0023f0*/ u32 unk0023f0;
	/*0023f4*/ u32 unk0023f4;
	/*0023f8*/ u32 unk0023f8;
	/*0023fc*/ u32 unk0023fc;
	/*002400*/ u32 unk002400;
	/*002404*/ u32 unk002404;
	/*002408*/ u32 unk002408;
	/*00240c*/ u32 unk00240c;
	/*002410*/ u32 unk002410;
	/*002414*/ u32 unk002414;
	/*002418*/ u32 unk002418;
	/*00241c*/ u32 unk00241c;
	/*002420*/ u32 unk002420;
	/*002424*/ u32 unk002424;
	/*002428*/ u32 unk002428;
	/*00242c*/ u32 unk00242c;
	/*002430*/ u32 unk002430;
	/*002434*/ u32 unk002434;
	/*002438*/ u32 unk002438;
	/*00243c*/ u32 unk00243c;
	/*002440*/ u32 unk002440;
	/*002444*/ u32 unk002444;
	/*002448*/ u32 unk002448;
	/*00244c*/ u32 unk00244c;
	/*002450*/ u32 unk002450;
	/*002454*/ u32 unk002454;
	/*002458*/ u32 unk002458;
	/*00245c*/ u32 unk00245c;
	/*002460*/ u32 unk002460;
	/*002464*/ u32 unk002464;
	/*002468*/ u32 unk002468;
	/*00246c*/ u32 unk00246c;
	/*002470*/ u32 unk002470;
	/*002474*/ u32 unk002474;
	/*002478*/ u32 unk002478;
	/*00247c*/ u32 unk00247c;
	/*002480*/ u32 unk002480;
	/*002484*/ u32 unk002484;
	/*002488*/ u32 unk002488;
	/*00248c*/ u32 unk00248c;
	/*002490*/ u32 unk002490;
	/*002494*/ u32 unk002494;
	/*002498*/ u32 unk002498;
	/*00249c*/ u32 unk00249c;
	/*0024a0*/ u32 unk0024a0;
	/*0024a4*/ u32 unk0024a4;
	/*0024a8*/ u32 unk0024a8;
	/*0024ac*/ u32 unk0024ac;
	/*0024b0*/ u32 unk0024b0;
	/*0024b4*/ u32 unk0024b4;
	/*0024b8*/ u32 unk0024b8;
	/*0024bc*/ u32 unk0024bc;
	/*0024c0*/ u32 unk0024c0;
	/*0024c4*/ u32 unk0024c4;
	/*0024c8*/ u32 unk0024c8;
	/*0024cc*/ u32 unk0024cc;
	/*0024d0*/ u32 unk0024d0;
	/*0024d4*/ u32 unk0024d4;
	/*0024d8*/ u32 unk0024d8;
	/*0024dc*/ u32 unk0024dc;
	/*0024e0*/ u32 unk0024e0;
	/*0024e4*/ u32 unk0024e4;
	/*0024e8*/ u32 unk0024e8;
	/*0024ec*/ u32 unk0024ec;
	/*0024f0*/ u32 unk0024f0;
	/*0024f4*/ u32 unk0024f4;
	/*0024f8*/ u32 unk0024f8;
	/*0024fc*/ u32 unk0024fc;
	/*002500*/ u32 unk002500;
	/*002504*/ u32 unk002504;
	/*002508*/ u32 unk002508;
	/*00250c*/ u32 unk00250c;
	/*002510*/ u32 unk002510;
	/*002514*/ u32 unk002514;
	/*002518*/ u32 unk002518;
	/*00251c*/ u32 unk00251c;
	/*002520*/ u32 unk002520;
	/*002524*/ u32 unk002524;
	/*002528*/ u32 unk002528;
	/*00252c*/ u32 unk00252c;
	/*002530*/ u32 unk002530;
	/*002534*/ u32 unk002534;
	/*002538*/ u32 unk002538;
	/*00253c*/ u32 unk00253c;
	/*002540*/ u32 unk002540;
	/*002544*/ u32 unk002544;
	/*002548*/ u32 unk002548;
	/*00254c*/ u32 unk00254c;
	/*002550*/ u32 unk002550;
	/*002554*/ u32 unk002554;
	/*002558*/ u32 unk002558;
	/*00255c*/ u32 unk00255c;
	/*002560*/ u32 unk002560;
	/*002564*/ u32 unk002564;
	/*002568*/ u32 unk002568;
	/*00256c*/ u32 unk00256c;
	/*002570*/ u32 unk002570;
	/*002574*/ u32 unk002574;
	/*002578*/ u32 unk002578;
	/*00257c*/ u32 unk00257c;
	/*002580*/ u32 unk002580;
	/*002584*/ u32 unk002584;
	/*002588*/ u32 unk002588;
	/*00258c*/ u32 unk00258c;
	/*002590*/ u32 unk002590;
	/*002594*/ u32 unk002594;
	/*002598*/ u32 unk002598;
	/*00259c*/ u32 unk00259c;
	/*0025a0*/ u32 unk0025a0;
	/*0025a4*/ u32 unk0025a4;
	/*0025a8*/ u32 unk0025a8;
	/*0025ac*/ u32 unk0025ac;
	/*0025b0*/ u32 unk0025b0;
	/*0025b4*/ u32 unk0025b4;
	/*0025b8*/ u32 unk0025b8;
	/*0025bc*/ u32 unk0025bc;
	/*0025c0*/ u32 unk0025c0;
	/*0025c4*/ u32 unk0025c4;
	/*0025c8*/ u32 unk0025c8;
	/*0025cc*/ u32 unk0025cc;
	/*0025d0*/ u32 unk0025d0;
	/*0025d4*/ u32 unk0025d4;
	/*0025d8*/ u32 unk0025d8;
	/*0025dc*/ u32 unk0025dc;
	/*0025e0*/ u32 unk0025e0;
	/*0025e4*/ u32 unk0025e4;
	/*0025e8*/ u32 unk0025e8;
	/*0025ec*/ u32 unk0025ec;
	/*0025f0*/ u32 unk0025f0;
	/*0025f4*/ u32 unk0025f4;
	/*0025f8*/ u32 unk0025f8;
	/*0025fc*/ u32 unk0025fc;
	/*002600*/ u32 unk002600;
	/*002604*/ u32 unk002604;
	/*002608*/ u32 unk002608;
	/*00260c*/ u32 unk00260c;
	/*002610*/ u32 unk002610;
	/*002614*/ u32 unk002614;
	/*002618*/ u32 unk002618;
	/*00261c*/ u32 unk00261c;
	/*002620*/ u32 unk002620;
	/*002624*/ u32 unk002624;
	/*002628*/ u32 unk002628;
	/*00262c*/ u32 unk00262c;
	/*002630*/ u32 unk002630;
	/*002634*/ u32 unk002634;
	/*002638*/ u32 unk002638;
	/*00263c*/ u32 unk00263c;
	/*002640*/ u32 unk002640;
	/*002644*/ u32 unk002644;
	/*002648*/ u32 unk002648;
	/*00264c*/ u32 unk00264c;
	/*002650*/ u32 unk002650;
	/*002654*/ u32 unk002654;
	/*002658*/ u32 unk002658;
	/*00265c*/ u32 unk00265c;
	/*002660*/ u32 unk002660;
	/*002664*/ u32 unk002664;
	/*002668*/ u32 unk002668;
	/*00266c*/ u32 unk00266c;
	/*002670*/ u32 unk002670;
	/*002674*/ u32 unk002674;
	/*002678*/ u32 unk002678;
	/*00267c*/ u32 unk00267c;
	/*002680*/ u32 unk002680;
	/*002684*/ u32 unk002684;
	/*002688*/ u32 unk002688;
	/*00268c*/ u32 unk00268c;
	/*002690*/ u32 unk002690;
	/*002694*/ u32 unk002694;
	/*002698*/ u32 unk002698;
	/*00269c*/ u32 unk00269c;
	/*0026a0*/ u32 unk0026a0;
	/*0026a4*/ u32 unk0026a4;
	/*0026a8*/ u32 unk0026a8;
	/*0026ac*/ u32 unk0026ac;
	/*0026b0*/ u32 unk0026b0;
	/*0026b4*/ u32 unk0026b4;
	/*0026b8*/ u32 unk0026b8;
	/*0026bc*/ u32 unk0026bc;
	/*0026c0*/ u32 unk0026c0;
	/*0026c4*/ u32 unk0026c4;
	/*0026c8*/ u32 unk0026c8;
	/*0026cc*/ u32 unk0026cc;
	/*0026d0*/ u32 unk0026d0;
	/*0026d4*/ u32 unk0026d4;
	/*0026d8*/ u32 unk0026d8;
	/*0026dc*/ u32 unk0026dc;
	/*0026e0*/ u32 unk0026e0;
	/*0026e4*/ u32 unk0026e4;
	/*0026e8*/ u32 unk0026e8;
	/*0026ec*/ u32 unk0026ec;
	/*0026f0*/ u32 unk0026f0;
	/*0026f4*/ u32 unk0026f4;
	/*0026f8*/ u32 unk0026f8;
	/*0026fc*/ u32 unk0026fc;
	/*002700*/ u32 unk002700;
	/*002704*/ u32 unk002704;
	/*002708*/ u32 unk002708;
	/*00270c*/ u32 unk00270c;
	/*002710*/ u32 unk002710;
	/*002714*/ u32 unk002714;
	/*002718*/ u32 unk002718;
	/*00271c*/ u32 unk00271c;
	/*002720*/ u32 unk002720;
	/*002724*/ u32 unk002724;
	/*002728*/ u32 unk002728;
	/*00272c*/ u32 unk00272c;
	/*002730*/ u32 unk002730;
	/*002734*/ u32 unk002734;
	/*002738*/ u32 unk002738;
	/*00273c*/ u32 unk00273c;
	/*002740*/ u32 unk002740;
	/*002744*/ u32 unk002744;
	/*002748*/ u32 unk002748;
	/*00274c*/ u32 unk00274c;
	/*002750*/ u32 unk002750;
	/*002754*/ u32 unk002754;
	/*002758*/ u32 unk002758;
	/*00275c*/ u32 unk00275c;
	/*002760*/ u32 unk002760;
	/*002764*/ u32 unk002764;
	/*002768*/ u32 unk002768;
	/*00276c*/ u32 unk00276c;
	/*002770*/ u32 unk002770;
	/*002774*/ u32 unk002774;
	/*002778*/ u32 unk002778;
	/*00277c*/ u32 unk00277c;
	/*002780*/ u32 unk002780;
	/*002784*/ u32 unk002784;
	/*002788*/ u32 unk002788;
	/*00278c*/ u32 unk00278c;
	/*002790*/ u32 unk002790;
	/*002794*/ u32 unk002794;
	/*002798*/ u32 unk002798;
	/*00279c*/ u32 unk00279c;
	/*0027a0*/ u32 unk0027a0;
	/*0027a4*/ u32 unk0027a4;
	/*0027a8*/ u32 unk0027a8;
	/*0027ac*/ u32 unk0027ac;
	/*0027b0*/ u32 unk0027b0;
	/*0027b4*/ u32 unk0027b4;
	/*0027b8*/ u32 unk0027b8;
	/*0027bc*/ u32 unk0027bc;
	/*0027c0*/ u32 unk0027c0;
	/*0027c4*/ u32 unk0027c4;
	/*0027c8*/ u32 unk0027c8;
	/*0027cc*/ u32 unk0027cc;
	/*0027d0*/ u32 unk0027d0;
	/*0027d4*/ u32 unk0027d4;
	/*0027d8*/ u32 unk0027d8;
	/*0027dc*/ u32 unk0027dc;
	/*0027e0*/ u32 unk0027e0;
	/*0027e4*/ u32 unk0027e4;
	/*0027e8*/ u32 unk0027e8;
	/*0027ec*/ u32 unk0027ec;
	/*0027f0*/ u32 unk0027f0;
	/*0027f4*/ u32 unk0027f4;
	/*0027f8*/ u32 unk0027f8;
	/*0027fc*/ u32 unk0027fc;
	/*002800*/ u32 unk002800;
	/*002804*/ u32 unk002804;
	/*002808*/ u32 unk002808;
	/*00280c*/ u32 unk00280c;
	/*002810*/ u32 unk002810;
	/*002814*/ u32 unk002814;
	/*002818*/ u32 unk002818;
	/*00281c*/ u32 unk00281c;
	/*002820*/ u32 unk002820;
	/*002824*/ u32 unk002824;
	/*002828*/ u32 unk002828;
	/*00282c*/ u32 unk00282c;
	/*002830*/ u32 unk002830;
	/*002834*/ u32 unk002834;
	/*002838*/ u32 unk002838;
	/*00283c*/ u32 unk00283c;
	/*002840*/ u32 unk002840;
	/*002844*/ u32 unk002844;
	/*002848*/ u32 unk002848;
	/*00284c*/ u32 unk00284c;
	/*002850*/ u32 unk002850;
	/*002854*/ u32 unk002854;
	/*002858*/ u32 unk002858;
	/*00285c*/ u32 unk00285c;
	/*002860*/ u32 unk002860;
	/*002864*/ u32 unk002864;
	/*002868*/ u32 unk002868;
	/*00286c*/ u32 unk00286c;
	/*002870*/ u32 unk002870;
	/*002874*/ u32 unk002874;
	/*002878*/ u32 unk002878;
	/*00287c*/ u32 unk00287c;
	/*002880*/ u32 unk002880;
	/*002884*/ u32 unk002884;
	/*002888*/ u32 unk002888;
	/*00288c*/ u32 unk00288c;
	/*002890*/ u32 unk002890;
	/*002894*/ u32 unk002894;
	/*002898*/ u32 unk002898;
	/*00289c*/ u32 unk00289c;
	/*0028a0*/ u32 unk0028a0;
	/*0028a4*/ u32 unk0028a4;
	/*0028a8*/ u32 unk0028a8;
	/*0028ac*/ u32 unk0028ac;
	/*0028b0*/ u32 unk0028b0;
	/*0028b4*/ u32 unk0028b4;
	/*0028b8*/ u32 unk0028b8;
	/*0028bc*/ u32 unk0028bc;
	/*0028c0*/ u32 unk0028c0;
	/*0028c4*/ u32 unk0028c4;
	/*0028c8*/ u32 unk0028c8;
	/*0028cc*/ u32 unk0028cc;
	/*0028d0*/ u32 unk0028d0;
	/*0028d4*/ u32 unk0028d4;
	/*0028d8*/ u32 unk0028d8;
	/*0028dc*/ u32 unk0028dc;
	/*0028e0*/ u32 unk0028e0;
	/*0028e4*/ u32 unk0028e4;
	/*0028e8*/ u32 unk0028e8;
	/*0028ec*/ u32 unk0028ec;
	/*0028f0*/ u32 unk0028f0;
	/*0028f4*/ u32 unk0028f4;
	/*0028f8*/ u32 unk0028f8;
	/*0028fc*/ u32 unk0028fc;
	/*002900*/ u32 unk002900;
	/*002904*/ u32 unk002904;
	/*002908*/ u32 unk002908;
	/*00290c*/ u32 unk00290c;
	/*002910*/ u32 unk002910;
	/*002914*/ u32 unk002914;
	/*002918*/ u32 unk002918;
	/*00291c*/ u32 unk00291c;
	/*002920*/ u32 unk002920;
	/*002924*/ u32 unk002924;
	/*002928*/ u32 unk002928;
	/*00292c*/ u32 unk00292c;
	/*002930*/ u32 unk002930;
	/*002934*/ u32 unk002934;
	/*002938*/ u32 unk002938;
	/*00293c*/ u32 unk00293c;
	/*002940*/ u32 unk002940;
	/*002944*/ u32 unk002944;
	/*002948*/ u32 unk002948;
	/*00294c*/ u32 unk00294c;
	/*002950*/ u32 unk002950;
	/*002954*/ u32 unk002954;
	/*002958*/ u32 unk002958;
	/*00295c*/ u32 unk00295c;
	/*002960*/ u32 unk002960;
	/*002964*/ u32 unk002964;
	/*002968*/ u32 unk002968;
	/*00296c*/ u32 unk00296c;
	/*002970*/ u32 unk002970;
	/*002974*/ u32 unk002974;
	/*002978*/ u32 unk002978;
	/*00297c*/ u32 unk00297c;
	/*002980*/ u32 unk002980;
	/*002984*/ u32 unk002984;
	/*002988*/ u32 unk002988;
	/*00298c*/ u32 unk00298c;
	/*002990*/ u32 unk002990;
	/*002994*/ u32 unk002994;
	/*002998*/ u32 unk002998;
	/*00299c*/ u32 unk00299c;
	/*0029a0*/ u32 unk0029a0;
	/*0029a4*/ u32 unk0029a4;
	/*0029a8*/ u32 unk0029a8;
	/*0029ac*/ u32 unk0029ac;
	/*0029b0*/ u32 unk0029b0;
	/*0029b4*/ u32 unk0029b4;
	/*0029b8*/ u32 unk0029b8;
	/*0029bc*/ u32 unk0029bc;
	/*0029c0*/ u32 unk0029c0;
	/*0029c4*/ u32 unk0029c4;
	/*0029c8*/ u32 unk0029c8;
	/*0029cc*/ u32 unk0029cc;
	/*0029d0*/ u32 unk0029d0;
	/*0029d4*/ u32 unk0029d4;
	/*0029d8*/ u32 unk0029d8;
	/*0029dc*/ u32 unk0029dc;
	/*0029e0*/ u32 unk0029e0;
	/*0029e4*/ u32 unk0029e4;
	/*0029e8*/ u32 unk0029e8;
	/*0029ec*/ u32 unk0029ec;
	/*0029f0*/ u32 unk0029f0;
	/*0029f4*/ u32 unk0029f4;
	/*0029f8*/ u32 unk0029f8;
	/*0029fc*/ u32 unk0029fc;
	/*002a00*/ u32 unk002a00;
	/*002a04*/ u32 unk002a04;
	/*002a08*/ u32 unk002a08;
	/*002a0c*/ u32 unk002a0c;
	/*002a10*/ u32 unk002a10;
	/*002a14*/ u32 unk002a14;
	/*002a18*/ u32 unk002a18;
	/*002a1c*/ u32 unk002a1c;
	/*002a20*/ u32 unk002a20;
	/*002a24*/ u32 unk002a24;
	/*002a28*/ u32 unk002a28;
	/*002a2c*/ u32 unk002a2c;
	/*002a30*/ u32 unk002a30;
	/*002a34*/ u32 unk002a34;
	/*002a38*/ u32 unk002a38;
	/*002a3c*/ u32 unk002a3c;
	/*002a40*/ u32 unk002a40;
	/*002a44*/ u32 unk002a44;
	/*002a48*/ u32 unk002a48;
	/*002a4c*/ u32 unk002a4c;
	/*002a50*/ u32 unk002a50;
	/*002a54*/ u32 unk002a54;
	/*002a58*/ u32 unk002a58;
	/*002a5c*/ u32 unk002a5c;
	/*002a60*/ u32 unk002a60;
	/*002a64*/ u32 unk002a64;
	/*002a68*/ u32 unk002a68;
	/*002a6c*/ u32 unk002a6c;
	/*002a70*/ u32 unk002a70;
	/*002a74*/ u32 unk002a74;
	/*002a78*/ u32 unk002a78;
	/*002a7c*/ u32 unk002a7c;
	/*002a80*/ u32 unk002a80;
	/*002a84*/ u32 unk002a84;
	/*002a88*/ u32 unk002a88;
	/*002a8c*/ u32 unk002a8c;
	/*002a90*/ u32 unk002a90;
	/*002a94*/ u32 unk002a94;
	/*002a98*/ u32 unk002a98;
	/*002a9c*/ u32 unk002a9c;
	/*002aa0*/ u32 unk002aa0;
	/*002aa4*/ u32 unk002aa4;
	/*002aa8*/ u32 unk002aa8;
	/*002aac*/ u32 unk002aac;
	/*002ab0*/ u32 unk002ab0;
	/*002ab4*/ u32 unk002ab4;
	/*002ab8*/ u32 unk002ab8;
	/*002abc*/ u32 unk002abc;
	/*002ac0*/ u32 unk002ac0;
	/*002ac4*/ u32 unk002ac4;
	/*002ac8*/ u32 unk002ac8;
	/*002acc*/ u32 unk002acc;
	/*002ad0*/ u32 unk002ad0;
	/*002ad4*/ u32 unk002ad4;
	/*002ad8*/ u32 unk002ad8;
	/*002adc*/ u32 unk002adc;
	/*002ae0*/ u32 unk002ae0;
	/*002ae4*/ u32 unk002ae4;
	/*002ae8*/ u32 unk002ae8;
	/*002aec*/ u32 unk002aec;
	/*002af0*/ u32 unk002af0;
	/*002af4*/ u32 unk002af4;
	/*002af8*/ u32 unk002af8;
	/*002afc*/ u32 unk002afc;
	/*002b00*/ u32 unk002b00;
	/*002b04*/ u32 unk002b04;
	/*002b08*/ u32 unk002b08;
	/*002b0c*/ u32 unk002b0c;
	/*002b10*/ u32 unk002b10;
	/*002b14*/ u32 unk002b14;
	/*002b18*/ u32 unk002b18;
	/*002b1c*/ u32 unk002b1c;
	/*002b20*/ u32 unk002b20;
	/*002b24*/ u32 unk002b24;
	/*002b28*/ u32 unk002b28;
	/*002b2c*/ u32 unk002b2c;
	/*002b30*/ u32 unk002b30;
	/*002b34*/ u32 unk002b34;
	/*002b38*/ u32 unk002b38;
	/*002b3c*/ u32 unk002b3c;
	/*002b40*/ u32 unk002b40;
	/*002b44*/ u32 unk002b44;
	/*002b48*/ u32 unk002b48;
	/*002b4c*/ u32 unk002b4c;
	/*002b50*/ u32 unk002b50;
	/*002b54*/ u32 unk002b54;
	/*002b58*/ u32 unk002b58;
	/*002b5c*/ u32 unk002b5c;
	/*002b60*/ u32 unk002b60;
	/*002b64*/ u32 unk002b64;
	/*002b68*/ u32 unk002b68;
	/*002b6c*/ u32 unk002b6c;
	/*002b70*/ u32 unk002b70;
	/*002b74*/ u32 unk002b74;
	/*002b78*/ u32 unk002b78;
	/*002b7c*/ u32 unk002b7c;
	/*002b80*/ u32 unk002b80;
	/*002b84*/ u32 unk002b84;
	/*002b88*/ u32 unk002b88;
	/*002b8c*/ u32 unk002b8c;
	/*002b90*/ u32 unk002b90;
	/*002b94*/ u32 unk002b94;
	/*002b98*/ u32 unk002b98;
	/*002b9c*/ u32 unk002b9c;
	/*002ba0*/ u32 unk002ba0;
	/*002ba4*/ u32 unk002ba4;
	/*002ba8*/ u32 unk002ba8;
	/*002bac*/ u32 unk002bac;
	/*002bb0*/ u32 unk002bb0;
	/*002bb4*/ u32 unk002bb4;
	/*002bb8*/ u32 unk002bb8;
	/*002bbc*/ u32 unk002bbc;
	/*002bc0*/ u32 unk002bc0;
	/*002bc4*/ u32 unk002bc4;
	/*002bc8*/ u32 unk002bc8;
	/*002bcc*/ u32 unk002bcc;
	/*002bd0*/ u32 unk002bd0;
	/*002bd4*/ u32 unk002bd4;
	/*002bd8*/ u32 unk002bd8;
	/*002bdc*/ u32 unk002bdc;
	/*002be0*/ u32 unk002be0;
	/*002be4*/ u32 unk002be4;
	/*002be8*/ u32 unk002be8;
	/*002bec*/ u32 unk002bec;
	/*002bf0*/ u32 unk002bf0;
	/*002bf4*/ u32 unk002bf4;
	/*002bf8*/ u32 unk002bf8;
	/*002bfc*/ u32 unk002bfc;
	/*002c00*/ u32 unk002c00;
	/*002c04*/ u32 unk002c04;
	/*002c08*/ u32 unk002c08;
	/*002c0c*/ u32 unk002c0c;
	/*002c10*/ u32 unk002c10;
	/*002c14*/ u32 unk002c14;
	/*002c18*/ u32 unk002c18;
	/*002c1c*/ u32 unk002c1c;
	/*002c20*/ u32 unk002c20;
	/*002c24*/ u32 unk002c24;
	/*002c28*/ u32 unk002c28;
	/*002c2c*/ u32 unk002c2c;
	/*002c30*/ u32 unk002c30;
	/*002c34*/ u32 unk002c34;
	/*002c38*/ u32 unk002c38;
	/*002c3c*/ u32 unk002c3c;
	/*002c40*/ u32 unk002c40;
	/*002c44*/ u32 unk002c44;
	/*002c48*/ u32 unk002c48;
	/*002c4c*/ u32 unk002c4c;
	/*002c50*/ u32 unk002c50;
	/*002c54*/ u32 unk002c54;
	/*002c58*/ u32 unk002c58;
	/*002c5c*/ u32 unk002c5c;
	/*002c60*/ u32 unk002c60;
	/*002c64*/ u32 unk002c64;
	/*002c68*/ u32 unk002c68;
	/*002c6c*/ u32 unk002c6c;
	/*002c70*/ u32 unk002c70;
	/*002c74*/ u32 unk002c74;
	/*002c78*/ u32 unk002c78;
	/*002c7c*/ u32 unk002c7c;
	/*002c80*/ u32 unk002c80;
	/*002c84*/ u32 unk002c84;
	/*002c88*/ u32 unk002c88;
	/*002c8c*/ u32 unk002c8c;
	/*002c90*/ u32 unk002c90;
	/*002c94*/ u32 unk002c94;
	/*002c98*/ u32 unk002c98;
	/*002c9c*/ u32 unk002c9c;
	/*002ca0*/ u32 unk002ca0;
	/*002ca4*/ u32 unk002ca4;
	/*002ca8*/ u32 unk002ca8;
	/*002cac*/ u32 unk002cac;
	/*002cb0*/ u32 unk002cb0;
	/*002cb4*/ u32 unk002cb4;
	/*002cb8*/ u32 unk002cb8;
	/*002cbc*/ u32 unk002cbc;
	/*002cc0*/ u32 unk002cc0;
	/*002cc4*/ u32 unk002cc4;
	/*002cc8*/ u32 unk002cc8;
	/*002ccc*/ u32 unk002ccc;
	/*002cd0*/ u32 unk002cd0;
	/*002cd4*/ u32 unk002cd4;
	/*002cd8*/ u32 unk002cd8;
	/*002cdc*/ u32 unk002cdc;
	/*002ce0*/ u32 unk002ce0;
	/*002ce4*/ u32 unk002ce4;
	/*002ce8*/ u32 unk002ce8;
	/*002cec*/ u32 unk002cec;
	/*002cf0*/ u32 unk002cf0;
	/*002cf4*/ u32 unk002cf4;
	/*002cf8*/ u32 unk002cf8;
	/*002cfc*/ u32 unk002cfc;
	/*002d00*/ u32 unk002d00;
	/*002d04*/ u32 unk002d04;
	/*002d08*/ u32 unk002d08;
	/*002d0c*/ u32 unk002d0c;
	/*002d10*/ u32 unk002d10;
	/*002d14*/ u32 unk002d14;
	/*002d18*/ u32 unk002d18;
	/*002d1c*/ u32 unk002d1c;
	/*002d20*/ u32 unk002d20;
	/*002d24*/ u32 unk002d24;
	/*002d28*/ u32 unk002d28;
	/*002d2c*/ u32 unk002d2c;
	/*002d30*/ u32 unk002d30;
	/*002d34*/ u32 unk002d34;
	/*002d38*/ u32 unk002d38;
	/*002d3c*/ u32 unk002d3c;
	/*002d40*/ u32 unk002d40;
	/*002d44*/ u32 unk002d44;
	/*002d48*/ u32 unk002d48;
	/*002d4c*/ u32 unk002d4c;
	/*002d50*/ u32 unk002d50;
	/*002d54*/ u32 unk002d54;
	/*002d58*/ u32 unk002d58;
	/*002d5c*/ u32 unk002d5c;
	/*002d60*/ u32 unk002d60;
	/*002d64*/ u32 unk002d64;
	/*002d68*/ u32 unk002d68;
	/*002d6c*/ u32 unk002d6c;
	/*002d70*/ u32 unk002d70;
	/*002d74*/ u32 unk002d74;
	/*002d78*/ u32 unk002d78;
	/*002d7c*/ u32 unk002d7c;
	/*002d80*/ u32 unk002d80;
	/*002d84*/ u32 unk002d84;
	/*002d88*/ u32 unk002d88;
	/*002d8c*/ u32 unk002d8c;
	/*002d90*/ u32 unk002d90;
	/*002d94*/ u32 unk002d94;
	/*002d98*/ u32 unk002d98;
	/*002d9c*/ u32 unk002d9c;
	/*002da0*/ u32 unk002da0;
	/*002da4*/ u32 unk002da4;
	/*002da8*/ u32 unk002da8;
	/*002dac*/ u32 unk002dac;
	/*002db0*/ u32 unk002db0;
	/*002db4*/ u32 unk002db4;
	/*002db8*/ u32 unk002db8;
	/*002dbc*/ u32 unk002dbc;
	/*002dc0*/ u32 unk002dc0;
	/*002dc4*/ u32 unk002dc4;
	/*002dc8*/ u32 unk002dc8;
	/*002dcc*/ u32 unk002dcc;
	/*002dd0*/ u32 unk002dd0;
	/*002dd4*/ u32 unk002dd4;
	/*002dd8*/ u32 unk002dd8;
	/*002ddc*/ u32 unk002ddc;
	/*002de0*/ u32 unk002de0;
	/*002de4*/ u32 unk002de4;
	/*002de8*/ u32 unk002de8;
	/*002dec*/ u32 unk002dec;
	/*002df0*/ u32 unk002df0;
	/*002df4*/ u32 unk002df4;
	/*002df8*/ u32 unk002df8;
	/*002dfc*/ u32 unk002dfc;
	/*002e00*/ u32 unk002e00;
	/*002e04*/ u32 unk002e04;
	/*002e08*/ u32 unk002e08;
	/*002e0c*/ u32 unk002e0c;
	/*002e10*/ u32 unk002e10;
	/*002e14*/ u32 unk002e14;
	/*002e18*/ u32 unk002e18;
	/*002e1c*/ u32 unk002e1c;
	/*002e20*/ u32 unk002e20;
	/*002e24*/ u32 unk002e24;
	/*002e28*/ u32 unk002e28;
	/*002e2c*/ u32 unk002e2c;
	/*002e30*/ u32 unk002e30;
	/*002e34*/ u32 unk002e34;
	/*002e38*/ u32 unk002e38;
	/*002e3c*/ u32 unk002e3c;
	/*002e40*/ u32 unk002e40;
	/*002e44*/ u32 unk002e44;
	/*002e48*/ u32 unk002e48;
	/*002e4c*/ u32 unk002e4c;
	/*002e50*/ u32 unk002e50;
	/*002e54*/ u32 unk002e54;
	/*002e58*/ u32 unk002e58;
	/*002e5c*/ u32 unk002e5c;
	/*002e60*/ u32 unk002e60;
	/*002e64*/ u32 unk002e64;
	/*002e68*/ u32 unk002e68;
	/*002e6c*/ u32 unk002e6c;
	/*002e70*/ u32 unk002e70;
	/*002e74*/ u32 unk002e74;
	/*002e78*/ u32 unk002e78;
	/*002e7c*/ u32 unk002e7c;
	/*002e80*/ u32 unk002e80;
	/*002e84*/ u32 unk002e84;
	/*002e88*/ u32 unk002e88;
	/*002e8c*/ u32 unk002e8c;
	/*002e90*/ u32 unk002e90;
	/*002e94*/ u32 unk002e94;
	/*002e98*/ u32 unk002e98;
	/*002e9c*/ u32 unk002e9c;
	/*002ea0*/ u32 unk002ea0;
	/*002ea4*/ u32 unk002ea4;
	/*002ea8*/ u32 unk002ea8;
	/*002eac*/ u32 unk002eac;
	/*002eb0*/ u32 unk002eb0;
	/*002eb4*/ u32 unk002eb4;
	/*002eb8*/ u32 unk002eb8;
	/*002ebc*/ u32 unk002ebc;
	/*002ec0*/ u32 unk002ec0;
	/*002ec4*/ u32 unk002ec4;
	/*002ec8*/ u32 unk002ec8;
	/*002ecc*/ u32 unk002ecc;
	/*002ed0*/ u32 unk002ed0;
	/*002ed4*/ u32 unk002ed4;
	/*002ed8*/ u32 unk002ed8;
	/*002edc*/ u32 unk002edc;
	/*002ee0*/ u32 unk002ee0;
	/*002ee4*/ u32 unk002ee4;
	/*002ee8*/ u32 unk002ee8;
	/*002eec*/ u32 unk002eec;
	/*002ef0*/ u32 unk002ef0;
	/*002ef4*/ u32 unk002ef4;
	/*002ef8*/ u32 unk002ef8;
	/*002efc*/ u32 unk002efc;
	/*002f00*/ u32 unk002f00;
	/*002f04*/ u32 unk002f04;
	/*002f08*/ u32 unk002f08;
	/*002f0c*/ u32 unk002f0c;
	/*002f10*/ u32 unk002f10;
	/*002f14*/ u32 unk002f14;
	/*002f18*/ u32 unk002f18;
	/*002f1c*/ u32 unk002f1c;
	/*002f20*/ u32 unk002f20;
	/*002f24*/ u32 unk002f24;
	/*002f28*/ u32 unk002f28;
	/*002f2c*/ u32 unk002f2c;
	/*002f30*/ u32 unk002f30;
	/*002f34*/ u32 unk002f34;
	/*002f38*/ u32 unk002f38;
	/*002f3c*/ u32 unk002f3c;
	/*002f40*/ u32 unk002f40;
	/*002f44*/ u32 unk002f44;
	/*002f48*/ u32 unk002f48;
	/*002f4c*/ u32 unk002f4c;
	/*002f50*/ u32 unk002f50;
	/*002f54*/ u32 unk002f54;
	/*002f58*/ u32 unk002f58;
	/*002f5c*/ u32 unk002f5c;
	/*002f60*/ u32 unk002f60;
	/*002f64*/ u32 unk002f64;
	/*002f68*/ u32 unk002f68;
	/*002f6c*/ u32 unk002f6c;
	/*002f70*/ u32 unk002f70;
	/*002f74*/ u32 unk002f74;
	/*002f78*/ u32 unk002f78;
	/*002f7c*/ u32 unk002f7c;
	/*002f80*/ u32 unk002f80;
	/*002f84*/ u32 unk002f84;
	/*002f88*/ u32 unk002f88;
	/*002f8c*/ u32 unk002f8c;
	/*002f90*/ u32 unk002f90;
	/*002f94*/ u32 unk002f94;
	/*002f98*/ u32 unk002f98;
	/*002f9c*/ u32 unk002f9c;
	/*002fa0*/ u32 unk002fa0;
	/*002fa4*/ u32 unk002fa4;
	/*002fa8*/ u32 unk002fa8;
	/*002fac*/ u32 unk002fac;
	/*002fb0*/ u32 unk002fb0;
	/*002fb4*/ u32 unk002fb4;
	/*002fb8*/ u32 unk002fb8;
	/*002fbc*/ u32 unk002fbc;
	/*002fc0*/ u32 unk002fc0;
	/*002fc4*/ u32 unk002fc4;
	/*002fc8*/ u32 unk002fc8;
	/*002fcc*/ u32 unk002fcc;
	/*002fd0*/ u32 unk002fd0;
	/*002fd4*/ u32 unk002fd4;
	/*002fd8*/ u32 unk002fd8;
	/*002fdc*/ u32 unk002fdc;
	/*002fe0*/ u32 unk002fe0;
	/*002fe4*/ u32 unk002fe4;
	/*002fe8*/ u32 unk002fe8;
	/*002fec*/ u32 unk002fec;
	/*002ff0*/ u32 unk002ff0;
	/*002ff4*/ u32 unk002ff4;
	/*002ff8*/ u32 unk002ff8;
	/*002ffc*/ u32 unk002ffc;
	/*003000*/ u32 unk003000;
	/*003004*/ u32 unk003004;
	/*003008*/ u32 unk003008;
	/*00300c*/ u32 unk00300c;
	/*003010*/ u32 unk003010;
	/*003014*/ u32 unk003014;
	/*003018*/ u32 unk003018;
	/*00301c*/ u32 unk00301c;
	/*003020*/ u32 unk003020;
	/*003024*/ u32 unk003024;
	/*003028*/ u32 unk003028;
	/*00302c*/ u32 unk00302c;
	/*003030*/ u32 unk003030;
	/*003034*/ u32 unk003034;
	/*003038*/ u32 unk003038;
	/*00303c*/ u32 unk00303c;
	/*003040*/ u32 unk003040;
	/*003044*/ u32 unk003044;
	/*003048*/ u32 unk003048;
	/*00304c*/ u32 unk00304c;
	/*003050*/ u32 unk003050;
	/*003054*/ u32 unk003054;
	/*003058*/ u32 unk003058;
	/*00305c*/ u32 unk00305c;
	/*003060*/ u32 unk003060;
	/*003064*/ u32 unk003064;
	/*003068*/ u32 unk003068;
	/*00306c*/ u32 unk00306c;
	/*003070*/ u32 unk003070;
	/*003074*/ u32 unk003074;
	/*003078*/ u32 unk003078;
	/*00307c*/ u32 unk00307c;
	/*003080*/ u32 unk003080;
	/*003084*/ u32 unk003084;
	/*003088*/ u32 unk003088;
	/*00308c*/ u32 unk00308c;
	/*003090*/ u32 unk003090;
	/*003094*/ u32 unk003094;
	/*003098*/ u32 unk003098;
	/*00309c*/ u32 unk00309c;
	/*0030a0*/ u32 unk0030a0;
	/*0030a4*/ u32 unk0030a4;
	/*0030a8*/ u32 unk0030a8;
	/*0030ac*/ u32 unk0030ac;
	/*0030b0*/ u32 unk0030b0;
	/*0030b4*/ u32 unk0030b4;
	/*0030b8*/ u32 unk0030b8;
	/*0030bc*/ u32 unk0030bc;
	/*0030c0*/ u32 unk0030c0;
	/*0030c4*/ u32 unk0030c4;
	/*0030c8*/ u32 unk0030c8;
	/*0030cc*/ u32 unk0030cc;
	/*0030d0*/ u32 unk0030d0;
	/*0030d4*/ u32 unk0030d4;
	/*0030d8*/ u32 unk0030d8;
	/*0030dc*/ u32 unk0030dc;
	/*0030e0*/ u32 unk0030e0;
	/*0030e4*/ u32 unk0030e4;
	/*0030e8*/ u32 unk0030e8;
	/*0030ec*/ u32 unk0030ec;
	/*0030f0*/ u32 unk0030f0;
	/*0030f4*/ u32 unk0030f4;
	/*0030f8*/ u32 unk0030f8;
	/*0030fc*/ u32 unk0030fc;
	/*003100*/ u32 unk003100;
};

extern struct g_vars g_Vars;

extern s32 g_NumTags;
extern struct tag **g_TagPtrs;
