[
    {
        "id": "L_AZT_000",
        "en": "|Background - \n\nFollowing Elvis's last-ditch maneuver, the three craft involved have crashed close together in the Alaskan wilderness. The whereabouts of the President are uncertain, and a cloud of ECM jamming is preventing rescuers from finding the site of the crash.\n\n|Carrington - \n\nAt this moment in time, this one-way text messaging system is the only way we can communicate with you, Joanna. If you can remove the source of the jamming, then we can get a fix on your location and send help. But locating and ensuring the safety of the President should be your most important task.\n\n|Objective One: - Retrieve Presidential Medical Scanner\n\nThis device is constantly updating the President's medical history and is able to maintain a check on his state of health. You will need it if you are to ensure his well-being.\n\n|Objective Two: - Activate Distress Beacon\n\nIt won't do much good until the jamming is down, but if you activate the beacon in the escape pod, it will shorten the response time of the rescue teams.\n\n|Objective Three: - Shut Down Enemy Jamming Device\n\nA sophisticated jamming device is flooding the area with impenetrable ECM cover. You might be able to pinpoint the source on the ground more effectively than our high-altitude overflights are doing. Once located, shut the source down so we can fix your position and get help.\n\n|Objective Four: - Retire Presidential Clone\n\nIt would be detrimental to the security of the United States of America to have two identical people claiming to be the President, issuing orders with absolute authority. Identify the imposter and remove the threat.\n\n|Objective Five: - Locate and Rescue President\n\nThis is your highest priority. The safety of the President is paramount. You must find a way to safeguard him until help arrives or the danger is past.\n\nEND\n",
        "gb": "|Background - \n\nFollowing Elvis's last-ditch maneuver, the three craft involved have crashed close together in the Alaskan wilderness. The whereabouts of the President are uncertain, and a cloud of ECM jamming is preventing rescuers from finding the site of the crash.\n\n|Carrington - \n\nAt this moment in time, this one-way text messaging system is the only way we can communicate with you, Joanna. If you can remove the source of the jamming, then we can get a fix on your location and send help. But locating and ensuring the safety of the President should be your most important task.\n\n|Objective One: - Retrieve Presidential Medical Scanner\n\nThis device is constantly updating the President's medical history and is able to maintain a check on his state of health. You will need it if you are to ensure his well-being.\n\n|Objective Two: - Activate Distress Beacon\n\nIt won't do much good until the jamming is down, but if you activate the beacon in the escape pod, it will shorten the response time of the rescue teams.\n\n|Objective Three: - Shut Down Enemy Jamming Device\n\nA sophisticated jamming device is flooding the area with impenetrable ECM cover. You might be able to pinpoint the source on the ground more effectively than our high-altitude overflights are doing. Once located, shut the source down so we can fix your position and get help.\n\n|Objective Four: - Retire Presidential Clone\n\nIt would be detrimental to the security of the United States of America to have two identical people claiming to be the President, issuing orders with absolute authority. Identify the imposter and remove the threat.\n\n|Objective Five: - Locate and Rescue President\n\nThis is your highest priority. The safety of the President is paramount. You must find a way to safeguard him until help arrives or the danger is past.\n\nEND\n",
        "jp": "|Background - \n\nFollowing Elvis' last-ditch manoeuvre, the three craft involved have crashed close together in the Alaskan wilderness. The whereabouts of the President are uncertain and a cloud of ECM jamming is preventing rescuers from finding the site of the crash.\n\n|Carrington - \n\nAt this moment in time, this one-way text messaging system is the only way we can communicate with you, Joanna. If you can remove the source of the jamming then we can get a fix on your location and send help. But locating and ensuring the safety of the President should be your most important task.\n\n|Objective One: - Retrieve Presidential Medical Scanner\n\nThis device is constantly updating the President's medical history, and is able to maintain a check n his state of health. You will need it if you are to ensure his wellbeing.\n\n|Objective Two: - Activate Distress Beacon\n\nIt won't do much good until the jamming is down, but if you activate the beacon in the escape pod it will shorten the response time of the rescue teams.\n\n|Objective Three: - Shutdown Enemy Jamming Device\n\nA sophisticated jamming device is flooding the area with impenetrable ECM cover. You might be able to pinpoint the source on the ground more effectively than our high-altitude overflights are doing. Once located, shut the source down so we can fix your position and get help.\n\n|Objective Four: - Retire Presidential Clone\n\nIt would be detrimental to the security of the United States of America to have to identical people claiming to be the President, issuing orders with absolute authority. Identify the imposter and remove the threat.\n\n|Objective Five: - Locate And Rescue President\n\nThis is your highest priority. The safety of the President is paramount. You must find a way to safeguard him until help arrives or the danger is past.\n\nEND\n",
        "it": "|Situazione:\n\nIn seguito al tentativo disperato di Elvis i tre velivoli coinvolti nell'incidente si sono schiantati nella foresta dell'Alaska vicini l'uno all'altro. La posizione del Presidente è ancora sconosciuta; inoltre un forte campo di onde di disturbo ECM sta complicando la vita ai soccorritori che non riescono a localizzare il luogo del disastro.\n\n|Carrington:\n\nIn questo momento, l'unico nostro canale di comunicazione con te, Joanna, è costituito da questo sistema di invio messaggi a senso unico. Se riesci ad eliminare la fonte del disturbo, potremmo identificare la tua posizione e mandarti dei rinforzi. Tuttavia il tuo primo obiettivo è quello di scoprire la posizione del Presidente e garantirne la sicurezza.\n\n|Obiettivo 1: - Recupera scanner medico del Presidente\n\nQuesto dispositivo aggiorna continuamente l'anamnesi del Presidente ed è in grado di monitorare costantemente il suo stato di salute. Per garantirgli buone condizioni di salute dovrai trovare lo scanner.\n\n|Obiettivo 2: - Attiva il segnale di pericolo\n\nPer ridurre il tempo di reazione delle squadre di salvataggio attiva il segnale di pericolo nella capsula di salvataggio. Sappi tuttavia che non sarà molto efficace finché non avrai eliminato il campo di onde di disturbo.\n\n|Obiettivo 3: - Disattiva dispositivo di disturbo nemico\n\nUn sofisticato dispositivo per la generazione di segnali di disturbo rende l'area impenetrabile per mezzo di una fitta rete di onde ECM. Sorvolando la zona ad alta quota non riusciamo ad identificare la fonte, ma dalla tua posizione a terra dovrebbe essere più facile localizzarla e disattivarla. Fatto ciò potremo accertare le tue coordinate e mandarti dei rinforzi. \n\n|Obiettivo 4 - Trova ed elimina il clone del Presidente\n\nSarebbe disastroso per l'incolumità degli Stati Uniti d'America scoprire di avere due persone identiche che affermano di essere il Presidente e che impartiscono ordini con autorità assoluta. Identifica l'impostore ed elimina tale minaccia.\n\n|Obiettivo 5: - Trova e salva il Presidente\n\nQuesta è la tua priorità assoluta. La sicurezza del Presidente è della massima importanza. Devi trovare il modo di assicurarne l'incolumità fino all'arrivo dei rinforzi e comunque fintanto che sussiste il pericolo.\n\nFINE\n",
        "fr": "|Briefing - \n\nEn suivant la dernière manoeuvre d'Elvis, les trois appareils impliqués se sont écrasés ensemble en Alaska. La position du Président est incertaine et un écran de brouillage CME empêche toute action de sauvetage ou de localisation du site.\n\n|Carrington - \n\nPour l'instant nous ne pouvons que vous envoyer des messages, Joanna. Si vous parvenez à éliminer la source du brouillage, nous pourrons déterminer votre position et envoyer de l'aide. Trouver et protéger le Président demeure en revanche votre priorité absolue.\n\n|Objectif 1: - Récupérer scanner médical présidentiel\n\nCet appareil actualise en permanence le journal médical du Président et lui assure un état de santé stable. Trouvez-le pour garder le Président en bonne santé.\n\n|Objectif 2: - Activer le signal de détresse\n\nCelui-ci ne sera efficace qu'une fois le brouillage éliminé mais s'il est activé au point d'évacuation, les équipes de sauvetage arriveront plus vite.\n\n|Objectif 3: - Désactiver appareil brouillage\n\nUn système ennemi sophistiqué inonde le secteur d'un brouillage CME impénétrable. Vous pourrez déterminer sa position plus facilement au sol que nos appareils en altitude. Une fois trouvé, coupez le courant et nous vous fournirons de l'aide.\n\n|Objectif 4: - Eliminer le clone du Président\n\nLa sécurité des Etats Unis serait menacée si deux individus identiques ayant tout pouvoir affirmaient être le Président. Identifiez l'imposteur et éliminez la menace.\n\n|Objectif 5: - Trouver et sauver le Président\n\nCet objectif est votre priorité. La sécurité du Président est vitale. Il vous faut le protéger à tout prix avant l'arrivée de renforts ou écarter tout danger.\n\nFIN\n",
        "de": "|Hintergrund - \n\nDie Auswertung und Weiterführung des letzten Ausweichmanövers von Elvis hat ergeben, dass die drei Flugzeuge, die in den Unfall verwickelt waren, in der Wildnis von Alaska abgestürzt sind. Der genaue Aufenthaltsort des Präsidenten ist ungewiss, da ein starkes Dämpfungsfeld eine genauere Ortung nicht zulässt.\n\n|Carrington - \n\nMomentan ist dieses Empfangsgerät die einzige Möglichkeit, mit Ihnen zu kommunizieren, Joanna. Wenn Sie die Quelle des Dämpfungsfeldes ausschalten können, dann sind wir in der Lage, Ihren Standort genau zu lokalisieren. Aber oberste Priorität genießt die Sicherheit des Präsidenten. Ihn zu finden, ist Ihre wichtigste Aufgabe!\n\n|1. Ziel: - Finden Sie den medizinischen Scanner des Präsidenten!\n\nDieses Gerät zeichnet ständig die medizinischen Daten des Präsidenten auf. Mit seiner Hilfe können Sie Daten über den Gesundheitszustand des Präsidenten abrufen. Um sicherzustellen, dass er unversehrt bleibt, benötigen Sie dieses Gerät auf jeden Fall!\n\n|2. Ziel: - Aktivieren Sie das Notsignal!\n\nUm zu gewährleisten, dass das Rettungsteam rascher vor Ort eintrifft, sollten Sie das Notsignal in der Fluchtkapsel aktivieren. Solange das Dämpfungsfeld aktiv ist, verschafft Ihnen diese Aktion allerdings nur bedingten Spielraum.\n\n|3. Ziel: - Deaktivieren Sie den ECM-Generator!\n\nEin High-Tech ECM-Generator sichert das Gebiet durch ein schier undurchdringliches ECM-Feld. Von Ihrem Standort aus sind Sie vermutlich eher in der Lage, die Quelle des Dämpfungs-Signals ausfindig zu machen, als unsere Luft-Aufklärer. Schalten Sie den Generator ab, sobald Sie ihn gefunden haben. Erst dann können wir Sie orten und Ihnen zu Hilfe kommen.\n\n|4. Ziel: - Eliminieren Sie den Präsidenten-Klon!\n\nDie Sicherheit der Vereinigten Staaten wäre nicht mehr gewährleistet, wenn es plötzlich zwei Personen geben würde, die von sich behaupten, der Präsident zu sein. Identifizieren Sie den Betrüger und beseitigen Sie diese potentielle Bedrohung!\n\n|5. Ziel: - Orten und retten Sie den Präsidenten!\n\nDer Sicherheit des Präsidenten kommt die allerhöchste Priorität zu. Sie müssen UNBEDINGT für seine Sicherheit sorgen, bis Hilfe eintrifft!\n\nENDE\n",
        "es": "|Antecedentes - \n\nSiguiendo la última maniobra de Elvis, las tres naves involucradas han chocado entre sí en pleno ecosistema de Alaska. Se desconoce el paradero del Presidente, y una nube de bloqueo ECM evita que el equipo de rescate encuentre el lugar del accidente.\n\n|Carrington - \n\nEn este preciso instante, este sistema de mensajes de texto unidireccional es el único modo con que podemos comunicarnos, Joanna. Si puedes eliminar la fuente del bloqueo, entonces podremos fijar tu posición para enviar ayuda. Pero localizar y asegurar la integridad del Presidente debe ser tu tarea más importante.\n\n|Objetivo Uno: - Recuperar Escáner Médico del Presidente\n\nEste dispositivo está actualizando constantemente el historial médico del Presidente y es capaz de chequear su estado de salud. Lo necesitarás para asegurarte de que está en buenas condiciones.\n\n|Objetivo Dos: - Activar la Señal de Socorro\n\nNo hará nada hasta que caiga el bloqueo, pero si activas la Señal de Socorro en la cápsula de escape, acortará el tiempo de respuesta de los equipos de rescate.\n\n|Objetivo Tres: - Desconectar Dispositivo de Bloqueo Enemigo\n\nUn sofisticado dispositivo de bloqueo está inundando el área con una cobertura de impenetrable ECM. Tienes que ser capaz de rastrear la fuente de tierra más efectivamente de lo que nuestros aviones espía están haciendo. Una vez localizada, apaga la fuente para que podamos fijar tu posición y enviemos ayuda.\n\n|Objetivo Cuatro: - Eliminar al Clon del Presidente\n\nSerá perjudicial para la seguridad de los Estados Unidos de América tener dos personas idénticas clamando ser el Presidente, dando órdenes con absoluta autoridad. Identifica al impostor y elimina la amenaza.\n\n|Objetivo Cinco: - Localizar y Rescatar al Presidente\n\nÉsta es tu mayor prioridad. La seguridad del Presidente es de suma importancia. Debes encontrar la manera de protegerle hasta que llegue la ayuda o el peligro haya pasado.\n\nFIN\n"
    },
    {
        "id": "L_AZT_001",
        "en": "CRASH SITE\n",
        "gb": "CRASH SITE\n",
        "jp": "CRASH SITE\n",
        "it": "LUOGO DEL DISASTRO\n",
        "fr": "SITE du CRASH\n",
        "de": "ABSTURZSTELLE\n",
        "es": "LUGAR DEL IMPACTO\n"
    },
    {
        "id": "L_AZT_002",
        "en": "|Background - \n\nFollowing Elvis's last-ditch maneuver, the three craft involved have crashed close together in the Alaskan wilderness. The whereabouts of the President are uncertain, and a cloud of ECM jamming is preventing rescuers from finding the site of the crash.\n\n|Carrington - \n\nAt this moment in time, this one-way text messaging system is the only way we can communicate with you, Joanna. If you can remove the source of the jamming, then we can get a fix on your location and send help. But locating and ensuring the safety of the President should be your most important task.\n\n|Objective One: - Retrieve Presidential Medical Scanner\n\nThis device is constantly updating the President's medical history and is able to maintain a check on his state of health. You will need it if you are to ensure his well-being.\n\n|Objective Two: - Activate Distress Beacon\n\nIt won't do much good until the jamming is down, but if you activate the beacon in the escape pod, it will shorten the response time of the rescue teams.\n\n|Objective Three: - Retire Presidential Clone\n\nIt would be detrimental to the security of the United States of America to have two identical people claiming to be the President, issuing orders with absolute authority. Identify the imposter and remove the threat.\n\n|Objective Four: - Locate and Rescue President\n\nThis is your highest priority. The safety of the President is paramount. You must find a way to safeguard him until help arrives or the danger is past.\n\nEND\n",
        "gb": "|Background - \n\nFollowing Elvis's last-ditch maneuver, the three craft involved have crashed close together in the Alaskan wilderness. The whereabouts of the President are uncertain, and a cloud of ECM jamming is preventing rescuers from finding the site of the crash.\n\n|Carrington - \n\nAt this moment in time, this one-way text messaging system is the only way we can communicate with you, Joanna. If you can remove the source of the jamming, then we can get a fix on your location and send help. But locating and ensuring the safety of the President should be your most important task.\n\n|Objective One: - Retrieve Presidential Medical Scanner\n\nThis device is constantly updating the President's medical history and is able to maintain a check on his state of health. You will need it if you are to ensure his well-being.\n\n|Objective Two: - Activate Distress Beacon\n\nIt won't do much good until the jamming is down, but if you activate the beacon in the escape pod, it will shorten the response time of the rescue teams.\n\n|Objective Three: - Retire Presidential Clone\n\nIt would be detrimental to the security of the United States of America to have two identical people claiming to be the President, issuing orders with absolute authority. Identify the imposter and remove the threat.\n\n|Objective Four: - Locate and Rescue President\n\nThis is your highest priority. The safety of the President is paramount. You must find a way to safeguard him until help arrives or the danger is past.\n\nEND\n",
        "jp": "|Background - \n\nFollowing Elvis' last-ditch manoeuvre, the three craft involved have crashed close together in the Alaskan wilderness. The whereabouts of the President are uncertain and a cloud of ECM jamming is preventing rescuers from finding the site of the crash.\n\n|Carrington - \n\nAt this moment in time, this one-way text messaging system is the only way we can communicate with you, Joanna. If you can remove the source of the jamming then we can get a fix on your location and send help. But locating and ensuring the safety of the President should be your most important task.\n\n|Objective One: - Retrieve Presidential Medical Scanner\n\nThis device is constantly updating the President's medical history, and is able to maintain a check n his state of health. You will need it if you are to ensure his wellbeing.\n\n|Objective Two: - Activate Distress Beacon\n\nIt won't do much good until the jamming is down, but if you activate the beacon in the escape pod it will shorten the response time of the rescue teams.\n\n|Objective Three: - Shutdown Enemy Jamming Device\n\nA sophisticated jamming device is flooding the area with impenetrable ECM cover. You might be able to pinpoint the source on the ground more effectively than our high-altitude overflights are doing. Once located, shut the source down so we can fix your position and get help.\n\n|Objective Four: - Locate And Rescue President\n\nThis is your highest priority. The safety of the President is paramount. You must find a way to safeguard him until help arrives or the danger is past\n\nEND\n",
        "it": "|Situazione:\n\nIn seguito al tentativo disperato di Elvis i tre velivoli coinvolti nell'incidente si sono schiantati nella foresta dell'Alaska vicini l'uno all'altro. La posizione del Presidente è ancora sconosciuta; inoltre un forte campo di onde di disturbo ECM sta complicando la vita ai soccorritori che non riescono a localizzare il luogo del disastro.\n\n|Carrington:\n\nIn questo momento, l'unico nostro canale di comunicazione con te, Joanna, è costituito da questo sistema di invio messaggi a senso unico. Se riesci ad eliminare la fonte del disturbo, potremmo identificare la tua posizione e mandarti dei rinforzi. Tuttavia il tuo primo obiettivo è quello di scoprire la posizione del Presidente e garantirne la sicurezza.\n\n|Obiettivo 1: - Recupera scanner medico del Presidente\n\nQuesto dispositivo aggiorna continuamente l'anamnesi del Presidente ed è in grado di monitorare costantemente il suo stato di salute. Per garantirgli buone condizioni di salute dovrai trovare lo scanner.\n\n|Obiettivo 2: - Attiva il segnale di pericolo\n\nPer ridurre il tempo di reazione delle squadre di salvataggio attiva il segnale di pericolo nella capsula di salvataggio. Sappi tuttavia che non sarà molto efficace finché non avrai eliminato il campo di onde di disturbo.\n\n|Obiettivo 3: - Trova ed elimina il clone del Presidente\n\nSarebbe disastroso per l'incolumità degli Stati Uniti d'America scoprire di avere due persone identiche che affermano di essere il Presidente e che impartiscono ordini con autorità assoluta. Identifica l'impostore ed elimina tale minaccia.\n\n|Obiettivo 4: - Trova e salva il Presidente\n\nQuesta è la tua priorità assoluta. La sicurezza del Presidente è della massima importanza. Devi trovare il modo di assicurarne l'incolumità fino all'arrivo dei rinforzi e comunque fintanto che sussiste il pericolo.\n\nFINE\n",
        "fr": "|Briefing - \n\nEn suivant la dernière manoeuvre d'Elvis, les trois appareils impliqués se sont écrasés ensemble en Alaska. La position du Président est incertaine et un écran de brouillage CME empêche toute action de sauvetage ou de localisation du site.\n\n|Carrington - \n\nPour l'instant nous ne pouvons que vous envoyer des messages, Joanna. Si vous parvenez à éliminer la source du brouillage, nous pourrons déterminer votre position et envoyer de l'aide. Trouver et protéger le Président demeure en revanche votre priorité absolue.\n\n|Objectif 1: - Récupérer scanner médical présidentiel\n\nCet appareil actualise en permanence le journal médical du Président et lui assure un état de santé stable. Trouvez-le pour garder le Président en bonne santé.\n\n|Objectif 2: - Activer le signal de détresse\n\nCelui-ci ne sera efficace qu'une fois le brouillage éliminé mais s'il est activé au point d'évacuation, les équipes de sauvetage arriveront plus vite.\n\n|Objectif 3: - Eliminer le clone du Président\n\nLa sécurité des Etats Unis serait menacée si deux individus identiques ayant tout pouvoir affirmaient être le Président. Identifiez l'imposteur et éliminez la menace.\n\n|Objectif 4: - Trouver et sauver le Président\n\nCet objectif est votre priorité. La sécurité du Président est vitale. Il vous faut le protéger à tout prix avant l'arrivée de renforts ou écarter tout danger.\n\nFIN\n",
        "de": "|Hintergrund - \n\nDie Auswertung und Weiterführung des letzten Ausweichmanövers von Elvis hat ergeben, dass die drei Flugzeuge, die in den Unfall verwickelt waren, in der Wildnis von Alaska abgestürzt sind. Der genaue Aufenthaltsort des Präsidenten ist ungewiss, da ein starkes Dämpfungsfeld eine genauere Ortung nicht zulässt.\n\n|Carrington - \n\nMomentan ist dieses Empfangsgerät die einzige Möglichkeit, mit Ihnen zu kommunizieren, Joanna. Wenn Sie die Quelle des Dämpfungsfeldes ausschalten können, dann sind wir in der Lage, Ihren Standort genau zu lokalisieren. Aber oberste Priorität genießt die Sicherheit des Präsidenten. Ihn zu finden, ist Ihre wichtigste Aufgabe!\n\n|1. Ziel: - Finden Sie den medizinischen Scanner des Präsidenten!\n\nDieses Gerät zeichnet ständig die medizinischen Daten des Präsidenten auf. Mit seiner Hilfe können Sie Daten über den Gesundheitszustand des Präsidenten abrufen. Um sicherzustellen, dass er unversehrt bleibt, benötigen Sie dieses Gerät auf jeden Fall!\n\n|2. Ziel: - Aktivieren Sie das Notsignal!\n\nUm zu gewährleisten, dass das Rettungsteam rascher vor Ort eintrifft, sollten Sie das Notsignal in der Fluchtkapsel aktivieren. Solange das Dämpfungsfeld aktiv ist, verschafft Ihnen diese Aktion allerdings nur bedingten Spielraum.\n\n|3. Ziel: - Eliminieren Sie den Präsidenten-Klon!\n\nDie Sicherheit der Vereinigten Staaten wäre nicht mehr gewährleistet, wenn es plötzlich zwei Personen geben würde, die von sich behaupten, der Präsident zu sein. Identifizieren Sie den Betrüger und beseitigen Sie diese potentielle Bedrohung!\n\n|4. Ziel: - Orten und retten Sie den Präsidenten!\n\nDer Sicherheit des Präsidenten kommt die allerhöchste Priorität zu. Sie müssen UNBEDINGT für seine Sicherheit sorgen, bis Hilfe eintrifft!\n\nENDE\n",
        "es": "|Antecedentes - \n\nSiguiendo la última maniobra de Elvis, las tres naves involucradas han chocado entre sí en pleno ecosistema de Alaska. Se desconoce el paradero del Presidente, y una nube de bloqueo ECM evita que el equipo de rescate encuentre el lugar del accidente.\n\n|Carrington - \n\nEn este preciso instante, este sistema de mensajes de texto unidireccional es el único modo con que podemos comunicarnos, Joanna. Si puedes eliminar la fuente del bloqueo, entonces podremos fijar tu posición para enviar ayuda. Pero localizar y asegurar la integridad del Presidente debe ser tu tarea más importante.\n\n|Objetivo Uno: - Recuperar Escáner Médico del Presidente\n\nEste dispositivo está actualizando constantemente el historial médico del Presidente y es capaz de chequear su estado de salud. Lo necesitarás para asegurarte de que está en buenas condiciones.\n\n|Objetivo Dos: - Activar la Señal de Socorro\n\nNo hará nada hasta que caiga el bloqueo, pero si activas la Señal de Socorro en la cápsula de escape, acortará el tiempo de respuesta de los equipos de rescate.\n\n|Objetivo Tres: - Eliminar al Clon del Presidente\n\nSerá perjudicial para la seguridad de los Estados Unidos de América tener dos personas idénticas clamando ser el Presidente, dando órdenes con absoluta autoridad. Identifica al impostor y elimina la amenaza.\n\n|Objetivo Cuatro: - Localizar y Rescatar al Presidente\n\nÉsta es tu mayor prioridad. La seguridad del Presidente es de suma importancia. Debes encontrar la manera de protegerle hasta que llegue la ayuda o el peligro haya pasado.\n\nFIN\n"
    },
    {
        "id": "L_AZT_003",
        "en": "|Background - \n\nFollowing Elvis's last-ditch maneuver, the three craft involved have crashed close together in the Alaskan wilderness. The whereabouts of the President are uncertain, and a cloud of ECM jamming is preventing rescuers from finding the site of the crash.\n\n|Carrington - \n\nAt this moment in time, this one-way text messaging system is the only way we can communicate with you, Joanna. If you can remove the source of the jamming, then we can get a fix on your location and send help. But locating and ensuring the safety of the President should be your most important task.\n\n|Objective One: - Activate Distress Beacon\n\nIt won't do much good until the jamming is down, but if you activate the beacon in the escape pod, it will shorten the response time of the rescue teams.\n\n|Objective Two: - Retire Presidential Clone\n\nIt would be detrimental to the security of the United States of America to have two identical people claiming to be the President, issuing orders with absolute authority. Identify the imposter and remove the threat.\n\n|Objective Three: - Locate and Rescue President\n\nThis is your highest priority. The safety of the President is paramount. You must find a way to safeguard him until help arrives or the danger is past.\n\nEND\n",
        "gb": "|Background - \n\nFollowing Elvis's last-ditch maneuver, the three craft involved have crashed close together in the Alaskan wilderness. The whereabouts of the President are uncertain, and a cloud of ECM jamming is preventing rescuers from finding the site of the crash.\n\n|Carrington - \n\nAt this moment in time, this one-way text messaging system is the only way we can communicate with you, Joanna. If you can remove the source of the jamming, then we can get a fix on your location and send help. But locating and ensuring the safety of the President should be your most important task.\n\n|Objective One: - Activate Distress Beacon\n\nIt won't do much good until the jamming is down, but if you activate the beacon in the escape pod, it will shorten the response time of the rescue teams.\n\n|Objective Two: - Retire Presidential Clone\n\nIt would be detrimental to the security of the United States of America to have two identical people claiming to be the President, issuing orders with absolute authority. Identify the imposter and remove the threat.\n\n|Objective Three: - Locate and Rescue President\n\nThis is your highest priority. The safety of the President is paramount. You must find a way to safeguard him until help arrives or the danger is past.\n\nEND\n",
        "jp": "|Background - \n\nFollowing Elvis' last-ditch manoeuvre, the three craft involved have crashed close together in the Alaskan wilderness. The whereabouts of the President are uncertain and a cloud of ECM jamming is preventing rescuers from finding the site of the crash.\n\n|Carrington - \n\nAt this moment in time, this one-way text messaging system is the only way we can communicate with you, Joanna. If you can remove the source of the jamming then we can get a fix on your location and send help. But locating and ensuring the safety of the President should be your most important task.\n\n|Objective One: - Retrieve Presidential Medical Scanner\n\nThis device is constantly updating the President's medical history, and is able to maintain a check n his state of health. You will need it if you are to ensure his wellbeing.\n\n|Objective Two: - Shutdown Enemy Jamming Device\n\nA sophisticated jamming device is flooding the area with impenetrable ECM cover. You might be able to pinpoint the source on the ground more effectively than our high-altitude overflights are doing. Once located, shut the source down so we can fix your position and get help.\n\n|Objective Three: - Locate And Rescue President\n\nThis is your highest priority. The safety of the President is paramount. You must find a way to safeguard him until help arrives or the danger is past\n\nEND\n",
        "it": "|Situazione:\n\nIn seguito al tentativo disperato di Elvis i tre velivoli coinvolti nell'incidente si sono schiantati nella foresta dell'Alaska vicini l'uno all'altro. La posizione del Presidente è ancora sconosciuta; inoltre un forte campo di onde di disturbo ECM sta complicando la vita ai soccorritori che non riescono a localizzare il luogo del disastro.\n\n|Carrington:\n\nIn questo momento, l'unico nostro canale di comunicazione con te, Joanna, è costituito da questo sistema di invio messaggi a senso unico. Se riesci ad eliminare la fonte del disturbo, potremmo identificare la tua posizione e mandarti dei rinforzi. Tuttavia il tuo primo obiettivo è quello di scoprire la posizione del Presidente e garantirne la sicurezza.\n\n|Obiettivo 1: - Attiva il segnale di pericolo\n\nPer ridurre il tempo di reazione delle squadre di salvataggio attiva il segnale di pericolo nella capsula di salvataggio. Sappi tuttavia che non sarà molto efficace finché non avrai eliminato il campo di onde di disturbo.\n\n|Obiettivo 2: - Trova ed elimina il clone del Presidente\n\nSarebbe disastroso per l'incolumità degli Stati Uniti d'America scoprire di avere due persone identiche che affermano di essere il Presidente e che impartiscono ordini con autorità assoluta. Identifica l'impostore ed elimina tale minaccia.\n\n|Obiettivo 3: - Trova e salva il Presidente\n\nQuesta è la tua priorità assoluta. La sicurezza del Presidente è della massima importanza. Devi trovare il modo di assicurarne l'incolumità fino all'arrivo dei rinforzi e comunque fintanto che sussiste il pericolo.\n\nFINE\n",
        "fr": "|Briefing - \n\nEn suivant la dernière manoeuvre d'Elvis, les trois appareils impliqués se sont écrasés ensemble en Alaska. La position du Président est incertaine et un écran de brouillage CME empêche toute action de sauvetage ou de localisation du site.\n\n|Carrington - \n\nPour l'instant nous ne pouvons que vous envoyer des messages, Joanna. Si vous parvenez à éliminer la source du brouillage, nous pourrons déterminer votre position et envoyer de l'aide. Trouver et protéger le Président demeure en revanche votre priorité absolue.\n\n|Objectif 1: - Activer le signal de détresse\n\nCelui-ci ne sera efficace qu'une fois le brouillage éliminé mais s'il est activé au point d'évacuation, les équipes de sauvetage arriveront plus vite.\n\n|Objectif 2: - Eliminer le clone du Président\n\nLa sécurité des Etats Unis serait menacée si deux individus identiques ayant tout pouvoir affirmaient être le Président. Identifiez l'imposteur et éliminez la menace.\n\n|Objectif 3: - Trouver et sauver le Président\n\nCet objectif est votre priorité. La sécurité du Président est vitale. Il vous faut le protéger à tout prix avant l'arrivée de renforts ou écarter tout danger.\n\nFIN\n",
        "de": "|Hintergrund - \n\nDie Auswertung und Weiterführung des letzten Ausweichmanövers von Elvis hat ergeben, dass die drei Flugzeuge, die in den Unfall verwickelt waren, in der Wildnis von Alaska abgestürzt sind. Der genaue Aufenthaltsort des Präsidenten ist ungewiss, da ein starkes Dämpfungsfeld eine genauere Ortung nicht zulässt.\n\n|Carrington - \n\nMomentan ist dieses Empfangsgerät die einzige Möglichkeit, mit Ihnen zu kommunizieren, Joanna. Wenn Sie die Quelle des Dämpfungsfeldes ausschalten können, dann sind wir in der Lage, Ihren Standort genau zu lokalisieren. Aber oberste Priorität genießt die Sicherheit des Präsidenten. Ihn zu finden, ist Ihre wichtigste Aufgabe!\n\n|1. Ziel: - Aktivieren Sie das Notsignal!\n\nUm zu gewährleisten, dass das Rettungsteam rascher vor Ort eintrifft, sollten Sie das Notsignal in der Fluchtkapsel aktivieren. Solange das Dämpfungsfeld aktiv ist, verschafft Ihnen diese Aktion allerdings nur bedingten Spielraum.\n\n|2. Ziel: - Eliminieren Sie den Präsidenten-Klon!\n\nDie Sicherheit der Vereinigten Staaten wäre nicht mehr gewährleistet, wenn es plötzlich zwei Personen geben würde, die von sich behaupten, der Präsident zu sein. Identifizieren Sie den Betrüger und beseitigen Sie diese potentielle Bedrohung!\n\n|3. Ziel: - Orten und retten Sie den Präsidenten!\n\nDer Sicherheit des Präsidenten kommt die allerhöchste Priorität zu. Sie müssen UNBEDINGT für seine Sicherheit sorgen, bis Hilfe eintrifft!\n\nENDE\n",
        "es": "|Antecedentes - \n\nSiguiendo la última maniobra de Elvis, las tres naves involucradas han chocado entre sí en pleno ecosistema de Alaska. Se desconoce el paradero del Presidente, y una nube de bloqueo ECM evita que el equipo de rescate encuentre el lugar del accidente.\n\n|Carrington - \n\nEn este preciso instante, este sistema de mensajes de texto unidireccional es el único modo con que podemos comunicarnos, Joanna. Si puedes eliminar la fuente del bloqueo, entonces podremos fijar tu posición para enviar ayuda. Pero localizar y asegurar la integridad del Presidente debe ser tu tarea más importante.\n\n|Objetivo Uno: - Activar la Señal de Socorro\n\nNo hará nada hasta que caiga el bloqueo, pero si activas la Señal de Socorro en la cápsula de escape, acortará el tiempo de respuesta de los equipos de rescate.\n\n|Objetivo Dos: - Eliminar al Clon del Presidente\n\nSerá perjudicial para la seguridad de los Estados Unidos de América tener dos personas idénticas clamando ser el Presidente, dando órdenes con absoluta autoridad. Identifica al impostor y elimina la amenaza.\n\n|Objetivo Tres: - Localizar y Rescatar al Presidente\n\nÉsta es tu mayor prioridad. La seguridad del Presidente es de suma importancia. Debes encontrar la manera de protegerle hasta que llegue la ayuda o el peligro haya pasado.\n\nFIN\n"
    },
    {
        "id": "L_AZT_004",
        "en": "\n",
        "gb": "\n",
        "jp": "\n",
        "it": "\n",
        "fr": "\n",
        "de": "\n",
        "es": "\n"
    },
    {
        "id": "L_AZT_005",
        "en": "Retrieve Presidential medical scanner\n",
        "gb": "Retrieve Presidential medical scanner\n",
        "jp": "Retrieve Presidential Medical Scanner\n",
        "it": "Recupera scanner medico del Presidente\n",
        "fr": "Récupérer scanner médical présidentiel\n",
        "de": "Finden Sie den medizinischen Scanner!\n",
        "es": "Recuperar escáner médico del Presidente\n"
    },
    {
        "id": "L_AZT_006",
        "en": "Activate distress beacon\n",
        "gb": "Activate distress beacon\n",
        "jp": "Activate Distress Beacon\n",
        "it": "Attiva il segnale di pericolo\n",
        "fr": "Activer le signal de détresse\n",
        "de": "Aktivieren Sie das Notsignal!\n",
        "es": "Activar la señal de socorro\n"
    },
    {
        "id": "L_AZT_007",
        "en": "Shut down enemy jamming device\n",
        "gb": "Shut down enemy jamming device\n",
        "jp": "Shutdown Enemy Jamming Device\n",
        "it": "Disattiva il dispositivo di disturbo\n",
        "fr": "Désactiver appareil brouillage\n",
        "de": "Deaktivieren Sie den Generator!\n",
        "es": "Apagar la señal de bloqueo enemiga\n"
    },
    {
        "id": "L_AZT_008",
        "en": "Retire Presidential clone\n",
        "gb": "Retire Presidential clone\n",
        "jp": "Retire Presidential Clone\n",
        "it": "Trova ed elimina il clone del Presidente\n",
        "fr": "Eliminer le clone du Président\n",
        "de": "Eliminieren Sie den Präsidenten-Klon!\n",
        "es": "Eliminar al clon del Presidente\n"
    },
    {
        "id": "L_AZT_009",
        "en": "Locate and rescue President\n",
        "gb": "Locate and rescue President\n",
        "jp": "Locate And Rescue President\n",
        "it": "Trova e salva il Presidente\n",
        "fr": "Trouver et sauver le Président\n",
        "de": "Orten und retten Sie den Präsidenten!\n",
        "es": "Localizar y rescatar al Presidente\n"
    },
    {
        "id": "L_AZT_010",
        "en": "There's the escape pod.\n",
        "gb": "There's the escape pod.\n",
        "jp": "There's the escape pod.\n",
        "it": "Ecco la capsula di salvataggio!\n",
        "fr": "Voilà le point d'évacuation. \n",
        "de": "Ich habe die Rettungskapsel gefunden.\n",
        "es": "Ahí está la cápsula de escape.\n"
    },
    {
        "id": "L_AZT_011",
        "en": "Maybe there's a beacon in there.\n",
        "gb": "Maybe there's a beacon in there.\n",
        "jp": "Maybe there's a beacon in there.\n",
        "it": "Forse si può mandare un segnale da lì!\n",
        "fr": "Le signal peut venir de là. \n",
        "de": "Vielleicht kann ich dort das Notsignal aktivieren.\n",
        "es": "Quizá haya un emisor dentro.\n"
    },
    {
        "id": "L_AZT_012",
        "en": "The jamming... It's coming from that ship.\n",
        "gb": "The jamming... It's coming from that ship.\n",
        "jp": "The jamming... it's coming from that ship.\n",
        "it": "Queste onde... Vengono da quella navicella!\n",
        "fr": "Le brouillage... Il vient de ce vaisseau. \n",
        "de": "Das Dämpfungsfeld... Es wird von diesem Schiff aus generiert.\n",
        "es": "El bloqueo... Proviene de esa nave.\n"
    },
    {
        "id": "L_AZT_013",
        "en": "Elvis... He'll be able to protect the President.\n",
        "gb": "Elvis... He'll be able to protect the President.\n",
        "jp": "Elvis... he'll be able to protect the president.\n",
        "it": "Elvis... Può proteggere lui il Presidente.\n",
        "fr": "Elvis... Il pourra protéger le Président.\n",
        "de": "Elvis... Er ist sicher in der Lage, den Präsidenten zu beschützen.\n",
        "es": "Elvis... Él será capaz de proteger al Presidente.\n"
    },
    {
        "id": "L_AZT_014",
        "en": "Distress beacon has been activated.\n",
        "gb": "Distress beacon has been activated.\n",
        "jp": "Distress Beacon Has Been Activated.\n",
        "it": "Inviato segnale di pericolo.\n",
        "fr": "Signal de détresse activé.\n",
        "de": "Notsignal wurde aktiviert.\n",
        "es": "Señal de socorro activada.\n"
    },
    {
        "id": "L_AZT_015",
        "en": "Critical mission object has been destroyed.\n",
        "gb": "Critical mission object has been destroyed.\n",
        "jp": "Critical Mission Object Has Been Destroyed.\n",
        "it": "Distrutto strumento essenziale alla missione.\n",
        "fr": "Objet crucial détruit.\n",
        "de": "Wichtiges Objekt zerstört\n",
        "es": "Objeto crítico de la misión destruido.\n"
    },
    {
        "id": "L_AZT_016",
        "en": "Obtain Presidential Scanner.\n",
        "gb": "Obtain Presidential Scanner.\n",
        "jp": "Obtain Presidential Scanner\n",
        "it": "Procurati scanner del Presidente.\n",
        "fr": "Obtenir le scanner présidentiel.\n",
        "de": "Finden Sie den medizinischen Scanner!\n",
        "es": "Obtén el Escáner del Presidente.\n"
    },
    {
        "id": "L_AZT_017",
        "en": "\n",
        "gb": "\n",
        "jp": "\n",
        "it": "\n",
        "fr": "\n",
        "de": "\n",
        "es": "\n"
    },
    {
        "id": "L_AZT_018",
        "en": "\n",
        "gb": "\n",
        "jp": "\n",
        "it": "\n",
        "fr": "\n",
        "de": "\n",
        "es": "\n"
    },
    {
        "id": "L_AZT_019",
        "en": "A Presidential Scanner\n",
        "gb": "A Presidential Scanner\n",
        "jp": "A Presidential Scanner\n",
        "it": "Scanner del Presidente!\n",
        "fr": "Un Scanner présidentiel\n",
        "de": "Ein medizinischer Scanner\n",
        "es": "Un Escáner Presidencial\n"
    },
    {
        "id": "L_AZT_020",
        "en": "Picked up a Presidential Scanner.\n",
        "gb": "Picked up a Presidential Scanner.\n",
        "jp": "Picked up a Presidential Scanner\n",
        "it": "Preso scanner del Presidente.\n",
        "fr": "Scanner présidentiel obtenu.\n",
        "de": "Medizinischer Scanner aufgenommen\n",
        "es": "Escáner Presidencial obtenido.\n"
    },
    {
        "id": "L_AZT_021",
        "en": "Jamming device has been shut down.\n",
        "gb": "Jamming device has been shut down.\n",
        "jp": "Jamming Device Has Been Shut Down.\n",
        "it": "Disattivato dispositivo per onde di disturbo.\n",
        "fr": "Appareil de brouillage désactivé.\n",
        "de": "ECM-Generator deaktiviert\n",
        "es": "Dispositivo de bloqueo apagado.\n"
    },
    {
        "id": "L_AZT_022",
        "en": "President has been killed.\n",
        "gb": "President has been killed.\n",
        "jp": "President Has Been Killed.\n",
        "it": "Il Presidente è stato ucciso.\n",
        "fr": "Le Président a été abattu.\n",
        "de": ".\n",
        "es": "El Presidente ha muerto.\n"
    },
    {
        "id": "L_AZT_023",
        "en": "Presidential clone has been eliminated.\n",
        "gb": "Presidential clone has been eliminated.\n",
        "jp": "Presidential Clone Has Been Eliminated.\n",
        "it": "Il clone del Presidente è stato eliminato.\n",
        "fr": "Clone présidentiel éliminé.\n",
        "de": "Präsidenten-Klon wurde eliminiert.\n",
        "es": "El clon del Presidente ha sido eliminado.\n"
    },
    {
        "id": "L_AZT_024",
        "en": "You'll never save him now!\n",
        "gb": "You'll never save him now!\n",
        "jp": "You'll never save him now!\n",
        "it": "Non riuscirai mai a salvarlo!\n",
        "fr": "Vous ne pourrez pas le sauver!\n",
        "de": "Du kannst ihn nicht retten!\n",
        "es": "¡Ahora ya no podrás salvarle!\n"
    },
    {
        "id": "L_AZT_025",
        "en": "President has been rescued.\n",
        "gb": "President has been rescued.\n",
        "jp": "President Has Been Rescued.\n",
        "it": "Il Presidente è stato salvato.\n",
        "fr": "Président sauvé.\n",
        "de": "Der Präsident wurde gerettet.\n",
        "es": "El Presidente ha sido rescatado.\n"
    },
    {
        "id": "L_AZT_026",
        "en": "Obtain Night Vision.\n",
        "gb": "Obtain Night Vision.\n",
        "jp": "Obtain Night Sight\n",
        "it": "Procurati Vista Notturna!\n",
        "fr": "Obtenir Vue nocturne.\n",
        "de": "Erlangen Sie das Nachtsichtgerät!\n",
        "es": "Obtén Visión Nocturna.\n"
    },
    {
        "id": "L_AZT_027",
        "en": "Cassandra De Vries'\n",
        "gb": "Cassandra De Vries'\n",
        "jp": "Cassandra De Vries'\n",
        "it": "Cassandra De Vries:\n",
        "fr": "Cassandra De Vries: \n",
        "de": "Cassandra De Vries\n",
        "es": "Cassandra De Vries:\n"
    },
    {
        "id": "L_AZT_028",
        "en": "Night Vision\n",
        "gb": "Night Vision\n",
        "jp": "Night Sight\n",
        "it": "Vista Notturna\n",
        "fr": "Vue nocturne\n",
        "de": "Nachtsichtgerät\n",
        "es": "V. Nocturna\n"
    },
    {
        "id": "L_AZT_029",
        "en": "Night Vision\n",
        "gb": "Night Vision\n",
        "jp": "Night Sight\n",
        "it": "Vista Notturna\n",
        "fr": "Vue nocturne\n",
        "de": "Nachtsichtgerät\n",
        "es": "Visión Nocturna\n"
    },
    {
        "id": "L_AZT_030",
        "en": "Picked up Night Vision.\n",
        "gb": "Picked up Night Vision.\n",
        "jp": "Picked up Night Sight\n",
        "it": "Presa Vista Notturna.\n",
        "fr": "Vue nocturne obtenue.\n",
        "de": "Nachtsichtgerät aufgenommen\n",
        "es": "Visón Nocturna obtenida.\n"
    },
    {
        "id": "L_AZT_031",
        "en": "Take this; you should find it useful!\n",
        "gb": "Take this; you should find it useful!\n",
        "jp": "Take This, You Should Find It Useful!\n",
        "it": "Ecco, tieni: ti sarà utile!\n",
        "fr": "Prends ceci. Cela te sera utile!\n",
        "de": "Nimm das; es wird sich als nützlich erweisen!\n",
        "es": "Toma esto, ¡lo encontrarás muy útil!\n"
    },
    {
        "id": "L_AZT_032",
        "en": "Ahhh... uuhhhh...\n",
        "gb": "Ahhh... uuhhhh...\n",
        "jp": "Ahhh... uuhhhh...",
        "it": "Aaah... uuuh...\n",
        "fr": "Ahhh... oohhhh...\n",
        "de": "Ahhh... uuhhhh...\n",
        "es": "Ahhh... uuhhhh...\n"
    },
    {
        "id": "L_AZT_033",
        "en": "Ahhh... uhh... owww...\n",
        "gb": "Ahhh... uhh... owww...\n",
        "jp": "Ahhh... uhh... owww...",
        "it": "Aaah... uuuh... oooh...\n",
        "fr": "Ahhh... ohh... ouuuuhhh...\n",
        "de": "Ahhh... uhh... ouuu...\n",
        "es": "Ahhh... uhh... owww...\n"
    },
    {
        "id": "L_AZT_034",
        "en": "Agent Dark! Please report!\n",
        "gb": "Agent Dark! Please report!\n",
        "jp": "Agent Dark! Please report!",
        "it": "Agente Dark! A rapporto!\n",
        "fr": "Agent Dark! Quel est votre statut?\n",
        "de": "Agent Dark! Bitte melden Sie sich!\n",
        "es": "¡Agente Dark! ¡Informe, por favor!\n"
    },
    {
        "id": "L_AZT_035",
        "en": "Perfect Dark, come in!\n",
        "gb": "Perfect Dark, come in!\n",
        "jp": "Perfect Dark, come in!",
        "it": "Perfect Dark, rispondi!\n",
        "fr": "Perfect Dark, répondez!\n",
        "de": "Perfect Dark, kommen!\n",
        "es": "¡Perfect Dark, responda!\n"
    },
    {
        "id": "L_AZT_036",
        "en": "A-agent Dark reporting in...\n",
        "gb": "A-agent Dark reporting in...\n",
        "jp": "A-agent Dark reporting in...",
        "it": "Agente Dark a rapporto, signore!\n",
        "fr": "A-agent Dark au rapport...\n",
        "de": "A-Agent Dark hier...\n",
        "es": "A-agente Dark informando...\n"
    },
    {
        "id": "L_AZT_037",
        "en": "Agent Dark! Please reply!\n",
        "gb": "Agent Dark! Please reply!\n",
        "jp": "Agent Dark! Please reply!",
        "it": "Agente Dark! Rispondi!\n",
        "fr": "Agent Dark! Parlez bon sang!\n",
        "de": "Agent Dark! Bitte antworten Sie!\n",
        "es": "¡Agente Dark! ¡Por favor, responda!\n"
    },
    {
        "id": "L_AZT_038",
        "en": "Something's jamming my transmissions... It's coming from that other craft.\n",
        "gb": "Something's jamming my transmissions... It's coming from that other craft.\n",
        "jp": "Something's jamming my transmissions... maybe it's coming from that other craft.",
        "it": "C'è qualcosa che disturba la comunicazione... Magari proviene da quella navicella!\n",
        "fr": "Quelque chose brouille mes transmissions... Cela vient peut-être de l'autre appareil.\n",
        "de": "Diese Frequenz wird gestört... Das Signal kommt von dort drüben.\n",
        "es": "Algo está bloqueando mis transmisiones... Proviene de esa otra nave.\n"
    },
    {
        "id": "L_AZT_039",
        "en": "I'd better find the jamming device and check that Elvis is okay. Not forgetting the President, of course.\n",
        "gb": "I'd better find the jamming device and check that Elvis is okay. Not forgetting the President, of course.\n",
        "jp": "I'd better find that jamming device, and check that Elvis is okay. Not forgetting the President, of course.",
        "it": "Meglio trovare subito il dispositivo di disturbo e controllare che Elvis stia bene. Non devo scordarmi del Presidente!!!\n",
        "fr": "Je ferais mieux de trouver la source du brouillage et m'assurer qu'Elvis est en bonne santé. Sans oublier le Président...\n",
        "de": "Ich muss diesen Generator finden und sicherstellen, dass es Elvis gut geht. ...und nebenbei soll ich noch den Präsidenten retten.\n",
        "es": "Mejor encontrar el dispositivo de bloqueo y comprobar si Elvis está bien. No olvidando al Presidente, por supuesto.\n"
    },
    {
        "id": "L_AZT_040",
        "en": "How are you feeling, Mr. President?\n",
        "gb": "How are you feeling, Mr. President?\n",
        "jp": "How are you feeling, Mr. President?",
        "it": "Come sta, Sig. Presidente?\n",
        "fr": "Comment vous sentez-vous, M. le Président?\n",
        "de": "Wie fühlen Sie sich, Mr. President?\n",
        "es": "¿Cómo se siente, Sr. Presidente?\n"
    },
    {
        "id": "L_AZT_041",
        "en": "Better now, young lady. Today, I think, will take a while for me to get over. I can't believe Easton would do such a thing. I knew he was ambitious, yes, but this...\n",
        "gb": "Better now, young lady. Today, I think, will take a while for me to get over. I can't believe Easton would do such a thing. I knew he was ambitious, yes, but this...\n",
        "jp": "Better now, young lady. Today, I think, will take a while for me to get over. I can't believe Easton would do such a thing. I knew he was ambitious, yes, but this...",
        "it": "Molto meglio, grazie. Penso che mi ci vorrà un po' per superare questo colpo. Non posso credere che Easton abbia potuto fare una cosa simile. Sapevo sì che era ambizioso, ma fino a questo punto...\n",
        "fr": "Mieux. Merci mon petit. Je me souviendrai de cette journée. Comment Easton a-t-il pu faire une chose pareille? Je le savais ambitieux, mais tout ceci...\n",
        "de": "Gerade eben ein wenig besser. Aber ich werde wohl einige Zeit brauchen, um den heutigen Tag zu vergessen. Ich kann nicht glauben, dass Easton in der Lage ist, so etwas zu tun. Ich wusste, dass er ehrgeizig ist, aber dass er zu so etwas in der Lage ist...\n",
        "es": "Ahora mejor, jovencita. Pero creo que me va a llevar un rato recuperarme. No puedo creer que Easton hiciera algo así. Sabía que era ambicioso, sí, pero esto...\n"
    },
    {
        "id": "L_AZT_042",
        "en": "Just one thing, sir? What is the Pelagic II that Trent wanted so badly?\n",
        "gb": "Just one thing, sir? What is the Pelagic II that Trent wanted so badly?\n",
        "jp": "Just one thing, sir? What is the Pelagic 2 that Trent wanted so badly?",
        "it": "Solo una cosa, signore? Cos'è il Pelagic II che Trent voleva ad ogni costo?\n",
        "fr": "Une question, monsieur. Qu'est-ce que le Pelagic II, cette chose que Trent cherchait?\n",
        "de": "Eine Frage, Sir. Worum handelt es sich bei der Pelagic II? Trent schien dahinter her gewesen zu sein.\n",
        "es": "Sólo una cosa, señor. ¿Qué es el Pelagic II que tanto ansiaba Trent?\n"
    },
    {
        "id": "L_AZT_043",
        "en": "It's a U.S. government deep sea research vessel, one of a kind... The only ship that can conduct a full-scale diving operation at extreme depth. Trent wanted me to loan it to the dataDyne Corporation, but I refused.\n",
        "gb": "It's a U.S. government deep sea research vessel, one of a kind... The only ship that can conduct a full-scale diving operation at extreme depth. Trent wanted me to loan it to the dataDyne Corporation, but I refused.\n",
        "jp": "It's a US government Deep Sea Research Vessel, one of a kind... the only ship that can conduct a full-scale diving operation at extreme depth. Trent wanted me to loan it to the dataDyne Corporation, but I refused.",
        "it": "È un sottomarino di ricerca del governo statunitense, tipo... l'unico sommergibile che possa condurre una completa operazione di immersione nelle profondità oceaniche. Trent voleva che lo prestassi alla dataDyne Corporation, ma io ho rifiutato.\n",
        "fr": "Un vaisseau de recherche sous-marin du gouvernement américain. Un modèle unique pouvant mener des expériences à de grandes profondeurs. Trent a formulé une demande de prêt au nom de la dataDyne Corporation. J'ai refusé.\n",
        "de": "Die Pelagic II ist ein Forschungs-U-Boot der US-Regierung. Dieses Schiff ist ein Prototyp, der in der Lage ist, in extreme Tiefen vorzudringen. Trent wollte, dass ich es als Leihgabe an datyDyne vergebe. Aber ich habe diesem Antrag nicht zugestimmt.\n",
        "es": "Es un navío de investigación de profundidad del gobierno norteamericano, único en su clase... El único barco capaz de dirigir una operación a gran escala a profundidad extrema. Trent quería que se lo prestara a la Corporación dataDyne, pero rehusé.\n"
    },
    {
        "id": "L_AZT_044",
        "en": "Trent has a lot to answer for, but I don't think we'll find him now.\n",
        "gb": "Trent has a lot to answer for, but I don't think we'll find him now.\n",
        "jp": "Trent has a lot to answer for, but I don't think we'll find him now.",
        "it": "Trent deve render conto di molte cose, ma non penso che lo troveremo tanto presto!\n",
        "fr": "Trent devra répondre de ses actes. Encore faut-il le trouver.\n",
        "de": "Trent ist uns wohl mehr als nur eine Antwort schuldig, aber ich glaube nicht, dass wir ihn jetzt finden.\n",
        "es": "Trent tiene bastante que contestar, pero no creo que le encontremos ahora.\n"
    },
    {
        "id": "L_AZT_045",
        "en": "You have failed, Easton. You are a flawed device, and we need you no longer.\n",
        "gb": "You have failed, Easton. You are a flawed device, and we need you no longer.\n",
        "jp": "You have failed, Easton. You are a flawed device, and we need you no longer.",
        "it": "Hai fallito, Easton! Ormai sei totalmente inutile! Non ci servi più!\n",
        "fr": "Vous avez échoué, Easton. Vous êtes un élément corrompu. Nous nous passerons de vous.\n",
        "de": "Sie haben versagt, Easton. Sie stellen eine potentielle Fehlerquelle dar, daher sind Sie nicht länger von Nutzen.\n",
        "es": "Has fallado, Easton. Eres un dispositivo defectuoso, y ya no te necesitamos.\n"
    },
    {
        "id": "L_AZT_046",
        "en": "Just try it, you Scandinavian freak!\n",
        "gb": "Just try it, you Scandinavian freak!\n",
        "jp": "Just try it, you scandinavian freak!",
        "it": "Provaci, pazzo scandinavo!\n",
        "fr": "C'est ça oui. Pétasse suédoise, va!\n",
        "de": "Versuch's nur, du skandinavischer Freak!\n",
        "es": "¡Inténtalo, mamarracho escandinavo!\n"
    },
    {
        "id": "L_AZT_047",
        "en": "Noooooooo!!!\n",
        "gb": "Noooooooo!!!\n",
        "jp": "Noooooooo!!!",
        "it": "Noooooooo!!!\n",
        "fr": "Noooooooon!!!\n",
        "de": "Neiiiiiiiin!!!\n",
        "es": "¡¡¡Noooooooo!!!\n"
    }
]
