[
    {
        "id": "L_PAM_000",
        "en": "|Background - \n\nThe goal of the conspiracy is revealed at last - a massive alien ship lies on the floor of the Pacific. At least partially sentient, though sleeping, the Cetan ship is even now being overrun by the Skedar and their unwitting minions, the dataDyne Corporation.\n\n|Carrington - \n\nOur cursory examination of the research data astounds us. We've put together as many objectives as we can based on our interpretation of this data. The massive structure on the sea floor is a spacecraft of alien origin. It is apparently a sentient craft, of a race called the Cetans, though it is currently dormant. However, it houses the most dangerous weapon you could imagine.\n\n|Objective One: - Reactivate Teleportals\n\nReturning the teleportals to active status will mean you are able to access regions of the Cetan ship that would otherwise be inaccessible; if the Skedar have managed to block off entry to the Control Room, then the long way round might be your only other way in.\n\n|Objective Two: - Disable Cetan Megaweapon\n\nThis is what it is all about - a weapon of fantastic magnitude. According to the deciphered research notes, it is capable of reversing the weak nuclear forces that hold molecules together. If the Skedar get their hands on this, Earth will be an expanding cloud of dust within the hour. It's up to you - destroy the power nodes throughout the ship, and the weapon will be inoperable. Some may be beyond the reach of normal weapons.\n\n|Objective Three: - Secure Control Room\n\nMake sure that Skedar are cleared from the Control Room to enable you to restore Dr. Caroll's personality backup without interruption. We have no idea what safeguards might have been put in place to prevent anyone attempting this, so be careful.\n\n|Objective Four: - Restore Dr. Caroll's Personality\n\nThis is the last stage of the contingency plan Dr. Caroll put forward during his debriefing at the villa. Restoring his personality to the code breaker construct will reassert his control over both the sapient shell and such parts of the Cetan ship as the code breaker has been able to take over.\n\n|Objective Five: - Escape From Cetan Ship\n\nEscape with Elvis and Dr. Caroll to the docking bay after ensuring the destruction of the vessel by any means necessary. Use the submersible to return to the surface, where you will be collected by the cruiser HMAS Newcastle.\n\nEND\n",
        "gb": "|Background - \n\nThe goal of the conspiracy is revealed at last - a massive alien ship lies on the floor of the Pacific. At least partially sentient, though sleeping, the Cetan ship is even now being overrun by the Skedar and their unwitting minions, the dataDyne Corporation.\n\n|Carrington - \n\nOur cursory examination of the research data astounds us. We've put together as many objectives as we can based on our interpretation of this data. The massive structure on the sea floor is a spacecraft of alien origin. It is apparently a sentient craft, of a race called the Cetans, though it is currently dormant. However, it houses the most dangerous weapon you could imagine.\n\n|Objective One: - Reactivate Teleportals\n\nReturning the teleportals to active status will mean you are able to access regions of the Cetan ship that would otherwise be inaccessible; if the Skedar have managed to block off entry to the Control Room, then the long way round might be your only other way in.\n\n|Objective Two: - Disable Cetan Megaweapon\n\nThis is what it is all about - a weapon of fantastic magnitude. According to the deciphered research notes, it is capable of reversing the weak nuclear forces that hold molecules together. If the Skedar get their hands on this, Earth will be an expanding cloud of dust within the hour. It's up to you - destroy the power nodes throughout the ship, and the weapon will be inoperable. Some may be beyond the reach of normal weapons.\n\n|Objective Three: - Secure Control Room\n\nMake sure that Skedar are cleared from the Control Room to enable you to restore Dr. Caroll's personality backup without interruption. We have no idea what safeguards might have been put in place to prevent anyone attempting this, so be careful.\n\n|Objective Four: - Restore Dr. Caroll's Personality\n\nThis is the last stage of the contingency plan Dr. Caroll put forward during his debriefing at the villa. Restoring his personality to the code breaker construct will reassert his control over both the sapient shell and such parts of the Cetan ship as the code breaker has been able to take over.\n\n|Objective Five: - Escape From Cetan Ship\n\nEscape with Elvis and Dr. Caroll to the docking bay after ensuring the destruction of the vessel by any means necessary. Use the submersible to return to the surface, where you will be collected by the cruiser HMAS Newcastle.\n\nEND\n",
        "jp": "|Background - \n\nThe goal of the conspiracy is revealed at last - a massive alien ship lies on the floor of the Pacific. At least partially sentient, though sleeping, the Cetan ship is even now being overrun by the Skedar and their unwitting minions, the dataDyne corporation.\n\n|Carrington - \n\nOur cursory examination of the research data is astounding. We've put together as many objectives as we can based on our interpretation of this data. The massive structure on the sea floor is a spacecraft of alien origin. It is apparently a sentient craft, of a race called the Cetans, though it is currently dormant. However, it houses the most dangerous weapon you could imagine.\n\n|Objective One: - Reactivate Teleportals\n\nReturning the teleportals to active status will mean you are able to access regions of the Cetan ship that would otherwise be inaccessible; if the Skedar have managed to block off entry to the control room, then the long way round might be your only other way in.\n\n|Objective Two: - Disable Cetan Megaweapon\n\nThis is what it is all about - a weapon of fantastic magnitude. According to the deciphered research notes it is capable of reversing the weak nuclear forces that hold molecules together. If the Skedar get their hands on this, Earth will be an expanding cloud of dust within the hour.\n\n|Objective Three: - Secure Control Room\n\nMake sure that Skedar are cleared from the Control Room to enable you to restore Dr. Caroll's personality backup without interruption. We have no idea what safeguards might have been put in place to prevent anyone attempting this, so be careful.\n\n|Objective Four: - Restore Dr Caroll's Personality\n\nThis is the last stage of the contingency plan Dr. Caroll put forward during his debriefing at the villa. Restoring his personality to the codebreaker construct will reassert his control over the both the sapient shell and such parts of the Cetan ship as the codebreaker has been able to take over.\n\n|Objective Five: - Escape From Cetan Ship\n\nEscape with Elvis and Dr. Caroll to the docking bay after ensuring the destruction of the vessel by any means necessary. Use the submersible to return to the surface, where you will be collected by the cruiser HMAS Newcastle.\n\nEND\n",
        "it": "|Situazione:\n\nFinalmente è stato scoperto lo scopo della cospirazione: un'enorme astronave aliena sul fondo dell'Oceano Pacifico. Si tratta di un mezzo spaziale Cetan dotato di vita propria, sebbene attualmente assopito. Al momento sta subendo l'invasione degli Skedar e dei loro meschini tirapiedi, la dataDyne Corporation.\n\n|Carrington:\n\nI risultati della nostra breve analisi dei dati di ricerca ci hanno lasciati esterrefatti: dall'interpretazione dei dati siamo riusciti a scoprire che la gigantesca struttura sul fondo oceanico non è altro che un'astronave di origine aliena. Apparentemente si tratta di un organismo vivente di una razza nota come Cetan, tuttavia ora sembra addormentato. Contiene la bomba più pericolosa mai esistita!\n\n|Obiettivo 1: - Riattiva i teleportali\n\nLa riattivazione dei portali ti permetterà l'ingresso in settori altrimenti inaccessibili dell'astronave Cetan. Qualora gli Skedar fossero già riusciti a bloccare l'entrata alla sala comandi, la tua unica possibilità d'accesso rimarrebbe la lunga via esterna.\n\n|Obiettivo 2: - Disattiva la megabomba Cetan\n\nEcco la causa di tutti i mali: una bomba di dimensioni inimmaginabili. Secondo le note di ricerca sarebbe in grado di invertire le deboli forze nucleari che tengono assieme le molecole. Se dovesse cadere nelle mani degli Skedar, nel giro di un'ora la Terra sarebbe ridotta ad una nuvola di polvere di cui non rimarrebbe che un vago ricordo. Devi disattivare l'arma distruggendo i punti nevralgici di comando sparsi per l'astronave. Attenta: talvolta le armi normali non fuzioneranno.\n\n|Obiettivo 3: - Controlla la sala comandi\n\nAssicurati che gli Skedar stiano lontani dalla sala comandi in modo da permetterti di restituire al Dr. Caroll il suo cervello di backup senza interruzioni. Tuttavia non abbiamo idea di che stratagemmi possano essere stati escogitati per impedirti di portare a termine la tua missione, quindi tieni gli occhi bene aperti!\n\n|Obiettivo 4: - Restituisci il cervello al Dr. Caroll\n\nQuesta è l'ultima fase del piano di contingenza presentato dal Dr. Caroll durante il suo rapporto alla villa. Riportando il suo cervello alla struttura del decodificatore gli sarà restituita la facoltà di comando sul Sapiente e su quelle parti dell'astronave Cetan inglobate dal decodificatore. \n\n|Obiettivo 5: - Fuga dall'astronave Cetan\n\nFuggi con Elvis e il Dr. Caroll verso la darsena dopo esserti accertata della distruzione totale dell'astronave con ogni mezzo necessario. Usa l'unità sommergibile per tornare in superficie, dove sarete prelevati dall'incrociatore HMAS Newcastle.\n\nFINE\n",
        "fr": "|Briefing - \n\nNous avons enfin découvert le but de la conspiration : un gigantesque vaisseau extraterrestre repose au fond de l'océan Pacifique. Bien qu'inactif, le vaisseau cetan est maintenant pris d'assaut par les Skedars et leur alliée forcée: la dataDyne Corporation.\n\n|Carrington - \n\nLa première analyse des données révèle des informations incroyables. Nous avons déterminé autant d'objectifs que possible à partir de ces informations. La gigantesque structure au fond de l'océan est un vaisseau d'origine extraterrestre. C'est apparemment un vaisseau doué de raison - produit par une race extraterrestre, les Cetans - bien qu'il soit pour l'instant endormi. Cependant, il abrite l'arme la plus puissante qui ait jamais existée.\n\n|Objectif 1: - Réactiver les téléporteurs\n\nRéactiver les téléporteurs vous permet d'accéder à des parties du vaisseau qui étaient normalement inaccessibles.  Si les Skedars ont réussi à bloquer l'accès à la Salle de Contrôle, le chemin le plus long sera sûrement le seul et unique possible.\n\n|Objectif 2: - Neutraliser la Super-Arme cetan\n\nC'est une arme d'une puissance fantastique. Selon les notes analysées, elle est capable de disloquer le faible lien qui maintient les molécules entre elles. Si les Skedars mettent la main dessus, la Terre se transformera dans l'heure en un vaste nuage de poussière. A vous donc de jouer: détruisez les modules dans le vaisseau et l'arme ne fonctionnera plus. Certains seront peut-être hors de portée des armes normales.\n\n|Objectif 3: - Sécuriser la Salle de Contrôle\n\nAssurez-vous qu'il ne reste plus aucun Skedar dans la Salle de Contrôle afin de pouvoir restaurer la personnalité du Dr. Caroll sans interruption. Nous ne savons pas quelles sécurités ont été mises en place pour empêcher cette opération, alors soyez prudente.\n\n|Objectif 4: - Restaurer la personnalité du Dr. Caroll\n\nC'est la dernière étape du plan d'urgence mis en place par le Dr. Caroll durant le debriefing à la villa. Restaurer sa personnalité à l'I.A. lui permettra de reprendre le contrôle de l'enveloppe douée de raison et d'autres parties du vaisseau.\n\n|Objectif 5: - Evasion du vaisseau cetan\n\nEchappez-vous avec Elvis et le Dr. Caroll par les soutes, après vous être assurés de la destruction du vaisseau par n'importe quel moyen. Utilisez le sous-marin pour gagner la surface, où le croiseur HMAS Newcastle vous récupérera.\n\nFIN\n",
        "de": "|Hintergrund - \n\nDas Ziel der Verschwörung wurde endlich aufgedeckt. Am Grunde des Pazifischen Ozeans liegt ein Schiff außerirdischen Ursprungs. Zwar scheint das Schiff zu schlafen, doch ist es partiell empfindungsfähig. Leider wird es derzeit von den Skedar und ihrem ahnungslosen Günstling, der dataDyne Corporation, überrannt.\n\n|Carrington - \n\nBereits die oberflächliche Auswertung der Forschungsdaten hat uns in Erstaunen versetzt. Basierend auf unserer Interpretation dieser Daten ergibt sich eine Reihe von Missionen. Bei dieser gewaltigen Konstruktion auf dem Grund des Meeres handelt es sich um ein außerirdisches Raumschiff. Es ist ein lebender Organismus, kreiert von einer Rasse namens Cetaner. Derzeit scheint es sich in Stasis zu befinden. Auf jeden Fall trägt es die gefährlichste Waffe, die Sie sich vorstellen können, in sich!\n\n|1. Ziel: - Reaktivieren Sie die Teleporter!\n\nDurch das Reaktivieren der Teleporter erhalten Sie Zugang zu Bereichen des Cetanischen Schiffs, die andernfalls unerreichbar wären. Für den Fall, dass die Skedar den Zugang zum Kontrollraum blockiert haben, besteht für Sie zwar die Möglichkeit, eine alternative Route zu wählen, diese ist allerdings wesentlich länger.\n\n|2. Ziel: - Machen Sie die Cetanische Waffe funktionsunfähig!\n\nHierbei handelt es sich um das Hauptziel. Diese Waffe verfügt über unvorstellbare Zerstörungskraft. Nachdem wir die Forschungsdaten ausgewertet haben, kamen wir zu dem Schluss, dass die Waffe die schwachen nuklearen Kräfte, welche alle Moleküle zusammenhalten, reversieren kann. Wenn diese Waffe in die Hände der Skedar gerät, ist die Erde innerhalb einer Stunde nicht mehr als eine schwach expandierende Staubwolke im All. Zerstören Sie alle Kraftknoten innerhalb des Schiffes. Nur so können Sie die Waffe außer Kraft setzen. Einige dieser Knoten könnten sich aber außerhalb menschlicher Reichweite befinden.\n\n|3. Ziel: - Sichern Sie den Kontrollraum!\n\nDer Kontrollraum muss von allen anwesenden Skedar befreit werden, damit Sie Dr. Carolls Persönlichkeit ungestört restaurieren können. Wir wissen nicht, welche Vorkehrungen von den Skedar getroffen wurden, um gerade dies zu verhindern. Seien Sie vorsichtig!\n\n|4. Ziel: - Restaurieren Sie Dr. Carolls Persönlichkeitsprofil!\n\nDies ist die letzte Stufe des Notfallplans, über den uns Dr. Caroll bei seinem Aufenthalt in der Villa informiert hat. Wenn seine Persönlichkeit mit der Codeknacker-Einheit verbunden ist, erlangt er nicht nur wieder die Kontrolle über den Sapienten, sondern auch über manche Teile des Cetanischen Schiffs.\n\n|5. Ziel: - Flüchten Sie aus dem Cetanischen Schiff!\n\nStellen Sie sicher, dass das Schiff unter allen Umständen zerstört wird. Anschließend müssen Sie mit Dr. Caroll und Elvis das Dock erreichen. Gelangen Sie mit Hilfe des Tauchboots an die Oberfläche. Dort sollten Sie von der M.S. Newcastle aufgenommen werden.\n\nENDE\n",
        "es": "|Antecedentes - \n\nLa meta de la conspiración se conoce por fin: una gigantesca nave alienígena se encuentra en el fondo del Pacífico. Parcialmente orgánica, aunque inactiva, la nave Cetan está siendo invadida por los Skedar y sus inconscientes vasallos de la Corporación dataDyne.\n\n|Carrington - \n\nNuestro primer análisis de los datos de la investigación nos han dejado pasmados. Hemos reunido tantos objetivos como hemos podido basándonos en la interpretación de estos datos. La gigantesca estructura del fondo oceánico es una nave espacial de origen alienígena. Aparentemente es una nave orgánica, de una raza llamada Cetan, aunque ahora está inactiva. No obstante, aloja el arma más peligrosa que puedas imaginar.\n\n|Objetivo Uno: - Reactivar los Teleportales\n\nDevolver los teleportales a un estatus activo significará que tendrás acceso a zonas de la nave Cetan que de otra forma hubieran sido inaccesibles; si los Skedar han logrado bloquear la entrada a la Sala de Control, entonces un largo rodeo será el único acceso disponible que podrás encontrar.\n\n|Objetivo Dos: - Desactivar la Mega-Arma Cetan\n\nEsto es todo lo que sabemos: se trata de un arma de una magnitud fantástica. De acuerdo con las notas de investigación descifradas, es capaz de invertir la débil fuerza nuclear que mantiene las moléculas juntas. Si los Skedar ponen sus garras en esto, la Tierra se convertirá en una creciente nube de polvo en sólo una hora. Depende de ti: destruye los nodos de energía a lo largo de la nave, y el arma dejará de ser operativa. Algunos estarán fuera del alcance de las armas normales.\n\n|Objetivo Tres: - Asegurar la Sala de Control\n\nAsegúrate de que la Sala de Control está libre de Skedar para permitirte restaurar la copia de la personalidad del Dr. Caroll sin interrupciones. No tenemos ni idea de qué salvaguardas han instalado en ese lugar para prevenir que alguien lo intente, así que ten cuidado.\n\n|Objetivo Cuatro: - Restaurar la Personalidad del Dr. Caroll\n\nÉsta es la última fase del plan de contingencia que el Dr. Caroll adelantó durante su informe en la Villa. Restaurar su personalidad a la del creador de códigos de apertura reafirmará su control sobre el caparazón inteligente y aquellas partes de la nave Cetan que como 'rompedor de códigos' es capaz de tomar.\n\n|Objetivo Cinco: - Escapar de la Nave Cetan\n\nEscapa con Elvis y el Dr. Caroll por la bahía de carga después de asegurar la destrucción de la nave de la forma en que sea posible. Usa el sumergible para volver a la superficie, donde seréis recogidos por el crucero HMAS Newcastle.\n\nFIN\n"
    },
    {
        "id": "L_PAM_001",
        "en": "CETAN SHIP\n",
        "gb": "CETAN SHIP\n",
        "jp": "CETAN SHIP\n",
        "it": "ASTRONAVE CETAN\n",
        "fr": "VAISSEAU CETAN\n",
        "de": "CETANISCHES SCHIFF\n",
        "es": "NAVE CETAN\n"
    },
    {
        "id": "L_PAM_002",
        "en": "|Background - \n\nThe goal of the conspiracy is revealed at last - a massive alien ship lies on the floor of the Pacific. At least partially sentient, though sleeping, the Cetan ship is even now being overrun by the Skedar and their unwitting minions, the dataDyne Corporation.\n\n|Carrington - \n\nOur cursory examination of the research data astounds us. We've put together as many objectives as we can based on our interpretation of this data. The massive structure on the sea floor is a spacecraft of alien origin. It is apparently a sentient craft, of a race called the Cetans, though it is currently dormant. However, it houses the most dangerous weapon you could imagine.\n\n|Objective One: - Reactivate Teleportals\n\nReturning the teleportals to active status will mean you are able to access regions of the Cetan ship that would otherwise be inaccessible; if the Skedar have managed to block off entry to the Control Room, then the long way round might be your only other way in.\n\n|Objective Two: - Disable Cetan Megaweapon\n\nThis is what it is all about - a weapon of fantastic magnitude. According to the deciphered research notes, it is capable of reversing the weak nuclear forces that hold molecules together. If the Skedar get their hands on this, Earth will be an expanding cloud of dust within the hour. Elvis will sabotage the weapon's systems if you can get him to a terminal.\n\n|Objective Three: - Secure Control Room\n\nMake sure that Skedar are cleared from the Control Room to enable you to restore Dr. Caroll's personality backup without interruption. We have no idea what safeguards might have been put in place to prevent anyone attempting this, so be careful.\n\n|Objective Four: - Escape From Cetan Ship\n\nEscape with Elvis and Dr. Caroll to the docking bay after ensuring the destruction of the vessel by any means necessary. Use the submersible to return to the surface, where you will be collected by the cruiser HMAS Newcastle.\n\nEND\n",
        "gb": "|Background - \n\nThe goal of the conspiracy is revealed at last - a massive alien ship lies on the floor of the Pacific. At least partially sentient, though sleeping, the Cetan ship is even now being overrun by the Skedar and their unwitting minions, the dataDyne Corporation.\n\n|Carrington - \n\nOur cursory examination of the research data astounds us. We've put together as many objectives as we can based on our interpretation of this data. The massive structure on the sea floor is a spacecraft of alien origin. It is apparently a sentient craft, of a race called the Cetans, though it is currently dormant. However, it houses the most dangerous weapon you could imagine.\n\n|Objective One: - Reactivate Teleportals\n\nReturning the teleportals to active status will mean you are able to access regions of the Cetan ship that would otherwise be inaccessible; if the Skedar have managed to block off entry to the Control Room, then the long way round might be your only other way in.\n\n|Objective Two: - Disable Cetan Megaweapon\n\nThis is what it is all about - a weapon of fantastic magnitude. According to the deciphered research notes, it is capable of reversing the weak nuclear forces that hold molecules together. If the Skedar get their hands on this, Earth will be an expanding cloud of dust within the hour. Elvis will sabotage the weapon's systems if you can get him to a terminal.\n\n|Objective Three: - Secure Control Room\n\nMake sure that Skedar are cleared from the Control Room to enable you to restore Dr. Caroll's personality backup without interruption. We have no idea what safeguards might have been put in place to prevent anyone attempting this, so be careful.\n\n|Objective Four: - Escape From Cetan Ship\n\nEscape with Elvis and Dr. Caroll to the docking bay after ensuring the destruction of the vessel by any means necessary. Use the submersible to return to the surface, where you will be collected by the cruiser HMAS Newcastle.\n\nEND\n",
        "jp": "|Background - \n\nThe goal of the conspiracy is revealed at last - a massive alien ship lies on the floor of the Pacific. At least partially sentient, though sleeping, the Cetan ship is even now being overrun by the Skedar and their unwitting minions, the dataDyne corporation.\n\n|Carrington - \n\nOur cursory examination of the research data is astounding. We've put together as many objectives as we can based on our interpretation of this data. The massive structure on the sea floor is a spacecraft of alien origin. It is apparently a sentient craft, of a race called the Cetans, though it is currently dormant. However, it houses the most dangerous weapon you could imagine.\n\n|Objective One: - Reactivate Teleportals\n\nReturning the teleportals to active status will mean you are able to access regions of the Cetan ship that would otherwise be inaccessible; if the Skedar have managed to block off entry to the control room, then the long way round might be your only other way in.\n\n|Objective Two: - Disable Cetan Megaweapon\n\nThis is what it is all about - a weapon of fantastic magnitude. According to the deciphered research notes it is capable of reversing the weak nuclear forces that hold molecules together. If the Skedar get their hands on this, Earth will be an expanding cloud of dust within the hour.\n\n|Objective Three: - Secure Control Room\n\nMake sure that Skedar are cleared from the Control Room to enable you to restore Dr. Caroll's personality backup without interruption. We have no idea what safeguards might have been put in place to prevent anyone attempting this, so be careful.\n\n|Objective Four: - Escape From Cetan Ship\n\nEscape with Elvis and Dr. Caroll to the docking bay after ensuring the destruction of the vessel by any means necessary. Use the submersible to return to the surface, where you will be collected by the cruiser HMAS Newcastle.\n\nEND\n",
        "it": "|Situazione:\n\nFinalmente è stato scoperto lo scopo della cospirazione: un'enorme astronave aliena sul fondo dell'Oceano Pacifico. Si tratta di un mezzo spaziale Cetan dotato di vita propria, sebbene attualmente assopito. Al momento sta subendo l'invasione degli Skedar e dei loro meschini tirapiedi, la dataDyne Corporation.\n\n|Carrington:\n\nI risultati della nostra breve analisi dei dati di ricerca ci hanno lasciati esterrefatti: dall'interpretazione dei dati siamo riusciti a scoprire che la gigantesca struttura sul fondo oceanico non è altro che un'astronave di origine aliena. Apparentemente si tratta di un organismo vivente di una razza nota come Cetan, tuttavia ora sembra addormentato. Contiene la bomba più pericolosa mai esistita!\n\n|Obiettivo 1: - Riattiva i teleportali\n\nLa riattivazione dei portali ti permetterà l'ingresso in settori altrimenti inaccessibili dell'astronave Cetan. Qualora gli Skedar fossero già riusciti a bloccare l'entrata alla sala comandi, la tua unica possibilità d'accesso rimarrebbe la lunga via esterna.\n\n|Obiettivo 2: - Disattiva la megabomba Cetan\n\nEcco la causa di tutti i mali: una bomba di dimensioni inimmaginabili. Secondo le note di ricerca sarebbe in grado di invertire le deboli forze nucleari che tengono assieme le molecole. Se dovesse cadere nelle mani degli Skedar, nel giro di un'ora la Terra sarebbe ridotta ad una nuvola di polvere di cui non rimarrebbe che un vago ricordo. Se riesci a portare Elvis ad uno dei terminali, riuscirà a sabotare l'unità di comando dell'arma.\n\n|Obiettivo 3: - Controlla la sala comandi\n\nAssicurati che gli Skedar stiano lontani dalla sala comandi in modo da permetterti di restituire al Dr. Caroll il suo cervello di backup senza interruzioni. Tuttavia non abbiamo idea di che stratagemmi possano essere stati escogitati per impedirti di portare a termine la tua missione, quindi tieni gli occhi bene aperti!\n\n|Obiettivo 4: - Fuga dall'astronave Cetan\n\nFuggi con Elvis e il Dr. Caroll verso la darsena dopo esserti accertata della distruzione totale dell'astronave con ogni mezzo necessario. Usa l'unità sommergibile per tornare in superficie, dove sarete prelevati dall'incrociatore HMAS Newcastle.\n\nFINE\n",
        "fr": "|Briefing - \n\nNous avons enfin découvert le but de la conspiration : un gigantesque vaisseau extraterrestre repose au fond de l'océan Pacifique. Bien qu'inactif, le vaisseau cetan est maintenant pris d'assaut par les Skedars et leur alliée forcée: la dataDyne Corporation.\n\n|Carrington - \n\nLa première analyse des données révèle des informations incroyables. Nous avons déterminé autant d'objectifs que possible à partir de ces informations. La gigantesque structure au fond de l'océan est un vaisseau d'origine extraterrestre. C'est apparemment un vaisseau doué de raison - produit par une race extraterrestre, les Cetans - bien qu'il soit pour l'instant endormi. Cependant, il abrite l'arme la plus puissante qui ait jamais existé.\n\n|Objectif 1: - Réactiver les téléporteurs\n\nRéactiver les téléporteurs vous permet d'accéder à des parties du vaisseau qui étaient normalement inaccessibles.  Si les Skedars ont réussi à bloquer l'accès à la Salle de Contrôle, le chemin le plus long sera sûrement le seul et unique possible.\n\n|Objectif 2: - Neutraliser la Super-Arme cetan\n\nC'est une arme d'une puissance fantastique. Selon les notes analysées, elle est capable de disloquer le faible lien qui maintient les molécules entre elles. Si les Skedars mettent la main dessus, la Terre se transformera dans l'heure en un vaste nuage de poussière. A vous donc de jouer: détruisez les modules dans le vaisseau et l'arme ne fonctionnera plus. Certains seront peut-être hors de portée des armes normales.\n\n|Objectif 3: - Sécuriser la Salle de Contrôle\n\nAssurez-vous qu'il ne reste plus aucun Skedar dans la Salle de Contrôle afin de pouvoir restaurer la personnalité du Dr. Caroll sans interruption. Nous ne savons pas quelles sécurités ont été mises en place pour empêcher cette opération, alors soyez prudente.\n\n|Objectif 4: - Evasion du vaisseau cetan\n\nEchappez-vous avec Elvis et le Dr. Caroll par les soutes, après vous être assurés de la destruction du vaisseau par n'importe quel moyen. Utilisez le sous-marin pour gagner la surface, où le croiseur HMAS Newcastle vous récupérera.\n\nFIN\n",
        "de": "|Hintergrund - \n\nDas Ziel der Verschwörung wurde endlich aufgedeckt. Am Grunde des Pazifischen Ozeans liegt ein Schiff außerirdischen Ursprungs. Zwar scheint das Schiff zu schlafen, doch ist es partiell empfindungsfähig. Leider wird es derzeit von den Skedar und ihrem ahnungslosen Günstling, der dataDyne Corporation, überrannt.\n\n|Carrington - \n\nBereits die oberflächliche Auswertung der Forschungsdaten hat uns in Erstaunen versetzt. Basierend auf unserer Interpretation dieser Daten ergibt sich eine Reihe von Missionen. Bei dieser gewaltigen Konstruktion auf dem Grund des Meeres handelt es sich um ein außerirdisches Raumschiff. Es ist ein lebender Organismus, kreiert von einer Rasse namens Cetaner. Derzeit scheint es sich in Stasis zu befinden. Auf jeden Fall trägt es die gefährlichste Waffe, die Sie sich vorstellen können, in sich!\n\n|1. Ziel: - Reaktivieren Sie die Teleporter!\n\nDurch das Reaktivieren der Teleporter erhalten Sie Zugang zu Bereichen des Cetanischen Schiffs, die andernfalls unerreichbar wären. Für den Fall, dass die Skedar den Zugang zum Kontrollraum blockiert haben,besteht für Sie zwar die Möglichkeit, eine alternative Route zu wählen, diese ist allerdings wesentlich länger.\n\n|2. Ziel: - Machen Sie die Cetanische Waffe funktionsunfähig!\n\nHierbei handelt es sich um das Hauptziel. Diese Waffe verfügt über unvorstellbare Zerstörungskraft. Nachdem wir die Forschungsdaten ausgewertet haben, kamen wir zu dem Schluss, dass die Waffe die schwachen nuklearen Kräfte, welche alle Moleküle zusammenhalten, reversieren kann. Wenn diese Waffe in die Hände der Skedar gerät, ist die Erde innerhalb einer Stunde nicht mehr als eine schwach expandierende Staubwolke im All. Bringen Sie Elvis zu einem Terminal, damit er von dort aus die Waffensysteme sabotieren kann.\n\n|3. Ziel: - Sichern Sie den Kontrollraum!\n\nDer Kontrollraum muss von allen anwesenden Skedar befreit werden, damit Sie Dr. Carolls Persönlichkeit ungestört restaurieren können. Wir wissen nicht, welche Vorkehrungen von den Skedar getroffen wurden, um gerade dies zu verhindern. Seien Sie vorsichtig!\n\n|4. Ziel: - Flüchten Sie aus dem Cetanischen Schiff!\n\nStellen Sie sicher, dass das Schiff unter allen Umständen zerstört wird. Anschließend müssen Sie mit Dr. Caroll und Elvis das Dock erreichen. Gelangen Sie mit Hilfe des Tauchboots an die Oberfläche. Dort sollten Sie von der M.S. Newcastle aufgenommen werden.\n\nENDE\n",
        "es": "|Antecedentes - \n\nLa meta de la conspiración se conoce por fin: una gigantesca nave alienígena se encuentra en el fondo del Pacífico. Parcialmente orgánica, aunque inactiva, la nave Cetan está siendo invadida por los Skedar y sus inconscientes vasallos de la Corporación dataDyne.\n\n|Carrington - \n\nNuestro primer análisis de los datos de la investigación nos han dejado pasmados. Hemos reunido tantos objetivos como hemos podido basándonos en la interpretación de estos datos. La gigantesca estructura del fondo oceánico es una nave espacial de origen alienígena. Aparentemente es una nave orgánica, de una raza llamada Cetan, aunque ahora está inactiva. No obstante, aloja el arma más peligrosa que puedas imaginar.\n\n|Objetivo Uno: - Reactivar los Teleportales\n\nDevolver los teleportales a un estatus activo significará que tendrás acceso a zonas de la nave Cetan que de otra forma hubieran sido inaccesibles; si los Skedar han logrado bloquear la entrada a la Sala de Control, entonces un largo rodeo será el único acceso disponible que podrás encontrar.\n\n|Objetivo Dos: - Desactivar la Mega-Arma Cetan\n\nEsto es todo lo que sabemos: se trata de un arma de una magnitud fantástica. De acuerdo con las notas de investigación descifradas, es capaz de invertir la débil fuerza nuclear que mantiene las moléculas juntas. Si los Skedar ponen sus garras en esto, la Tierra se convertirá en una creciente nube de polvo en sólo una hora. Elvis saboteará los sistemas del arma si consigues llevarle a la terminal.\n\n|Objetivo Tres: - Asegurar la Sala de Control\n\nAsegúrate de que la Sala de Control está libre de Skedar para permitirte restaurar la copia de la personalidad del Dr. Caroll sin interrupciones. No tenemos ni idea de qué salvaguardas han instalado en ese lugar para prevenir que alguien lo intente, así que ten cuidado.\n\n|Objetivo Cuatro: - Escapar de la Nave Cetan\n\nEscapa con Elvis y el Dr. Caroll por la bahía de carga después de asegurar la destrucción de la nave de la forma en que sea posible. Usa el sumergible para volver a la superficie, donde seréis recogidos por el crucero HMAS Newcastle.\n\nFIN\n"
    },
    {
        "id": "L_PAM_003",
        "en": "|Background - \n\nThe goal of the conspiracy is revealed at last - a massive alien ship lies on the floor of the Pacific. At least partially sentient, though sleeping, the Cetan ship is even now being overrun by the Skedar and their unwitting minions, the dataDyne Corporation.\n\n|Carrington - \n\nOur cursory examination of the research data astounds us. We've put together as many objectives as we can based on our interpretation of this data. The massive structure on the sea floor is a spacecraft of alien origin. It is apparently a sentient craft, of a race called the Cetans, though it is currently dormant. However, it houses the most dangerous weapon you could imagine.\n\n|Objective One: - Reactivate Teleportals\n\nReturning the teleportals to active status will mean you are able to access regions of the Cetan ship that would otherwise be inaccessible; if the Skedar have managed to block off entry to the Control Room, then the long way round might be your only other way in.\n\n|Objective Two: - Disable Cetan Megaweapon\n\nThis is what it is all about - a weapon of fantastic magnitude. According to the deciphered research notes, it is capable of reversing the weak nuclear forces that hold molecules together. If the Skedar get their hands on this, Earth will be an expanding cloud of dust within the hour. Elvis will sabotage the weapon's systems if you can get him to a terminal.\n\n|Objective Three: - Escape From Cetan Ship\n\nEscape with Elvis and Dr. Caroll to the docking bay after ensuring the destruction of the vessel by any means necessary. Use the submersible to return to the surface, where you will be collected by the cruiser HMAS Newcastle.\n\nEND\n",
        "gb": "|Background - \n\nThe goal of the conspiracy is revealed at last - a massive alien ship lies on the floor of the Pacific. At least partially sentient, though sleeping, the Cetan ship is even now being overrun by the Skedar and their unwitting minions, the dataDyne Corporation.\n\n|Carrington - \n\nOur cursory examination of the research data astounds us. We've put together as many objectives as we can based on our interpretation of this data. The massive structure on the sea floor is a spacecraft of alien origin. It is apparently a sentient craft, of a race called the Cetans, though it is currently dormant. However, it houses the most dangerous weapon you could imagine.\n\n|Objective One: - Reactivate Teleportals\n\nReturning the teleportals to active status will mean you are able to access regions of the Cetan ship that would otherwise be inaccessible; if the Skedar have managed to block off entry to the Control Room, then the long way round might be your only other way in.\n\n|Objective Two: - Disable Cetan Megaweapon\n\nThis is what it is all about - a weapon of fantastic magnitude. According to the deciphered research notes, it is capable of reversing the weak nuclear forces that hold molecules together. If the Skedar get their hands on this, Earth will be an expanding cloud of dust within the hour. Elvis will sabotage the weapon's systems if you can get him to a terminal.\n\n|Objective Three: - Escape From Cetan Ship\n\nEscape with Elvis and Dr. Caroll to the docking bay after ensuring the destruction of the vessel by any means necessary. Use the submersible to return to the surface, where you will be collected by the cruiser HMAS Newcastle.\n\nEND\n",
        "jp": "|Background - \n\nThe goal of the conspiracy is revealed at last - a massive alien ship lies on the floor of the Pacific. At least partially sentient, though sleeping, the Cetan ship is even now being overrun by the Skedar and their unwitting minions, the dataDyne corporation.\n\n|Carrington - \n\nOur cursory examination of the research data is astounding. We've put together as many objectives as we can based on our interpretation of this data. The massive structure on the sea floor is a spacecraft of alien origin. It is apparently a sentient craft, of a race called the Cetans, though it is currently dormant. However, it houses the most dangerous weapon you could imagine.\n\n|Objective One: - Reactivate Teleportals\n\nReturning the teleportals to active status will mean you are able to access regions of the Cetan ship that would otherwise be inaccessible; if the Skedar have managed to block off entry to the control room, then the long way round might be your only other way in.\n\n|Objective Two: - Disable Cetan Megaweapon\n\nThis is what it is all about - a weapon of fantastic magnitude. According to the deciphered research notes it is capable of reversing the weak nuclear forces that hold molecules together. If the Skedar get their hands on this, Earth will be an expanding cloud of dust within the hour.\n\n|Objective Three: - Escape From Cetan Ship\n\nEscape with Elvis and Dr. Caroll to the docking bay after ensuring the destruction of the vessel by any means necessary. Use the submersible to return to the surface, where you will be collected by the cruiser HMAS Newcastle.\n\nEND\n",
        "it": "|Situazione:\n\nFinalmente è stato scoperto lo scopo della cospirazione: un'enorme astronave aliena sul fondo dell'Oceano Pacifico. Si tratta di un mezzo spaziale Cetan dotato di vita propria, sebbene attualmente assopito. Al momento sta subendo l'invasione degli Skedar e dei loro meschini tirapiedi, la dataDyne Corporation.\n\n|Carrington:\n\nI risultati della nostra breve analisi dei dati di ricerca ci hanno lasciati esterrefatti: dall'interpretazione dei dati siamo riusciti a scoprire che la gigantesca struttura sul fondo oceanico non è altro che un'astronave di origine aliena. Apparentemente si tratta di un organismo vivente di una razza nota come Cetan, tuttavia ora sembra addormentato. Contiene la bomba più pericolosa mai esistita!\n\n|Obiettivo 1: - Riattiva i teleportali\n\nLa riattivazione dei portali ti permetterà l'ingresso in settori altrimenti inaccessibili dell'astronave Cetan. Qualora gli Skedar fossero già riusciti a bloccare l'entrata alla sala comandi, la tua unica possibilità d'accesso rimarrebbe la lunga via esterna.\n\n|Obiettivo 2: - Disattiva la megabomba Cetan\n\nEcco la causa di tutti i mali: una bomba di dimensioni inimmaginabili. Secondo le note di ricerca sarebbe in grado di invertire le deboli forze nucleari che tengono assieme le molecole. Se dovesse cadere nelle mani degli Skedar, nel giro di un'ora la Terra sarebbe ridotta ad una nuvola di polvere di cui non rimarrebbe che un vago ricordo. Se riesci a portare Elvis ad uno dei terminali, riuscirà a sabotare l'unità di comando dell'arma.\n\n|Obiettivo 3: - Fuga dall'astronave Cetan\n\nFuggi con Elvis e il Dr. Caroll verso la darsena dopo esserti accertata della distruzione totale dell'astronave con ogni mezzo necessario. Usa l'unità sommergibile per tornare in superficie, dove sarete prelevati dall'incrociatore HMAS Newcastle.\n\nFINE\n",
        "fr": "|Briefing - \n\nNous avons enfin découvert le but de la conspiration : un gigantesque vaisseau extraterrestre repose au fond de l'océan Pacifique. Bien qu'inactif, le vaisseau cetan est maintenant pris d'assaut par les Skedars et leur alliée forcée: la dataDyne Corporation.\n\n|Carrington - \n\nLa première analyse des données révèle des informations incroyables. Nous avons déterminé autant d'objectifs que possible à partir de ces informations. La gigantesque structure au fond de l'océan est un vaisseau d'origine extraterrestre. C'est apparemment un vaisseau doué de raison - produit par une race extraterrestre, les Cetans - bien qu'il soit pour l'instant endormi. Cependant, il abrite l'arme la plus puissante qui ait jamais existée.\n\n|Objectif 1: - Réactiver les téléporteurs\n\nRéactiver les téléporteurs vous permet d'accéder à des parties du vaisseau qui étaient normalement inaccessibles.  Si les Skedars ont réussi à bloquer l'accès à la Salle de Contrôle, le chemin le plus long sera sûrement le seul et unique possible.\n\n|Objectif 2: - Neutraliser la Super-Arme cetan\n\nC'est une arme d'une puissance fantastique. Selon les notes analysées, elle est capable de disloquer le faible lien qui maintient les molécules entre elles. Si les Skedars mettent la main dessus, la Terre se transformera dans l'heure en un vaste nuage de poussière. A vous donc de jouer: détruisez les modules dans le vaisseau et l'arme ne fonctionnera plus. Certains seront peut-être hors de portée des armes normales.\n\n|Objectif 3: - Evasion du vaisseau Cetan\n\nEchappez-vous avec Elvis et le Dr. Caroll par les soutes, après vous être assurés de la destruction du vaisseau par n'importe quel moyen. Utilisez le sous-marin pour gagner la surface, où le croiseur HMAS Newcastle vous récupérera.\n\nFIN\n",
        "de": "|Hintergrund - \n\nDas Ziel der Verschwörung wurde endlich aufgedeckt. Am Grunde des Pazifischen Ozeans liegt ein Schiff außerirdischen Ursprungs. Zwar scheint das Schiff zu schlafen, doch ist es partiell empfindungsfähig. Leider wird es derzeit von den Skedar und ihrem ahnungslosen Günstling, der dataDyne Corporation, überrannt.\n\n|Carrington - \n\nBereits die oberflächliche Auswertung der Forschungsdaten hat uns in Erstaunen versetzt. Basierend auf unserer Interpretation dieser Daten ergibt sich eine Reihe von Missionen. Bei dieser gewaltigen Konstruktion auf dem Grund des Meeres handelt es sich um ein außerirdisches Raumschiff. Es ist ein lebender Organismus, kreiert von einer Rasse namens Cetaner. Derzeit scheint es sich in Stasis zu befinden. Auf jeden Fall trägt es die gefährlichste Waffe, die Sie sich vorstellen können, in sich!\n\n|1. Ziel: - Reaktivieren Sie die Teleporter!\n\nDurch das Reaktivieren der Teleporter erhalten Sie Zugang zu Bereichen des Cetanischen Schiffs, die andernfalls unerreichbar wären. Für den Fall, dass die Skedar den Zugang zum Kontrollraum blockiert haben, besteht für Sie zwar die Möglichkeit, eine alternative Route zu wählen, diese ist allerdings wesentlich länger.\n\n|2. Ziel: - Machen Sie die Cetanische Waffe funktionsunfähig!\n\nHierbei handelt es sich um das Hauptziel. Diese Waffe verfügt über unvorstellbare Zerstörungskraft. Nachdem wir die Forschungsdaten ausgewertet haben, kamen wir zu dem Schluss, dass die Waffe die schwachen nuklearen Kräfte, welche alle Moleküle zusammenhalten, reversieren kann. Wenn diese Waffe in die Hände der Skedar gerät, ist die Erde innerhalb einer Stunde nicht mehr als eine schwach expandierende Staubwolke im All. Bringen Sie Elvis zu einem Terminal, damit er von dort aus die Waffensysteme sabotieren kann.\n\n|3. Ziel: - Flüchten Sie aus dem Cetanischen Schiff!\n\nStellen Sie sicher, dass das Schiff unter allen Umständen zerstört wird. Anschließend müssen Sie mit Dr. Caroll und Elvis das Dock erreichen. Gelangen Sie mit Hilfe des Tauchboots an die Oberfläche. Dort sollten Sie von der M.S. Newcastle aufgenommen werden.\n\nENDE\n",
        "es": "|Antecedentes - \n\nLa meta de la conspiración se conoce por fin: una gigantesca nave alienígena se encuentra en el fondo del Pacífico. Parcialmente orgánica, aunque inactiva, la nave Cetan está siendo invadida por los Skedar y sus inconscientes vasallos de la Corporación dataDyne.\n\n|Carrington - \n\nNuestro primer análisis de los datos de la investigación nos han dejado pasmados. Hemos reunido tantos objetivos como hemos podido basándonos en la interpretación de estos datos. La gigantesca estructura del fondo oceánico es una nave espacial de origen alienígena. Aparentemente es una nave orgánica, de una raza llamada Cetan, aunque ahora está inactiva. No obstante, aloja el arma más peligrosa que puedas imaginar.\n\n|Objetivo Uno: - Reactivar los Teleportales\n\nDevolver los teleportales a un estatus activo significará que tendrás acceso a zonas de la nave Cetan que de otra forma hubieran sido inaccesibles; si los Skedar han logrado bloquear la entrada a la Sala de Control, entonces un largo rodeo será el único acceso disponible que podrás encontrar.\n\n|Objetivo Dos: - Desactivar la Mega-Arma Cetan\n\nEsto es todo lo que sabemos: se trata de un arma de una magnitud fantástica. De acuerdo con las notas de investigación descifradas, es capaz de invertir la débil fuerza nuclear que mantiene las moléculas juntas. Si los Skedar ponen sus garras en esto, la Tierra se convertirá en una creciente nube de polvo en sólo una hora. Elvis saboteará los sistemas del arma si consigues llevarle a la terminal.\n\n|Objetivo Tres: - Escapar de la Nave Cetan\n\nEscapa con Elvis y el Dr. Caroll por la bahía de carga después de asegurar la destrucción de la nave de la forma en que sea posible. Usa el sumergible para volver a la superficie, donde seréis recogidos por el crucero HMAS Newcastle.\n\nFIN\n"
    },
    {
        "id": "L_PAM_004",
        "en": "\n",
        "gb": "\n",
        "jp": "\n",
        "it": "\n",
        "fr": "\n",
        "de": "\n",
        "es": "\n"
    },
    {
        "id": "L_PAM_005",
        "en": "Reactivate teleportals\n",
        "gb": "Reactivate teleportals\n",
        "jp": "Reactivate Teleportals\n",
        "it": "Riattiva i teleportali\n",
        "fr": "Réactiver téléporteurs\n",
        "de": "Reaktivieren Sie die Teleporter!\n",
        "es": "Reactivar los teleportales\n"
    },
    {
        "id": "L_PAM_006",
        "en": "Disable Cetan megaweapon\n",
        "gb": "Disable Cetan megaweapon\n",
        "jp": "Disable Cetan Megaweapon\n",
        "it": "Disattiva la megabomba Cetan \n",
        "fr": "Neutraliser Super-Arme Cetan\n",
        "de": "Machen Sie die Waffe funktionsunfähig!\n",
        "es": "Desactivar la mega-arma Cetan\n"
    },
    {
        "id": "L_PAM_007",
        "en": "Secure control room\n",
        "gb": "Secure control room\n",
        "jp": "Secure Control Room\n",
        "it": "Controlla la sala comandi\n",
        "fr": "Sécuriser la Salle de Contrôle\n",
        "de": "Sichern Sie den Kontrollraum!\n",
        "es": "Asegurar la sala de control\n"
    },
    {
        "id": "L_PAM_008",
        "en": "Restore Dr. Caroll's personality\n",
        "gb": "Restore Dr. Caroll's personality\n",
        "jp": "Restore Dr Caroll's Personality\n",
        "it": "Restituisci il cervello al Dr. Caroll \n",
        "fr": "Restaurer la personnalité du Dr. Caroll\n",
        "de": "Restaurieren Sie Dr. Caroll!\n",
        "es": "Restaurar personalidad del Dr. Caroll\n"
    },
    {
        "id": "L_PAM_009",
        "en": "Escape from Cetan ship\n",
        "gb": "Escape from Cetan ship\n",
        "jp": "Escape From Cetan Ship\n",
        "it": "Fuga dall'astronave Cetan\n",
        "fr": "S'échapper du vaisseau cetan\n",
        "de": "Flüchten Sie aus dem Schiff!\n",
        "es": "Escapar de la nave Cetan\n"
    },
    {
        "id": "L_PAM_010",
        "en": "This will help us to get round the \nship quicker.\n",
        "gb": "This will help us to get round the \nship quicker.\n",
        "jp": "This will help us to get us round the\nship quicker.\n",
        "it": "Questo ci aiuterà a fare il giro \ndell'astronave più velocemente.\n",
        "fr": "Cela nous aidera à nous déplacer plus\n vite dans ce vaisseau.\n",
        "de": "Auf diese Weise kommen wir innerhalb des Schiffs\nschneller voran.\n",
        "es": "Esto nos ayudará a recorrer la \nnave más rápido.\n"
    },
    {
        "id": "L_PAM_011",
        "en": "This antibody masking will protect us from \nthe automatic defenses.\n",
        "gb": "This antibody masking will protect us from \nthe automatic defenses.\n",
        "jp": "This antibody masking will protect us from\nthe automatic defences.\n",
        "it": "Questa immuno-maschera ci proteggerà \ndalle difese automatiche.\n",
        "fr": "Ce camouflage corporel nous aidera à nous \nprotéger des défenses automatiques.\n",
        "de": "Diese Tarnkappe schützt uns vor den automatischen\nVerteidigungsanlagen.\n",
        "es": "Este disfraz de anticuerpos nos protegerá \nde las defensas automáticas.\n"
    },
    {
        "id": "L_PAM_012",
        "en": "There's Dr. Caroll. Let's see if we can \nreverse what was done to him.\n",
        "gb": "There's Dr. Caroll. Let's see if we can \nreverse what was done to him.\n",
        "jp": "There's Dr Caroll. Let's see if we can\nreverse what was done to him.\n",
        "it": "Ecco il Dr. Caroll! Vediamo se riusciamo \nancora a recuperarlo.\n",
        "fr": "Voilà le Dr. Caroll. Voyons voir si nous \npouvons inverser le processus.\n",
        "de": "Da ist Dr. Caroll. Wir müssen versuchen,\nseine Persönlichkeit wieder herzustellen.\n",
        "es": "Ahí está el Dr. Caroll. Veamos si podemos \narreglar lo que le hicieron.\n"
    },
    {
        "id": "L_PAM_013",
        "en": "We have to get out of here!\n",
        "gb": "We have to get out of here!\n",
        "jp": "We have to get out of here!\n",
        "it": "Dobbiamo uscire di qua! Presto!\n",
        "fr": "On doit se barrer d'ici!\n",
        "de": "Wir müssen hier raus!\n",
        "es": "¡Tenemos que salir de aquí!\n"
    },
    {
        "id": "L_PAM_014",
        "en": "Elvis has been killed.\n",
        "gb": "Elvis has been killed.\n",
        "jp": "Elvis Has Been Killed\n",
        "it": "Elvis è stato ucciso.\n",
        "fr": "Elvis a été tué.\n",
        "de": "Elvis wurde eliminiert.\n",
        "es": "Elvis ha muerto.\n"
    },
    {
        "id": "L_PAM_015",
        "en": "Dr. Caroll has been killed.\n",
        "gb": "Dr. Caroll has been killed.\n",
        "jp": "Dr Caroll Has Been Killed\n",
        "it": "Il Dr. Caroll è stato ucciso.\n",
        "fr": "Dr. Caroll a été tué.\n",
        "de": "Dr. Caroll wurde zerstört.\n",
        "es": "El Dr. Caroll ha muerto.\n"
    },
    {
        "id": "L_PAM_016",
        "en": "Cetan ship evacuation successful.\n",
        "gb": "Cetan ship evacuation successful.\n",
        "jp": "Cetan Ship Evacuation Successful\n",
        "it": "Evacuazione dall'astronave Cetan riuscita.\n",
        "fr": "Evacuation du vaisseau Cetan réussie.\n",
        "de": "Evakuierung erfolgreich\n",
        "es": "Evacuación de la nave Cetan exitosa.\n"
    },
    {
        "id": "L_PAM_017",
        "en": "Elvis has unlocked the door.\n",
        "gb": "Elvis has unlocked the door.\n",
        "jp": "Elvis Has Unlocked The Door\n",
        "it": "Elvis ha aperto la porta.\n",
        "fr": "Elvis a déverrouillé la porte.\n",
        "de": "Elvis hat die Tür entriegelt.\n",
        "es": "Elvis ha abierto la puerta.\n"
    },
    {
        "id": "L_PAM_018",
        "en": "Here, take this gun and keep those Skedar \noff my back while I'm working.\n",
        "gb": "Here, take this gun and keep those Skedar \noff my back while I'm working.\n",
        "jp": "Here, take this gun and keep those skedar\noff my back while i'm working\n",
        "it": "To'! Prendi questa e tienimi lontano \nquegli Skedar mentre sto lavorando.\n",
        "fr": "Tiens, prends cette arme et tiens ces Skedars à distance pendant que je travaille.\n",
        "de": "Hier, nimm diese Waffe und halte mir die Skedar\nvom Leib, während ich hier arbeite.\n",
        "es": "Aquí. Coge este arma y mantén a los Skedar \nalejados de mí mientras trabajo.\n"
    },
    {
        "id": "L_PAM_019",
        "en": "Antibody masking has been obtained.\n",
        "gb": "Antibody masking has been obtained.\n",
        "jp": "Antibody Masking Has Been Obtained.\n",
        "it": "Trovata immuno-maschera.\n",
        "fr": "Camouflage corporel obtenu.\n",
        "de": "Tarnkappe wurde aufgenommen.\n",
        "es": "Máscara de anticuerpos obtenida.\n"
    },
    {
        "id": "L_PAM_020",
        "en": "Cetan megaweapon has been disabled.\n",
        "gb": "Cetan megaweapon has been disabled.\n",
        "jp": "Cetan Megaweapon Has Been Disabled.\n",
        "it": "Disattivata megabomba Cetan.\n",
        "fr": "Super-Arme Cetan neutralisée.\n",
        "de": "Die Cetanische Waffe wurde funktionsunfähig gemacht.\n",
        "es": "La mega-arma Cetan ha sido desactivada.\n"
    },
    {
        "id": "L_PAM_021",
        "en": "Control Room has been secured.\n",
        "gb": "Control Room has been secured.\n",
        "jp": "Control Room Has Been Secured.\n",
        "it": "Sala comandi sotto controllo.\n",
        "fr": "Salle de Contrôle sécurisée.\n",
        "de": "Kontrollraum wurde gesichert.\n",
        "es": "La Sala de Control ha sido asegurada.\n"
    },
    {
        "id": "L_PAM_022",
        "en": "Dr. Caroll's personality has been restored.\n",
        "gb": "Dr. Caroll's personality has been restored.\n",
        "jp": "Dr Carolls Personality Has Been Restored.\n",
        "it": "Restituito il cervello al Dr. Caroll.\n",
        "fr": " Personnalité du Dr. Caroll restaurée.\n",
        "de": "Dr. Carolls Presönlichkeitsprofil wurde restauriert.\n",
        "es": "La personalidad del Dr. Caroll ha sido restaurada.\n"
    },
    {
        "id": "L_PAM_023",
        "en": "\n",
        "gb": "\n",
        "jp": "\n",
        "it": "\n",
        "fr": "\n",
        "de": "\n",
        "es": "\n"
    },
    {
        "id": "L_PAM_024",
        "en": "\n",
        "gb": "\n",
        "jp": "\n",
        "it": "\n",
        "fr": "\n",
        "de": "\n",
        "es": "\n"
    },
    {
        "id": "L_PAM_025",
        "en": "Backup disk\n",
        "gb": "Backup disk\n",
        "jp": "Backup Disk\n",
        "it": "Disco di backup\n",
        "fr": "Disque sauvegarde\n",
        "de": "Sicherungsdiskette\n",
        "es": "Disco de seguridad\n"
    },
    {
        "id": "L_PAM_026",
        "en": "A backup disk\n",
        "gb": "A backup disk\n",
        "jp": "A Backup Disk\n",
        "it": "Disco di backup\n",
        "fr": "Un disque sauvegarde \n",
        "de": "Eine Sicherungsdiskette\n",
        "es": "Un disco de seguridad\n"
    },
    {
        "id": "L_PAM_027",
        "en": "\n",
        "gb": "\n",
        "jp": "\n",
        "it": "\n",
        "fr": "\n",
        "de": "\n",
        "es": "\n"
    },
    {
        "id": "L_PAM_028",
        "en": "It looks like this could benefit from \na little bit of sabotage.\n",
        "gb": "It looks like this could benefit from \na little bit of sabotage.\n",
        "jp": "Cover Me Jo, I'll Unlock Those Doors.\n",
        "it": "Sembra che un po' di sabotaggio \nnon possa fargli che bene! \n",
        "fr": "Un peu de sabotage ne ferait pas de mal\n à ce truc.\n",
        "de": "Ich glaube, ein klein wenig Sabotage wäre hier \ndurchaus angebracht.\n",
        "es": "Parece que esto puede beneficiarnos para \nun pequeño sabotaje.\n"
    },
    {
        "id": "L_PAM_029",
        "en": "Time to reactivate those teleportals.\n",
        "gb": "Time to reactivate those teleportals.\n",
        "jp": "Time to reactivate those teleportals.\n",
        "it": "È ora di riattivare questi teleportali.\n",
        "fr": "Il est temps de réactiver ces téléporteurs.\n",
        "de": "Wir sollten nun diese Teleporter reaktivieren.\n",
        "es": "Es hora de reactivar esos teleportales.\n"
    },
    {
        "id": "L_PAM_030",
        "en": "Teleportals have been reactivated.\n",
        "gb": "Teleportals have been reactivated.\n",
        "jp": "Teleportals have been reactivated.\n",
        "it": "I teleportali sono stati riattivati.\n",
        "fr": "Téléporteurs réactivés.\n",
        "de": "Teleporter wurde reaktiviert.\n",
        "es": "Los teleportales han sido reactivados.\n"
    },
    {
        "id": "L_PAM_031",
        "en": "This doesn't seem normal. No one's around.\n",
        "gb": "This doesn't seem normal. No one's around.\n",
        "jp": "This doesn't seem normal. No-one's around.",
        "it": "Non è normale! Non si vede anima viva!\n",
        "fr": "C'est bizarre, il n'y a personne dans le coin.\n",
        "de": "Irgendwas ist hier faul. Es ist niemand zu sehen.\n",
        "es": "Esto no es normal. No hay nadie por aquí.\n"
    },
    {
        "id": "L_PAM_032",
        "en": "No signs of conflict. No spent ammo cases or bullet holes.\n",
        "gb": "No signs of conflict. No spent ammo cases or bullet holes.\n",
        "jp": "No signs of conflict. No spent ammo cases or bullet holes.",
        "it": "Tutto tranquillo!!! Niente bossoli, niente tracce di proiettili!\n",
        "fr": "Pas de traces de combat. Pas de douilles ou d'impacts d'armes à feu.\n",
        "de": "Keine Spuren eines Kampfes. Keine leeren Patronenhülsen oder Einschusslöcher.\n",
        "es": "No hay señales de lucha. No hay casquillos o agujeros de bala.\n"
    },
    {
        "id": "L_PAM_033",
        "en": "But there ought to be a rear guard at least. It makes no sense.\n",
        "gb": "But there ought to be a rear guard at least. It makes no sense.\n",
        "jp": "But there ought to be a rear guard at least. It makes no sense.",
        "it": "Ma ci deve essere almeno qualche retroguardia... Non ha senso!!!\n",
        "fr": "Ca n'a pas de sens. Il devrait au moins y avoir une arrière-garde.\n",
        "de": "Aber es sollte zumindest noch eine Wache hier sein. Das macht alles keinen Sinn.\n",
        "es": "Pero debería haber un guarda al menos. No tiene sentido.\n"
    },
    {
        "id": "L_PAM_034",
        "en": "There has to be someone farther inside. Cover me.\n",
        "gb": "There has to be someone farther inside. Cover me.\n",
        "jp": "There has to be someone further inside. Cover me.",
        "it": "Ci deve essere qualcuno all'interno. Coprimi!\n",
        "fr": "Il doit y avoir quelqu'un plus loin. Couvre-moi.\n",
        "de": "Vielleicht finden wir weiter drinnen noch jemanden. Gib mir Deckung.\n",
        "es": "Debe haber alguien más adelante. Cúbreme.\n"
    },
    {
        "id": "L_PAM_035",
        "en": "Here goes. I just hope dataDyne haven't done anything to prevent this...\n",
        "gb": "Here goes. I just hope dataDyne haven't done anything to prevent this...\n",
        "jp": "Here goes. I just hope dataDyne haven't done anything to prevent this...",
        "it": "Ecco! Spero solo che la dataDyne non abbia fatto niente per impedire...\n",
        "fr": "C'est parti... J'espère que la dataDyne n'a rien prévu pour empêcher ça...\n",
        "de": "Ich hoffe, dass dataDyne nichts unternommen hat, um zu verhindern, dass...\n",
        "es": "Allá vamos. Espero que dataDyne no haya hecho nada para prevenir esto...\n"
    },
    {
        "id": "L_PAM_036",
        "en": "Virus detected.\n",
        "gb": "Virus detected.\n",
        "jp": "Virus detected.",
        "it": "Trovato un virus.\n",
        "fr": "Virus détecté.\n",
        "de": "Virus entdeckt.\n",
        "es": "Virus detectado.\n"
    },
    {
        "id": "L_PAM_037",
        "en": "Me and my big mouth.\n",
        "gb": "Me and my big mouth.\n",
        "jp": "Me and my big mouth.",
        "it": "Io e la mia linguaccia!!!\n",
        "fr": "Ca m'apprendra, tiens...\n",
        "de": "Ich und mein großes Mundwerk.\n",
        "es": "¡Qué bocaza tengo!\n"
    },
    {
        "id": "L_PAM_038",
        "en": "Commencing countermeasures. Commenc..... *** ooOOoh!! *** eeEEe!! *** aaAhh!! *** oOOoh!! *** aAArRrgghh!! *** YEEeeooOOOOOOowWWwlll!! ***\n",
        "gb": "Commencing countermeasures. Commenc..... *** ooOOoh!! *** eeEEe!! *** aaAhh!! *** oOOoh!! *** aAArRrgghh!! *** YEEeeooOOOOOOowWWwlll!! ***\n",
        "jp": "Commencing countermeasures. Commenc....***(gibberish.. squalk.. squalk.. etc..)***  I don't believe it, those vandals have been rearranging my circuitry. I feel cheapened... used! I'm a tart!",
        "it": "Contromisure adottate... Contromi...***(cric... cric... crac... ecc...)***  Non ci posso credere! Quei vandali mi hanno manipolato i circuiti... ***AAAHIIIAAA... cric... crac...\n",
        "fr": "Lancement des contre-mesures. Lancem...***ooOOoh!!***aaAAh!!***aaAAAhh!! ***ooOOoh!!***YaaAAAhh!!***YEEAaAaAaAAAaAAaAHHH!!***\n",
        "de": "Gegenmaßnahmen werden eingeleitet. Gegenma...*** ooOOoh!! *** eeEEe!! *** aaAhh!! *** oOOoh!! *** aAArRrgghh!! *** YEEeeooOOOOOOowWWwlll!! ***\n",
        "es": "Iniciando contramedidas. Inician.....*** ¡¡ooOOoh!! *** ¡¡eeEEe!! *** ¡¡aaAhh!! *** ¡¡oOOoh!! *** ¡¡aAArRrgghh!! *** ¡¡YEEeeooOOOOOOowWWwlll!! ***\n"
    },
    {
        "id": "L_PAM_039",
        "en": "Dr. Caroll? Are you in control again? Can you stop the program?\n",
        "gb": "Dr. Caroll? Are you in control again? Can you stop the program?\n",
        "jp": "Dr. Caroll? Are you in control again? Can you stop the program?",
        "it": "Dr. Caroll? Riprenda il controllo di sé! Riesce a fermare il programma?\n",
        "fr": "Dr. Caroll? Avez-vous repris le contrôle? Pouvez-vous arrêter le programme?\n",
        "de": "Dr. Caroll? Haben Sie sich wieder unter Kontrolle? Können Sie das Programm stoppen?\n",
        "es": "¿Dr. Caroll? ¿Tiene el control de nuevo? ¿Puede detener el programa?\n"
    },
    {
        "id": "L_PAM_040",
        "en": "Yes, I'm back again, my dear. But the program has run far too long for me to prevent it from completing. There is only one way out now.\n",
        "gb": "Yes, I'm back again, my dear. But the program has run far too long for me to prevent it from completing. There is only one way out now.\n",
        "jp": "Yes, I'm back again, my dear. But the program has run far too long for me to prevent it from completing. There is only one way out now.",
        "it": "Sì, sì, ci sono, mia cara! Ma ho paura che il programma sia andato troppo oltre per poterlo fermare adesso. C'è un sola via d'uscita!\n",
        "fr": "En effet, me voilà de retour, très chère. Le programme est lancé depuis trop longtemps pour que je puisse l'arrêter. Il n'y a qu'une seule issue maintenant.\n",
        "de": "Ich habe mich wieder unter Kontrolle. Aber das Programm läuft schon zu lange. Ich kann es jetzt nicht mehr unterbrechen. Es gibt jetzt nur noch eine Möglichkeit.\n",
        "es": "Sí, estoy de vuelta, cariño. Pero el programa ha estado en marcha demasiado como para detenerlo completamente. Sólo existe una manera de acabar con esto...\n"
    },
    {
        "id": "L_PAM_041",
        "en": "What do you mean?\n",
        "gb": "What do you mean?\n",
        "jp": "What do you mean?",
        "it": "Cosa significa?\n",
        "fr": "Que voulez-vous dire?\n",
        "de": "Wovon sprechen Sie?\n",
        "es": "¿Qué quiere decir?\n"
    },
    {
        "id": "L_PAM_042",
        "en": "When the program has run, I will have control of a vastly powerful weapon. It cannot be allowed to exist. So I must destroy the Cetan and, unfortunately, myself along with it. I'm sorry, Joanna... There is no other way and no time to discuss this. Go now - avoid the Skedar and you will have time to escape. It has been an honor to work with you. Goodbye, Joanna Dark.\n",
        "gb": "When the program has run, I will have control of a vastly powerful weapon. It cannot be allowed to exist. So I must destroy the Cetan and, unfortunately, myself along with it. I'm sorry, Joanna... There is no other way and no time to discuss this. Go now - avoid the Skedar and you will have time to escape. It has been an honor to work with you. Goodbye, Joanna Dark.\n",
        "jp": "When the program has run I will have control of a vastly powerful weapon. It cannot be allowed to exist. So I must destroy the Cetan and unfortunately myself along with it. I'm sorry, Joanna: there is no other way, and no time to discuss this. Go now - avoid the Skedar and you will have time to escape. It has been an honour to work with you. Goodbye, Joanna Dark.",
        "it": "Quando il programma avrà finito, sarò ingrado di comandare una bomba potentissima! Non posso permettermi di restare in vita! Devo distruggere i Cetan e con loro me stesso, sfortunatamente! Mi spiace, Joanna... Non c'è altro modo e neanche tempo di discutere la cosa! Ora va! Evita gli Skedar e avrai tutto il tempo di fuggire. È stato un onore lavorare con te. Addio, Joanna Dark!\n",
        "fr": "Quand le programme sera terminé, j'aurai le contrôle d'une arme extrêmement puissante. Cette arme ne doit pas exister. Je dois par conséquent détruire le vaisseau cetan et moi avec, malheureusement. Joanna... Nous n'avons ni le choix ni le temps d'en discuter. Allez-y! Evitez les Skedars et vous aurez le temps de vous échapper. Ce fut un honneur de  travailler avec vous. Adieu, Joanna Dark.\n",
        "de": "Wenn das Programm durchgelaufen ist, bin ich der einzige, der diese schreckliche Waffe kontrollieren kann. Ich darf nicht länger existieren. Das Cetanische Schiff muss mit mir zerstört werden. Es gibt leider keine Alternative, Joanna. Glauben Sie mir! Gehen Sie! Weichen Sie den Skedar aus und flüchten Sie! Es war mir eine große Ehre, mit Ihnen zu arbeiten. Leben Sie wohl, Joanna Dark.\n",
        "es": "Cuando el programa haya acabado, tendré el control de un arma devastadoramente poderosa. No puede permitirse mi existencia. Así que debo destruir la nave Cetan y a mí mismo con ella. Lo siento, Joanna... No hay otra manera, ni tiempo para discutirlo. Vete. Esquiva a los Skedar y tendrás tiempo para escapar. Ha sido un honor trabajar contigo. Adiós, Joanna Dark.\n"
    },
    {
        "id": "L_PAM_043",
        "en": "Cetan megaweapon has been disabled.\n",
        "gb": "Cetan megaweapon has been disabled.\n",
        "jp": null,
        "it": "La megabomba Cetan è stata disattivata.\n",
        "fr": "La Super-Arme Cetan a été neutralisée.\n",
        "de": "Die Cetanische Waffe wurde funktionsunfähig gemacht.\n",
        "es": "La mega-arma Cetan ha sido inutilizada.\n"
    },
    {
        "id": "L_PAM_044",
        "en": "Ammo wasted - unable to disable megaweapon.\n",
        "gb": "Ammo wasted - unable to disable megaweapon.\n",
        "jp": null,
        "it": "Operazione fallita: megabomba ancora attiva.\n",
        "fr": "Munitions épuisées - arme ennemie ne peut être détruite.\n",
        "de": "Munition verschwendet - Die Waffe kann nicht funktionsunfähig gemacht werden.\n",
        "es": "Munición desperdiciada - incapaz de desactivar la mega-arma.\n"
    },
    {
        "id": "L_PAM_045",
        "en": null,
        "gb": null,
        "jp": null,
        "it": null,
        "fr": null,
        "de": null,
        "es": null
    },
    {
        "id": "L_PAM_046",
        "en": null,
        "gb": null,
        "jp": null,
        "it": null,
        "fr": null,
        "de": null,
        "es": null
    },
    {
        "id": "L_PAM_047",
        "en": null,
        "gb": null,
        "jp": null,
        "it": null,
        "fr": null,
        "de": null,
        "es": null
    }
]
